{
  "date": "March 5",
  "holidays": [
    {
      "name": "National Cheese Doodle Day",
      "description": "A crunchy, cheesy celebration dedicated to those orange, puffy, finger-staining snacks we all know and love – cheese doodles! Perfect for munching while binge-watching or sharing at parties.",
      "origin": "Originated in the United States to honor the snack beloved since its invention in the mid-20th century by the Adams-Millis company.",
      "category": "Food Holiday",
      "emoji": "🧀",
      "funFact": "Cheese doodles were accidentally created when a machine designed to make potato chips produced puffed corn curls instead!"
    },
    {
      "name": "Multiple Personality Day",
      "description": "A day to raise awareness about Dissociative Identity Disorder (previously known as Multiple Personality Disorder) and to promote understanding and compassion for those living with the condition.",
      "origin": "Established by psychologist Dr. Arnold D. Richards in 1996 to bring attention to DID and reduce stigma.",
      "category": "Awareness Day",
      "emoji": "🧠",
      "funFact": "March 5 was chosen because it's the birthday of Hervey Cleckley, a notable psychiatrist who contributed to the study of dissociative disorders."
    },
    {
      "name": "Teacher's Day (Czechia and Slovakia)",
      "description": "Celebrates educators and their important role in shaping future generations, coinciding with the birthday of famous educator John Amos Comenius.",
      "origin": "Honors John Amos Comenius, a 17th-century educator who is considered the father of modern education.",
      "category": "Cultural/Educational",
      "emoji": "📚",
      "funFact": "Comenius advocated for universal education and was one of the first to use pictures in textbooks to aid learning."
    },
    {
      "name": "Make Up Your Own Holiday Day",
      "description": "A whimsy day encouraging people to invent and celebrate their very own holiday, no matter how quirky or random!",
      "origin": "An unofficial holiday created by fun-loving people who felt there should be a day dedicated to creativity and imagination.",
      "category": "Fun/Pop Culture",
      "emoji": "🎉",
      "funFact": "This day has no rules—some have created holidays like 'Talk Like a Pirate Day' or 'Dress Like Your Pet Day' on this date!"
    }
  ]
}