{
  "date": "March 6",
  "holidays": [
    {
      "name": "National Oreo Cookie Day",
      "description": "A delicious day to celebrate the iconic black-and-white sandwich cookie loved around the world. Perfect for dunking in milk, baking into desserts, or just savoring plain!",
      "origin": "Created by Oreo enthusiasts to honor the cookie’s debut in 1912 by the National Biscuit Company (Nabisco).",
      "category": "Food",
      "emoji": "🍪",
      "funFact": "More Oreo cookies are consumed in the US than people annually — over 25 billion eaten every year!"
    },
    {
      "name": "Dentist's Day",
      "description": "Celebrate the heroes who keep our smiles healthy and bright. It’s a day to thank dentists for filling cavities and fighting plaque.",
      "origin": "Established to recognize dental professionals and educate people about oral hygiene.",
      "category": "Awareness",
      "emoji": "🦷",
      "funFact": "March 6 was chosen because it honors the birthday of Dr. Charles Horace Mayo, one of the founders of the Mayo Clinic."
    },
    {
      "name": "National Frozen Food Day",
      "description": "A chilly celebration of all things frozen, from veggies and meals to ice cream and popsicles. Perfect excuse to raid your freezer!",
      "origin": "Created to highlight the convenience and innovation of frozen food technology, which started gaining popularity in the early 20th century.",
      "category": "Food",
      "emoji": "❄️",
      "funFact": "Did you know the first frozen meal patent was filed in 1950 by Swanson, who popularized TV dinners?"
    },
    {
      "name": "Creation of the Internet Day",
      "description": "An unofficial nod to the pioneers of the internet, commemorating a step toward the connected world we live in today.",
      "origin": "Marks the date in 1989 when Tim Berners-Lee proposed the idea for the World Wide Web.",
      "category": "Pop Culture/Technology",
      "emoji": "🌐",
      "funFact": "Without this proposal, your funny cat videos and memes wouldn’t exist — all hail Sir Tim Berners-Lee!"
    }
  ]
}