{
  "date": "March 7",
  "holidays": [
    {
      "name": "National Cereal Day",
      "description": "A day to celebrate the crunchy, sweet, and sometimes surprisingly nutritious breakfast staple that has fueled generations.",
      "origin": "Invented by cereal lovers and food enthusiasts who wanted to honor their favorite morning meal on this date.",
      "category": "Food Holiday",
      "emoji": "🥣",
      "funFact": "More than 300 brands of cereal are available in the US alone, making it one of the most diverse food products! Also, March 7 is a perfect prelude to spring breakfast vibes."
    },
    {
      "name": "Alexander Graham Bell Day",
      "description": "Commemorates the birthday of Alexander Graham Bell, the inventor of the telephone and a pioneer in communication technologies.",
      "origin": "Officially recognized to honor Bell's contributions to modern telecommunication.",
      "category": "Historical / Scientific",
      "emoji": "📞",
      "funFact": "Bell was also deeply interested in teaching the deaf and worked on numerous inventions related to speech and hearing."
    },
    {
      "name": "Ellis Island Family History Day",
      "description": "A day for people to explore and celebrate their immigrant roots and family histories, inspired by Ellis Island’s legacy as the gateway for millions of immigrants to the U.S.",
      "origin": "Created by genealogical and immigrant heritage organizations to celebrate multicultural roots.",
      "category": "Cultural / Genealogy",
      "emoji": "🛳️",
      "funFact": "Over 12 million immigrants passed through Ellis Island, making it a symbol of hope and new beginnings for many families."
    },
    {
      "name": "Be Nasty Day",
      "description": "An unofficial, humorous observance encouraging people to get 'nasty' in all the (mostly) fun ways – like embracing your sass, telling it like it is, or getting down on the dance floor.",
      "origin": "A playful internet-born holiday to add some cheeky fun and encourage people to unleash their inner boldness.",
      "category": "Pop Culture / Fun",
      "emoji": "😈",
      "funFact": "It’s a cheeky invitation to let loose, but remember to keep it playful and light-hearted!"
    }
  ]
}