{
  "date": "March 8",
  "holidays": [
    {
      "name": "International Women's Day",
      "description": "A global day celebrating the social, economic, cultural, and political achievements of women, while also advocating for gender equality.",
      "origin": "Started in the early 1900s amid labor movements in North America and Europe; officially recognized by the UN in 1977.",
      "category": "Awareness Day",
      "emoji": "♀️",
      "funFact": "The first official International Women's Day was celebrated on March 19, 1911, but the date shifted to March 8 shortly after and has remained ever since."
    },
    {
      "name": "World Kidney Day",
      "description": "An awareness day dedicated to raising awareness of the importance of our kidneys and reducing the frequency and impact of kidney disease.",
      "origin": "Launched in 2006 by the International Society of Nephrology and International Federation of Kidney Foundations.",
      "category": "Health Awareness",
      "emoji": "🩺",
      "funFact": "Kidneys filter around 50 gallons (190 liters) of blood every single day—even though each kidney only the size of a fist!"
    },
    {
      "name": "Bee Day (National Piña Colada Day in some regions)",
      "description": "While Piña Colada Day is usually July 10, some quirky sources list March 8 as a day to celebrate the tropical cocktail – a fun excuse to enjoy a fruity drink! In some places, it's also unofficially called 'Bee Day' celebrating bees and pollinators essential for pineapples and coconuts.",
      "origin": "Piña Colada Day became popular through cocktail culture; Bee Day emerged as a way to honor pollinators.",
      "category": "Food & Nature",
      "emoji": "🍍🍹🐝",
      "funFact": "The piña colada was declared the official drink of Puerto Rico in 1978 and is made with pineapple juice, coconut cream, and rum."
    },
    {
      "name": "Proofreading Day",
      "description": "A lighthearted nod to the unsung heroes who catch typos, grammar gaffes, and spelling mistakes before text goes public.",
      "origin": "Started in the early 2000s by editorial enthusiasts to raise awareness of the importance of proofreading in publishing.",
      "category": "Literary/Workplace Humor",
      "emoji": "✍️📖",
      "funFact": "Proofreading Day is celebrated on March 8 because '3/8' looks like a backwards 'pa' — short for 'proofreaders' appreciation'."
    }
  ]
}