{
  "date": "March 9",
  "holidays": [
    {
      "name": "National Meatball Day",
      "description": "A delicious day to celebrate one of the most beloved comfort foods: the meatball! Whether smothered in marinara, swimming in gravy, or served Swedish-style, meatballs get their much-deserved spotlight today.",
      "origin": "This food celebration appears to be a social media and food blogger creation to honor meatballs worldwide, but it's grown in popularity every year.",
      "category": "Food Holiday",
      "emoji": "🍝",
      "funFact": "The largest meatball ever made weighed over 2,500 pounds!"
    },
    {
      "name": "Panic Day",
      "description": "An unofficial day encouraging you to panic just a little! It's the perfect excuse to embrace your worries and fears with a humorous twist, then laugh them off.",
      "origin": "Believed to have emerged from quirky internet culture celebrating odd holidays that poke fun at everyday stress.",
      "category": "Funny/Quirky Holiday",
      "emoji": "😱",
      "funFact": "Panic Day is sometimes a reminder to stop and take a breath — or else your panic might become contagious!"
    },
    {
      "name": "International Oreo Day",
      "description": "A fun tribute to the iconic sandwich cookie with its creamy filling and chocolate wafers. Oreo fans around the world celebrate by dunking, twisting, and eating plenty of these sweet treats.",
      "origin": "Created by fans and marketers alike to honor this cookie's anniversary and cultural impact since its debut in 1912.",
      "category": "Food/Pop Culture",
      "emoji": "🍪",
      "funFact": "Over 450 billion Oreos have been eaten since their introduction!"
    },
    {
      "name": "Toy Soldier Day",
      "description": "A day for collectors and nostalgic dreamers to celebrate the tiny, painted toy soldiers that once filled playrooms—reminding us of childhood battles and imaginative adventures.",
      "origin": "This observance celebrates the craftsmanship and history of toy soldiers used for both play and historical education dating back to the 19th century.",
      "category": "Pop Culture/Toy Holiday",
      "emoji": "🪖",
      "funFact": "Some toy soldiers are now collector's items worth thousands of dollars!"
    }
  ]
}