{
  "date": "March 10",
  "holidays": [
    {
      "name": "Pack Your Lunch Day",
      "description": "A day to celebrate the art of packing your own lunch, encouraging creativity, saving money, and enjoying homemade meals.",
      "origin": "An unofficial observance that gained popularity through social media and workplace wellness initiatives, promoting healthy eating habits and reducing waste.",
      "category": "Food & Lifestyle",
      "emoji": "🥪",
      "funFact": "Packing your lunch can save you over $1,000 a year compared to eating out! Plus, you get to be the lunch boss of your own flavor kingdom."
    },
    {
      "name": "Mario Day",
      "description": "A celebration of everyone's favorite Italian plumber, Mario, from the iconic Nintendo video games.",
      "origin": "Played off the abbreviation of March 10 as 'Mar10' resembling 'Mario', the day is embraced by fans worldwide as a tribute to the gaming icon who first appeared in 1981.",
      "category": "Pop Culture & Gaming",
      "emoji": "🎮",
      "funFact": "Mario was originally called 'Jumpman' in his first video game appearance before getting his now-famous name."
    },
    {
      "name": "Middle Name Pride Day",
      "description": "A quirky holiday encouraging people to embrace and appreciate their middle names, often neglected but full of personality and family history.",
      "origin": "Started as a social media challenge to share and celebrate the uniqueness behind middle names and stories attached to them.",
      "category": "Social & Personal Identity",
      "emoji": "📝",
      "funFact": "Some famous people use their middle names as their public stage names, like Samuel Langhorne Clemens, better known as Mark Twain!"
    },
    {
      "name": "International Bagpipe Day",
      "description": "A day to honor the unique sound and cultural heritage of the bagpipes, often associated with Scotland but celebrated worldwide.",
      "origin": "Created by the Bagpipe Society to raise awareness and appreciation of bagpipe music in all its forms.",
      "category": "Music & Culture",
      "emoji": "🎶",
      "funFact": "Despite being linked mostly with Scotland, bagpipes date back thousands of years and various types exist worldwide, from Spain to North Africa!"
    }
  ]
}