{
  "date": "March 12",
  "holidays": [
    {
      "name": "Plant a Flower Day",
      "description": "A quirky day to celebrate nature's blooms by planting a flower and adding beauty to your surroundings.",
      "origin": "Started by garden enthusiasts to encourage people to connect with nature and brighten up their environment as spring begins in many parts of the world.",
      "category": "Nature/Environment",
      "emoji": "🌸",
      "funFact": "Plant a Flower Day perfectly coincides with early spring, when many flowers are just beginning to sprout, making it the ideal day to start a garden!"
    },
    {
      "name": "Girl Scouts Day",
      "description": "Honors the founding of the Girl Scouts of the USA, celebrating community, leadership, and outdoor skills for girls.",
      "origin": "Established to commemorate the founding of Girl Scouts in 1912 by Juliette Gordon Low in Savannah, Georgia.",
      "category": "Historical/Cultural",
      "emoji": "🎖️",
      "funFact": "Juliette Gordon Low started the Girl Scouts with just 18 girls – now there are millions worldwide!"
    },
    {
      "name": "National Alfred Hitchcock Day",
      "description": "A day to celebrate the master of suspense, Alfred Hitchcock, and his iconic contributions to cinema.",
      "origin": "Unofficially recognized by film fans on Hitchcock's birthday, March 12, 1899.",
      "category": "Pop Culture/Film",
      "emoji": "🎥",
      "funFact": "Hitchcock appeared in cameo roles in 39 of his movies, a tradition beloved by fans trying to spot him."
    },
    {
      "name": "International Day of Action Against Police Brutality",
      "description": "A serious day of global protest and awareness to speak out against police violence and seek justice and reform.",
      "origin": "Initiated in 1997 by a coalition of activist groups to coincide with the anniversary of the police killings of three Black youth in Montreal in 1995.",
      "category": "Activism/Social Awareness",
      "emoji": "✊",
      "funFact": "Though serious in nature, this day has sparked worldwide marches every year, highlighting the power of collective action."
    },
    {
      "name": "National Meatball Day",
      "description": "A deliciously fun day to celebrate the iconic and versatile meatball in all its culinary glory!",
      "origin": "Created by food lovers to honor the worldwide love of meatballs, which appear in cuisines from Italy to Sweden to Asia.",
      "category": "Food",
      "emoji": "🍝",
      "funFact": "Meatballs made their way into American cuisine thanks to Italian immigrants, and the day encourages you to try new meatball recipes!"
    }
  ]
}