{
  "date": "March 13",
  "holidays": [
    {
      "name": "National Everything You Think Is Wrong Day",
      "description": "A day to question all your assumptions and embrace the possibility that you might be wrong about pretty much everything — from your favorite pizza topping to your life choices.",
      "origin": "Started as a humorous internet meme turning into an unofficial day to challenge beliefs and spark playful debates.",
      "category": "Awareness / Fun",
      "emoji": "🤔",
      "funFact": "Some people celebrate by deliberately changing their opinions for the day just to see what happens!"
    },
    {
      "name": "Ear Muff Day",
      "description": "Celebrate these cozy winter accessories that keep your ears warm and stylish! Great for acknowledging all things fuzzy and functional.",
      "origin": "Coincides with inventor Chester Greenwood's birthday, who patented the ear muff in 1873.",
      "category": "Inventor Tribute / Apparel",
      "emoji": "🧤",
      "funFact": "Chester Greenwood made his first ear muffs at age 15 because he hated having cold ears while ice skating!"
    },
    {
      "name": "K-9 Veterans Day",
      "description": "A day to honor the brave military working dogs and their handlers for their service and dedication in the armed forces.",
      "origin": "An official day in the US to recognize the invaluable contributions of canine soldiers worldwide.",
      "category": "Military / Awareness",
      "emoji": "🐕🎖️",
      "funFact": "Military dogs have saved thousands of lives by detecting explosives and protecting soldiers in combat."
    },
    {
      "name": "National Potato Chip Day",
      "description": "Celebrate the crunchy, salty, and addictive snack that is potato chips! A perfect excuse to indulge in all flavors, from classic to spicy and beyond.",
      "origin": "Commemorates the invention of the potato chip in the mid-19th century, attributed to a chef trying to satisfy a picky customer.",
      "category": "Food / Snack",
      "emoji": "🍟",
      "funFact": "Despite popular myth crediting Saratoga chips to 1853, the true origin story of potato chips is still debated among food historians."
    }
  ]
}