{
  "date": "March 14",
  "holidays": [
    {
      "name": "Pi Day",
      "description": "Celebrate the mathematical constant π (pi), approximately 3.14, by enjoying pies and indulging in math-related fun!",
      "origin": "Established by physicist Larry Shaw in 1988 at the San Francisco Exploratorium; chosen because the date 3/14 corresponds with the first three digits of pi.",
      "category": "Science/Math",
      "emoji": "🥧",
      "funFact": "Every year at the Exploratorium, people march around a circular space to honor the never-ending nature of pi!"
    },
    {
      "name": "International Day of Action for Rivers",
      "description": "A global day to raise awareness about the importance of rivers and to promote their protection and sustainable management.",
      "origin": "Started by environmental groups to focus attention on river conservation and the threats posed by dams and pollution.",
      "category": "Environmental Awareness",
      "emoji": "🌊",
      "funFact": "March 14 was chosen because it coincides with the UN's World Water Day celebrations, linking freshwater issues worldwide."
    },
    {
      "name": "Potato Chip Day",
      "description": "Celebrate the crispy, crunchy snack that has delighted taste buds worldwide since the 19th century.",
      "origin": "Commemorates the accidental creation of potato chips by chef George Crum in 1853 in Saratoga Springs, New York.",
      "category": "Food",
      "emoji": "🍟",
      "funFact": "Potato chips were originally called \"Saratoga chips,\" and they were created because a customer complained the fries were too thick!"
    },
    {
      "name": "St. Matilda's Day",
      "description": "An unusual historical observance honoring St. Matilda, queen and charitable figure known for her kindness in medieval Europe.",
      "origin": "Named after Matilda of Ringelheim, a 10th-century German queen canonized for her piety and charitable works.",
      "category": "Historical/Religious",
      "emoji": "👑",
      "funFact": "St. Matilda was said to have given away her entire crown to the poor, a legendary example of medieval generosity!"
    }
  ]
}