{
  "date": "March 15",
  "holidays": [
    {
      "name": "Ides of March",
      "description": "Marking the date famously known as the day Julius Caesar was assassinated in 44 BC, the Ides of March is a day steeped in historical drama, political intrigue, and ominous omens. It's a quirky reminder to beware the Ides!",
      "origin": "Ancient Roman calendar, with the 'Ides' referring to the middle of the month; Shakespeare immortalized the date in his play Julius Caesar.",
      "category": "Historical/Pop Culture",
      "emoji": "🗡️",
      "funFact": "The phrase 'Beware the Ides of March' comes from a soothsayer's warning that Caesar ignored—leading to his downfall!"
    },
    {
      "name": "National Everything You Think Is Wrong Day",
      "description": "A hilarious unofficial holiday where you’re encouraged to question your assumptions and be open to alternative perspectives—even if it means admitting you might be wrong.",
      "origin": "Created by humorists as a lighthearted way to promote humility and critical thinking; not an official calendar holiday.",
      "category": "Humor/Self-Reflection",
      "emoji": "🤔",
      "funFact": "On this day, some people purposely argue the opposite of their beliefs just to shake things up and see new viewpoints!"
    },
    {
      "name": "National Peanut Lovers Day",
      "description": "A tasty celebration of peanuts, whether roasted, boiled, in peanut butter, or sprinkled on desserts, this day honors one of the world’s favorite nuts.",
      "origin": "Invented in the 2010s by food enthusiasts to celebrate peanut products and raise awareness about peanuts as a snack and ingredient.",
      "category": "Food",
      "emoji": "🥜",
      "funFact": "Peanut butter was first patented in 1884 by a Canadian pharmacist named Marcellus Gilmore Edson!"
    },
    {
      "name": "World Sleep Day (varies, sometimes falls on March 15)",
      "description": "Dedicated to raising awareness about the importance of sleep and healthy sleep habits. When it lands on March 15, it’s a perfect excuse to take a nap guilt-free!",
      "origin": "Organized by the World Sleep Society, usually observed on the Friday before the March Equinox, occasionally on March 15.",
      "category": "Health Awareness",
      "emoji": "😴",
      "funFact": "Humans spend roughly one-third of their lives sleeping — that’s about 25 years if you live to 75!"
    }
  ]
}