{
  "date": "March 16",
  "holidays": [
    {
      "name": "Everything You Do Is Right Day",
      "description": "A quirky day dedicated to celebrating yourself by acknowledging that everything you do is absolutely right today — no matter what! It’s a fun excuse to boost confidence and banish self-doubt.",
      "origin": "The exact origin is unclear but it emerged in the internet age as a humorous self-empowerment celebration.",
      "category": "Self-empowerment / Humor",
      "emoji": "🎉",
      "funFact": "On this day, people often humorously defend their silliest decisions, claiming they're all perfect! It’s an amusing twist on self-acceptance."
    },
    {
      "name": "Popcorn Lover’s Day",
      "description": "A delicious day honoring the beloved, buttery snack — popcorn! Celebrate by enjoying popcorn in all flavors and forms, whether movie-style, caramel-coated, or spicy.",
      "origin": "Officially recognized as a food holiday with popcorn’s widespread popularity since the late 19th century.",
      "category": "Food / Snack",
      "emoji": "🍿",
      "funFact": "Popcorn kernels can pop up to 3 feet in the air when heated — making it a fun and dynamic snack!"
    },
    {
      "name": "Awkward Moments Day",
      "description": "A lighthearted observance celebrating those cringe-worthy but hilarious awkward moments we all experience. It’s a chance to laugh off embarrassment and bond over shared social blunders.",
      "origin": "Became popular through internet memes and social media discussions highlighting awkward social situations.",
      "category": "Humor / Social",
      "emoji": "😬",
      "funFact": "Studies show that embracing awkward moments can actually reduce social anxiety over time!"
    },
    {
      "name": "National Artichoke Hearts Day",
      "description": "Yes, a day to single out the often-underrated artichoke heart! Foodies celebrate by cooking and appreciating this unique, flavorful part of the artichoke plant.",
      "origin": "Food holidays like this often arise from culinary communities and marketers aiming to spotlight niche ingredients.",
      "category": "Food / Ingredient",
      "emoji": "🌿",
      "funFact": "Artichoke hearts were once considered a delicacy fit only for European royalty!"
    }
  ]
}