{
  "date": "March 19",
  "holidays": [
    {
      "name": "Let's Laugh Day",
      "description": "A day dedicated to the simple but powerful act of laughing. Encourages people to watch comedies, share funny stories, and laugh heartily to boost mood and reduce stress.",
      "origin": "The origins are a bit fuzzy, but it's celebrated mainly in the US as an unofficial way to remind people of the health benefits of laughter.",
      "category": "Mental Health & Wellness",
      "emoji": "😂",
      "funFact": "Laughter can increase pain tolerance and boost your immune system – so celebrating Let's Laugh Day might actually help you stay healthier!"
    },
    {
      "name": "Corn Dog Day",
      "description": "A quirky celebration of the beloved fair food—the corn dog! People honor this tasty treat by eating corn dogs and sharing their favorite recipes or memories of fairs and carnivals.",
      "origin": "Coincides with the birthday of Texan inventor Ed Waldmire, who is credited with popularizing the corn dog in the 1940s.",
      "category": "Food Holiday",
      "emoji": "🌭",
      "funFact": "The corn dog was originally called a 'crusty cur' and was invented as a convenient on-the-go snack for fairs!"
    },
    {
      "name": "St. Joseph's Day",
      "description": "A traditional Christian feast honoring St. Joseph, the husband of Mary and earthly father of Jesus. It's celebrated with special church services, parades, and in some cultures, festive tables laden with specific foods like fava beans and pastries.",
      "origin": "Dates back to early Christian traditions; a major holiday in Italy and countries with Italian heritage.",
      "category": "Religious & Cultural",
      "emoji": "⛪",
      "funFact": "In some cultures, St. Joseph's Day tables are a form of charitable meal, shared with the poor and needy, symbolizing generosity."
    },
    {
      "name": "National Ag Day",
      "description": "A day to recognize and celebrate the abundance provided by agriculture and the farmers, ranchers, and workers who contribute to the food supply worldwide.",
      "origin": "Established by the Agriculture Council of America to increase awareness of agriculture's role in society.",
      "category": "Awareness & Education",
      "emoji": "🌾",
      "funFact": "More than 70% of the U.S. land area is used for agricultural purposes – a vast stage for growing food, fiber, and fuel!"
    }
  ]
}