{
  "date": "March 22",
  "holidays": [
    {
      "name": "World Water Day",
      "description": "A global day dedicated to celebrating freshwater and raising awareness about the importance of sustainable management of water resources.",
      "origin": "Established by the United Nations in 1993 to highlight the importance of water and advocate for equitable access worldwide.",
      "category": "Awareness Day",
      "emoji": "💧",
      "funFact": "Despite covering about 71% of the Earth's surface, only 2.5% of the world's water is freshwater suitable for drinking!"
    },
    {
      "name": "International Goof Off Day",
      "description": "A lighthearted holiday where the goal is to be silly, procrastinate, and have fun instead of working hard.",
      "origin": "A playful unofficial holiday embraced by office workers and students to relieve stress and encourage fun sporadically.",
      "category": "Quirky Holiday",
      "emoji": "🤪",
      "funFact": "On this day, being productive is discouraged—so don't be surprised if your coworkers suddenly become professional daydreamers!"
    },
    {
      "name": "National Supreme Sacrifice Day (USA)",
      "description": "A day to honor those who have made the ultimate sacrifice in the service of their country, particularly military members who died in battle.",
      "origin": "An unofficial U.S. observance to remember fallen soldiers and their families' sacrifices.",
      "category": "Commemorative",
      "emoji": "🎖️",
      "funFact": "March 22 was chosen because it coincides closely with the anniversary of the Battle of Kasserine Pass during World War II."
    },
    {
      "name": "National Bavarian Crepes Day",
      "description": "A delicious day to enjoy traditional Bavarian style crepes—thin pancakes often filled with sweet or savory ingredients.",
      "origin": "A food holiday that celebrates the rich culinary traditions of Bavaria, Germany.",
      "category": "Food Holiday",
      "emoji": "🥞",
      "funFact": "Bavarian crepes are often served with a sprinkle of powdered sugar and a side of warm fruit compote—perfect for a cozy spring day!"
    }
  ]
}