{
  "date": "March 26",
  "holidays": [
    {
      "name": "Make Up Your Own Holiday Day",
      "description": "A day dedicated to the joy of inventing your very own holiday and celebrating it however you like! Whether it's 'Talk Like a Pirate' Day or 'Eat Ice Cream for Breakfast' Day, today’s your chance to be a holiday creator.",
      "origin": "This unofficial holiday emerged from the quirky spirit of holiday enthusiasts who wanted a day to unleash their creativity and fun without limits.",
      "category": "Creative/Unusual",
      "emoji": "🎉",
      "funFact": "You can actually register your invented holiday online and see if it catches on with the world!"
    },
    {
      "name": "Spinach Day",
      "description": "A day to honor the humble spinach leaf – overloaded with nutrients and the secret weapon of cartoon sailor Popeye! Perfect excuse to eat a big bowl of spinach whether raw, steamed, or in a smoothie.",
      "origin": "Observed mostly in the United States, this day celebrates the superfood qualities of spinach and encourages people to eat healthier greens.",
      "category": "Food",
      "emoji": "🥬",
      "funFact": "Spinach is packed with iron, but it was once mistakenly thought to have ten times more than it actually does due to a decimal point error!"
    },
    {
      "name": "Teacher's Day (Czech Republic and Slovakia)",
      "description": "A day celebrating the vital role teachers play in education and society, commemorating John Amos Comenius, the father of modern education.",
      "origin": "March 26 marks the birthday of John Amos Comenius (1592), a Czech philosopher and educator who introduced creative teaching methods and universal education.",
      "category": "Awareness/Educational",
      "emoji": "🍎",
      "funFact": "Comenius invented the picture book method for teaching children, long before modern textbooks existed."
    },
    {
      "name": "Purple Day for Epilepsy Awareness",
      "description": "A day to raise awareness about epilepsy and to support those affected by this often misunderstood neurological disorder by wearing purple and sharing information.",
      "origin": "Purple Day was started by a young Canadian girl named Cassidy Megan in 2008 to bring attention and acceptance to people living with epilepsy.",
      "category": "Health Awareness",
      "emoji": "💜",
      "funFact": "Wearing purple on March 26 supports epilepsy awareness worldwide — purple is associated with 'calm' and 'healing' in many cultures."
    }
  ]
}