{
  "date": "March 30",
  "holidays": [
    {
      "name": "National Pencil Day",
      "description": "A day to celebrate the humble pencil, a tool that has sparked creativity and learning worldwide for centuries.",
      "origin": "National Pencil Day is celebrated on March 30 to mark the birthday of Nicholas-Jacques Conte, the inventor of the modern pencil in 1795.",
      "category": "Creative Tools / Inventions",
      "emoji": "✏️",
      "funFact": "The average pencil can draw a line approximately 35 miles long before it runs out of lead!"
    },
    {
      "name": "Take a Walk in the Park Day",
      "description": "Encourages people to slow down and enjoy a relaxing stroll in a nearby park to refresh mind and body.",
      "origin": "The origin is unclear, but it’s an unofficial day meant to promote wellness and outdoor activity as spring approaches in many regions.",
      "category": "Health & Wellness",
      "emoji": "🌳",
      "funFact": "Walking in green spaces has been shown to boost mood and creativity, so this day could improve your brainpower just with one walk!"
    },
    {
      "name": "Bunsen Burner Day",
      "description": "Honors the invention of the Bunsen burner, a staple piece of laboratory equipment essential for scientific experiments.",
      "origin": "Celebrated on the birthday of Robert Bunsen, the German chemist who invented the burner in 1855.",
      "category": "Science & Education",
      "emoji": "🔥",
      "funFact": "The Bunsen burner allows chemists to heat substances at a consistent and controllable flame, revolutionizing lab work forever."
    },
    {
      "name": "Doctors' Day (India)",
      "description": "A day dedicated to honoring the contributions of doctors in India and recognizing their role in healthcare.",
      "origin": "Observed on the birthday of Dr. Bidhan Chandra Roy, a prominent physician and the second Chief Minister of West Bengal.",
      "category": "Healthcare Appreciation",
      "emoji": "👩‍⚕️👨‍⚕️",
      "funFact": "Dr. B.C. Roy was honored with the Bharat Ratna, India's highest civilian award, for his outstanding service in medicine and politics."
    }
  ]
}