{
  "date": "October 1",
  "plants": [
    {
      "name": "Rudbeckia hirta",
      "commonName": "Black-eyed Susan",
      "description": "A hardy flowering plant native to North America, known for its bright yellow petals surrounding a dark brown central cone. It thrives in meadows and open woodlands and is often found blooming into early fall.",
      "bloomingSeason": "June to October",
      "location": "Eastern and Central North America",
      "colors": [
        "Yellow",
        "Brown"
      ],
      "emoji": "🌻",
      "funFact": "Black-eyed Susans are a symbol of encouragement and motivation, often used in wildflower mixes to bring late-season color."
    },
    {
      "name": "Chrysanthemum morifolium",
      "commonName": "Garden Chrysanthemum",
      "description": "A popular cultivated flower that blooms abundantly in autumn. Garden chrysanthemums come in a variety of vibrant colors and forms, making them a fall garden favorite worldwide.",
      "bloomingSeason": "September to November",
      "location": "Widely cultivated worldwide, native to East Asia",
      "colors": [
        "Yellow",
        "Red",
        "White",
        "Purple",
        "Orange"
      ],
      "emoji": "🌼",
      "funFact": "Chrysanthemums are the flower of November in the United States and symbolize optimism and joy in many cultures."
    },
    {
      "name": "Grevillea robusta",
      "commonName": "Silky Oak",
      "description": "An evergreen tree native to eastern Australia that produces striking orange to golden flowers shaped like spider webs. Flowering peaks in late spring to mid-autumn, providing nectar for birds and bees.",
      "bloomingSeason": "September to November",
      "location": "Eastern Australia",
      "colors": [
        "Orange",
        "Golden"
      ],
      "emoji": "🌺",
      "funFact": "Despite its common name, the Silky Oak is not a true oak but is valued for its strong timber and ornamental flowers."
    },
    {
      "name": "Crocosmia aurea",
      "commonName": "Montbretia",
      "description": "A perennial plant native to South Africa, Crocosmia features vibrant, tubular orange to red flowers on arching stems. It blooms during late summer to early autumn in cooler climates but may bloom into October in warmer regions.",
      "bloomingSeason": "August to October",
      "location": "Southern Africa, cultivated in temperate gardens",
      "colors": [
        "Orange",
        "Red"
      ],
      "emoji": "🌷",
      "funFact": "Montbretia attracts hummingbirds and butterflies, making it a favorite for pollinator gardens."
    }
  ]
}