{
  "date": "October 2",
  "plants": [
    {
      "name": "Dahlia pinnata",
      "commonName": "Dahlia",
      "description": "Dahlias are tuberous perennial plants native to Mexico and Central America, known for their spectacular and diverse flower forms. They bloom profusely in late summer through autumn and are popular garden plants worldwide.",
      "bloomingSeason": "July to October",
      "location": "Northern Hemisphere gardens, especially in temperate zones",
      "colors": [
        "Red",
        "Pink",
        "White",
        "Yellow",
        "Orange",
        "Purple"
      ],
      "emoji": "🌸",
      "funFact": "Dahlias come in more than 42 species and over 20,000 cultivars, showcasing an impressive range of colors and flower shapes."
    },
    {
      "name": "Helianthus annuus",
      "commonName": "Sunflower",
      "description": "Sunflowers are tall annual plants native to North America, famous for their large flower heads that turn to face the sun. They typically bloom late summer to early fall and are grown both for aesthetics and seeds.",
      "bloomingSeason": "Late summer to early fall (August to October)",
      "location": "North and Central America, cultivated worldwide",
      "colors": [
        "Yellow",
        "Orange"
      ],
      "emoji": "🌻",
      "funFact": "Sunflower heads are made up of numerous tiny florets, each capable of producing a seed, making the entire flower an inflorescence."
    },
    {
      "name": "Camellia japonica",
      "commonName": "Japanese Camellia",
      "description": "An evergreen shrub native to East Asia, Camellia japonica produces large, showy flowers that bloom mainly in the cooler months, including autumn and winter. They are prized ornamental plants in temperate regions.",
      "bloomingSeason": "October to April",
      "location": "Japan, Korea, China, widely cultivated in temperate gardens",
      "colors": [
        "Pink",
        "Red",
        "White"
      ],
      "emoji": "🌺",
      "funFact": "Camellias were first introduced to Europe in the 18th century and greatly influenced the development of ornamental horticulture."
    },
    {
      "name": "Grevillea robusta",
      "commonName": "Silky Oak",
      "description": "An evergreen tree native to eastern Australia, known for its fern-like foliage and striking clusters of orange flowers that appear mainly in spring and autumn.",
      "bloomingSeason": "Autumn and spring (March to May and September to November)",
      "location": "Eastern Australia, cultivated in subtropical and tropical areas worldwide",
      "colors": [
        "Orange"
      ],
      "emoji": "🌿",
      "funFact": "Despite its common name, Silky Oak is not a true oak; its wood is prized for furniture making due to its attractive grain and strength."
    }
  ]
}