{
  "date": "October 6",
  "plants": [
    {
      "name": "Chrysanthemum morifolium",
      "commonName": "Chrysanthemum",
      "description": "Chrysanthemums are hardy perennials often called 'mums,' popular in gardens and floral arrangements. They have bushy, flowering stems and come in many vibrant colors, symbolizing autumn in many cultures.",
      "bloomingSeason": "September to November",
      "location": "Temperate regions worldwide (Asia, Europe, North America)",
      "colors": [
        "yellow",
        "orange",
        "red",
        "white",
        "purple"
      ],
      "emoji": "🌼",
      "funFact": "Chrysanthemums were first cultivated in China over 3,000 years ago and are considered a symbol of longevity and rejuvenation."
    },
    {
      "name": "Rhododendron arboreum",
      "commonName": "Tree Rhododendron",
      "description": "An evergreen shrub or small tree known for its spectacular clusters of bright flowers. It thrives in mountainous regions and is the national flower of Nepal.",
      "bloomingSeason": "September to October",
      "location": "Himalayan regions, Nepal, India, Bhutan",
      "colors": [
        "red",
        "pink",
        "white"
      ],
      "emoji": "🌸",
      "funFact": "The tree rhododendron can grow up to 20 meters tall and is an important nectar source for honey bees in its native habitat."
    },
    {
      "name": "Grevillea robusta",
      "commonName": "Silky Oak",
      "description": "A fast-growing evergreen tree native to eastern Australia, valued for both its ornamental orange flowers and timber.",
      "bloomingSeason": "September to November",
      "location": "Subtropical to tropical regions, Australia and cultivated worldwide",
      "colors": [
        "orange"
      ],
      "emoji": "🌺",
      "funFact": "Despite its common name, Silky Oak is not an oak; its name comes from the silky texture of the wood and oak-like leaves."
    },
    {
      "name": "Clerodendrum paniculatum",
      "commonName": "Pagoda Flower",
      "description": "Tropical shrub with large, showy clusters shaped like a pagoda, attracting butterflies and hummingbirds.",
      "bloomingSeason": "Late summer to October",
      "location": "Southeast Asia, tropical gardens",
      "colors": [
        "bright orange",
        "red"
      ],
      "emoji": "🌺",
      "funFact": "The pagoda flower is often planted in temple gardens across Southeast Asia due to its striking architectural flower arrangement."
    }
  ]
}