{
  "date": "October 7",
  "plants": [
    {
      "name": "Chrysanthemum × morifolium",
      "commonName": "Chrysanthemum",
      "description": "Chrysanthemums are popular garden flowers known for their vibrant colors and diverse forms. In temperate regions of the Northern Hemisphere, they bloom in early to mid-autumn, often symbolizing the fall season in gardens and floral arrangements.",
      "bloomingSeason": "September to November",
      "location": "Temperate regions of Northern Hemisphere (e.g., USA, Europe, East Asia)",
      "colors": [
        "yellow",
        "red",
        "white",
        "purple",
        "orange"
      ],
      "emoji": "🌼",
      "funFact": "Chrysanthemums were originally cultivated in China as a flowering herb as early as the 15th century BC."
    },
    {
      "name": "Grevillea robusta",
      "commonName": "Silky Oak",
      "description": "Grevillea robusta is a fast-growing tree native to eastern Australia. It produces bright orange, brush-like flowers that attract nectar-feeding birds and insects. It commonly blooms in spring and autumn in subtropical climates.",
      "bloomingSeason": "September to November",
      "location": "Eastern Australia, also cultivated in subtropical regions worldwide",
      "colors": [
        "orange"
      ],
      "emoji": "🌺",
      "funFact": "Despite its common name, the Silky Oak is actually a member of the Proteaceae family, not a true oak."
    },
    {
      "name": "Erica carnea",
      "commonName": "Winter Heath",
      "description": "Winter Heath is a low-growing evergreen shrub native to mountainous regions of central and southern Europe. It produces bell-shaped flowers in shades of pink, purple, or white. It often starts blooming in late autumn and can persist into the winter months, providing early nectar for pollinators.",
      "bloomingSeason": "October to April",
      "location": "Central and Southern Europe (montane regions)",
      "colors": [
        "pink",
        "purple",
        "white"
      ],
      "emoji": "💐",
      "funFact": "Erica carnea flowers in some of the coldest months, sometimes blooming through snow, hence the name 'Winter Heath'."
    },
    {
      "name": "Lantana camara",
      "commonName": "Lantana",
      "description": "Lantana is a tropical flowering shrub native to Central and South America. It blooms throughout much of the year in tropical and subtropical climates, including October, and is known for its flower clusters that change color as they mature.",
      "bloomingSeason": "Year-round in tropical/subtropical climates",
      "location": "Native to Central and South America; cultivated worldwide in warm climates",
      "colors": [
        "yellow",
        "orange",
        "red",
        "pink",
        "purple"
      ],
      "emoji": "🌸",
      "funFact": "Lantana flowers attract butterflies and hummingbirds and are often used in butterfly gardens."
    }
  ]
}