{
  "date": "October 8",
  "plants": [
    {
      "name": "Cyclamen hederifolium",
      "commonName": "Autumn Cyclamen",
      "description": "A charming perennial with heart-shaped, variegated leaves and delicate pink to magenta flowers that bloom in autumn. Native to woodlands and rocky areas in the Mediterranean basin, it thrives in shady gardens and natural settings.",
      "bloomingSeason": "September to November",
      "location": "Mediterranean region, also cultivated in temperate gardens worldwide",
      "colors": [
        "pink",
        "magenta",
        "white"
      ],
      "emoji": "🌸",
      "funFact": "Cyclamen hederifolium is one of the few cyclamens that bloom in autumn, with flowers sometimes appearing before the leaves."
    },
    {
      "name": "Chrysanthemum morifolium",
      "commonName": "Florist's Chrysanthemum",
      "description": "Widely cultivated for its bright, showy flowers, chrysanthemums bloom in late summer to autumn, providing vibrant color when many other plants fade. They come in a variety of shapes and colors, often used as decorative garden or cut flowers.",
      "bloomingSeason": "September to November",
      "location": "Cultivated worldwide; native to East Asia",
      "colors": [
        "yellow",
        "red",
        "white",
        "purple",
        "orange"
      ],
      "emoji": "🌼",
      "funFact": "Chrysanthemums are symbols of autumn and longevity in many cultures, especially in Japan and China."
    },
    {
      "name": "Solidago canadensis",
      "commonName": "Canada Goldenrod",
      "description": "A tall perennial wildflower producing bright yellow, plume-like flower clusters in late summer and autumn. It is native to North America and often found in meadows and prairies, providing nectar for pollinators in fall.",
      "bloomingSeason": "August to October",
      "location": "Eastern and central North America",
      "colors": [
        "yellow"
      ],
      "emoji": "💛",
      "funFact": "Goldenrod is often mistakenly blamed for hay fever, but the real culprit is ragweed which blooms at the same time."
    },
    {
      "name": "Grevillea robusta",
      "commonName": "Silky Oak",
      "description": "A fast-growing evergreen tree native to eastern Australia, notable for its striking bright orange to reddish flowers that bloom in spring and can extend into autumn in some regions. Its flowers attract birds and insects due to abundant nectar.",
      "bloomingSeason": "September to November",
      "location": "Eastern Australia and cultivated as an ornamental in subtropical and tropical regions worldwide",
      "colors": [
        "orange",
        "red"
      ],
      "emoji": "🌺",
      "funFact": "Despite its name, Silky Oak is not a true oak but belongs to the Proteaceae family and is valued for its timber and ornamental flowers."
    }
  ]
}