{
  "date": "October 11",
  "plants": [
    {
      "name": "Chrysanthemum morifolium",
      "commonName": "Chrysanthemum",
      "description": "Chrysanthemums are popular garden flowers known for their vibrant blooms in various shapes and colors. They are a symbol of autumn in many cultures and are often used in floral arrangements during fall.",
      "bloomingSeason": "September to November",
      "location": "Temperate regions worldwide (native to East Asia)",
      "colors": [
        "yellow",
        "red",
        "white",
        "purple",
        "orange"
      ],
      "emoji": "🌼",
      "funFact": "Chrysanthemums are the flower of the Japanese emperor and the imperial family, symbolizing longevity and rejuvenation."
    },
    {
      "name": "Erica carnea",
      "commonName": "Winter Heath",
      "description": "A low-growing evergreen shrub that produces small bell-shaped flowers. It is one of the earliest blooming heathers, often starting to bloom in autumn and continuing into winter.",
      "bloomingSeason": "October to April",
      "location": "Central and Southern Europe, cultivars grown in temperate gardens worldwide",
      "colors": [
        "pink",
        "purple",
        "white"
      ],
      "emoji": "🌸",
      "funFact": "Winter Heath can bloom even under snow, making it a symbol of perseverance in harsh winter conditions."
    },
    {
      "name": "Nicotiana alata",
      "commonName": "Flowering Tobacco",
      "description": "An ornamental plant with fragrant tubular flowers that open in the evening and attract pollinators such as moths. Widely grown in gardens for its pleasant scent and colorful flowers.",
      "bloomingSeason": "Summer to October (in warm climates)",
      "location": "South America (native), cultivated widely in subtropical and temperate gardens",
      "colors": [
        "white",
        "pink",
        "red",
        "purple"
      ],
      "emoji": "🌺",
      "funFact": "The flower's scent intensifies at night to attract nocturnal pollinators."
    },
    {
      "name": "Grevillea robusta",
      "commonName": "Silky Oak",
      "description": "A fast-growing tree with bright orange to yellow spider-like flowers. Native to eastern Australia, it blooms in spring to autumn, providing nectar for birds and insects.",
      "bloomingSeason": "September to November",
      "location": "Australia, cultivated in subtropical and Mediterranean climates worldwide",
      "colors": [
        "orange",
        "yellow"
      ],
      "emoji": "🌻",
      "funFact": "Despite its common name, Silky Oak is not an oak but a member of the Proteaceae family."
    }
  ]
}