{
  "date": "October 14",
  "plants": [
    {
      "name": "Chrysanthemum morifolium",
      "commonName": "Chrysanthemum",
      "description": "Chrysanthemums are popular garden flowers admired for their vibrant blooms and rich cultural symbolism, especially in East Asia and Europe. They often bloom in autumn, brightening gardens with a variety of colors.",
      "bloomingSeason": "September to November",
      "location": "Temperate regions worldwide, especially in East Asia, Europe, and North America",
      "colors": [
        "yellow",
        "white",
        "red",
        "purple",
        "orange"
      ],
      "emoji": "🌼",
      "funFact": "Chrysanthemums symbolize longevity and rejuvenation in many cultures and are the official flower of the city of Chicago."
    },
    {
      "name": "Clivia miniata",
      "commonName": "Clivia or Kaffir Lily",
      "description": "Clivia miniata is a shade-loving evergreen perennial native to South Africa, known for its striking clusters of trumpet-shaped orange flowers. It typically blooms in late winter to autumn in the Southern Hemisphere.",
      "bloomingSeason": "September to November (Southern Hemisphere)",
      "location": "South Africa and cultivated worldwide in warmer climates",
      "colors": [
        "orange",
        "yellow"
      ],
      "emoji": "🌺",
      "funFact": "Clivia flowers can stay fresh on the plant for up to two months, making it a favorite for indoor floral displays."
    },
    {
      "name": "Calanthe triplicata",
      "commonName": "Christmas Orchid",
      "description": "A terrestrial orchid native to tropical Asia and the Pacific, Calanthe triplicata produces large, fragrant white to pale green flowers that bloom in autumn, often around October to December.",
      "bloomingSeason": "October to December",
      "location": "Tropical Asia, Pacific Islands, Australia",
      "colors": [
        "white",
        "pale green"
      ],
      "emoji": "🌸",
      "funFact": "Unlike many orchids, Calanthe triplicata grows on the ground rather than epiphytically on trees."
    },
    {
      "name": "Solidago canadensis",
      "commonName": "Canada Goldenrod",
      "description": "A wildflower native to North America, this species produces tall spikes of small, bright yellow flowers in late summer to autumn. It plays a crucial role in supporting pollinators during the fall.",
      "bloomingSeason": "August to October",
      "location": "North America, often in fields and roadsides",
      "colors": [
        "yellow"
      ],
      "emoji": "🌻",
      "funFact": "Goldenrod is often mistakenly blamed for hay fever, but it is the allergenic ragweed that blooms simultaneously."
    }
  ]
}