{
  "date": "October 21",
  "plants": [
    {
      "name": "Chrysanthemum indicum",
      "commonName": "Chrysanthemum",
      "description": "A popular flowering plant commonly cultivated in gardens, chrysanthemums are known for their vibrant, daisy-like blooms that thrive in autumn. They have a rich variety of colors and are often associated with fall festivals and decorations.",
      "bloomingSeason": "September to November",
      "location": "Temperate regions of Asia, widely cultivated worldwide",
      "colors": [
        "yellow",
        "white",
        "red",
        "purple"
      ],
      "emoji": "🌼",
      "funFact": "Chrysanthemums are considered the flower of autumn in East Asia and symbolize longevity and rejuvenation."
    },
    {
      "name": "Helianthus annuus",
      "commonName": "Sunflower",
      "description": "Sunflowers are tall, bright annuals with large flower heads that follow the sun's movement. While peak bloom is in late summer, many varieties continue blooming into October, especially in warmer climates.",
      "bloomingSeason": "July to October",
      "location": "Native to North America, cultivated worldwide",
      "colors": [
        "yellow",
        "orange",
        "red"
      ],
      "emoji": "🌻",
      "funFact": "The sunflower's heliotropic movement helps maximize photosynthesis for stronger growth during its blooming period."
    },
    {
      "name": "Camellia japonica",
      "commonName": "Camellia",
      "description": "Camellias are glossy-leaved evergreen shrubs prized for their beautiful, often rose-like flowers. Many varieties start blooming in mid to late autumn, adding color to gardens as other plants begin to fade.",
      "bloomingSeason": "October to March",
      "location": "East Asia, cultivated in temperate gardens worldwide",
      "colors": [
        "pink",
        "red",
        "white"
      ],
      "emoji": "🌺",
      "funFact": "Camellia japonica flowers do not produce a fragrance, yet are highly valued for their elegant form and long blooming season."
    },
    {
      "name": "Nerium oleander",
      "commonName": "Oleander",
      "description": "Oleanders are hardy, evergreen shrubs with clusters of vivid flowers. In Mediterranean and subtropical climates, they bloom prolifically through late autumn.",
      "bloomingSeason": "May to October (sometimes later)",
      "location": "Mediterranean, subtropical regions globally",
      "colors": [
        "pink",
        "white",
        "red"
      ],
      "emoji": "🌸",
      "funFact": "All parts of the oleander plant are highly toxic if ingested, but it remains popular as an ornamental plant due to its resilience and abundant blooms."
    }
  ]
}