{
  "date": "October 23",
  "plants": [
    {
      "name": "Chrysanthemum morifolium",
      "commonName": "Garden Chrysanthemum",
      "description": "A popular autumn-flowering garden plant known for its large, showy blooms in a variety of colors including yellow, white, pink, and red. Chrysanthemums are widely cultivated and are considered symbols of autumn in many cultures.",
      "bloomingSeason": "September to November",
      "location": "Temperate regions worldwide (commonly found in North America, Europe, and East Asia)",
      "colors": [
        "yellow",
        "white",
        "pink",
        "red"
      ],
      "emoji": "🌼",
      "funFact": "Chrysanthemums originate from East Asia and have been cultivated for over 2,500 years, symbolizing longevity and rejuvenation in Chinese and Japanese cultures."
    },
    {
      "name": "Gaillardia pulchella",
      "commonName": "Blanket Flower",
      "description": "A hardy wildflower with bright red and yellow daisy-like petals that bloom profusely in late summer through fall. It thrives in dry, sunny environments and is native to North America.",
      "bloomingSeason": "June to October",
      "location": "Central and Southern United States, Mexico",
      "colors": [
        "red",
        "yellow",
        "orange"
      ],
      "emoji": "🌻",
      "funFact": "The vibrant coloration of Gaillardia flowers attracts pollinators such as bees and butterflies, making it a great plant for ecological gardening."
    },
    {
      "name": "Nicotiana alata",
      "commonName": "Flowering Tobacco",
      "description": "A fragrant, tubular flower that blooms in late summer and fall. It emits a sweet scent in the evening to attract moth pollinators and is often used in ornamental gardens.",
      "bloomingSeason": "August to November",
      "location": "Originally native to South America; widely cultivated in temperate gardens worldwide",
      "colors": [
        "white",
        "pink",
        "red"
      ],
      "emoji": "🌸",
      "funFact": "Nicotiana alata’s scent intensifies at night, an adaptation to attract nocturnal pollinators like hawk moths."
    },
    {
      "name": "Grevillea robusta",
      "commonName": "Silky Oak",
      "description": "An Australian native tree that produces striking bright orange to red spider-like flowers in spring through fall. It is both an ornamental and timber tree species.",
      "bloomingSeason": "September to November",
      "location": "Eastern Australia and cultivated in subtropical and tropical regions",
      "colors": [
        "orange",
        "red"
      ],
      "emoji": "🌺",
      "funFact": "Silky Oak flowers are rich in nectar and attract a variety of birds, especially honeyeaters, playing an important role in local ecosystems."
    }
  ]
}