{
  "date": "October 24",
  "plants": [
    {
      "name": "Cymbidium",
      "commonName": "Boat Orchid",
      "description": "Cymbidium orchids are popular ornamental plants known for their elegant and long-lasting flowers. They bloom in autumn and early winter, producing spikes of beautifully shaped flowers that can be white, pink, green, or yellow.",
      "bloomingSeason": "September to December",
      "location": "Asia, cultivated globally in temperate climates",
      "colors": [
        "white",
        "pink",
        "green",
        "yellow"
      ],
      "emoji": "🌸",
      "funFact": "Cymbidium orchids can thrive in cooler temperatures compared to many tropical orchids, making them favorites for autumn bloom in temperate regions."
    },
    {
      "name": "Chrysanthemum morifolium",
      "commonName": "Garden Chrysanthemum",
      "description": "Chrysanthemums, often called mums, are classic autumn-flowering garden plants. They have dense flower heads in various forms and colors. They are symbols of autumn in many cultures and bloom abundantly in fall months.",
      "bloomingSeason": "September to November",
      "location": "East Asia origin, widely cultivated worldwide",
      "colors": [
        "yellow",
        "red",
        "white",
        "purple"
      ],
      "emoji": "🌼",
      "funFact": "In Japan, chrysanthemums symbolize the imperial family and are celebrated in the annual Festival of Happiness."
    },
    {
      "name": "Lonicera sempervirens",
      "commonName": "Trumpet Honeysuckle",
      "description": "A native honeysuckle species that produces tubular, trumpet-shaped flowers attracting hummingbirds. It blooms in late summer through fall, offering bright red and orange flowers in temperate zones.",
      "bloomingSeason": "June to October",
      "location": "Eastern North America",
      "colors": [
        "red",
        "orange"
      ],
      "emoji": "🌺",
      "funFact": "Trumpet honeysuckle is a favorite nectar source for migrating hummingbirds during their fall journey."
    },
    {
      "name": "Banksia integrifolia",
      "commonName": "Coast Banksia",
      "description": "An Australian native tree species known for its distinctive, large cylindrical flower spikes rich in nectar. It flowers in spring through autumn, including October, providing food for birds and insects.",
      "bloomingSeason": "Year-round in some areas, mainly August to October",
      "location": "Eastern Australia coast",
      "colors": [
        "yellow"
      ],
      "emoji": "🌻",
      "funFact": "Banksia flowers aren’t single flowers but dense clusters of tiny individual flowers packed together."
    }
  ]
}