{
  "date": "2024-10-25",
  "plants": [
    {
      "name": "Chrysanthemum morifolium",
      "commonName": "Garden Chrysanthemum",
      "description": "A popular autumn-flowering plant known for its diverse and vibrant flower forms and colors. Chrysanthemums are cultivated worldwide and often signify the arrival of fall in temperate regions.",
      "bloomingSeason": "September to November",
      "location": "Temperate regions worldwide, especially in North America, Europe, and East Asia",
      "colors": [
        "yellow",
        "red",
        "white",
        "purple",
        "orange"
      ],
      "emoji": "🌼",
      "funFact": "Chrysanthemums are considered the flower of autumn in Japan and are celebrated during the annual Festival of Happiness."
    },
    {
      "name": "Erythrina crista-galli",
      "commonName": "Cockspur Coral Tree",
      "description": "A striking, medium-sized tree famous for its bright red, spiky flowers that bloom in late spring to autumn, favored in subtropical climates of South America.",
      "bloomingSeason": "September to November (Southern Hemisphere spring to autumn)",
      "location": "South America (Argentina, Uruguay, Brazil)",
      "colors": [
        "red"
      ],
      "emoji": "🌺",
      "funFact": "Erythrina crista-galli is the national flower of Argentina and Uruguay."
    },
    {
      "name": "Rhododendron autumnale",
      "commonName": "Autumn Azalea",
      "description": "A deciduous azalea species that blooms in autumn with pink to white flowers, thriving in temperate forests mainly in eastern North America.",
      "bloomingSeason": "September to November",
      "location": "Eastern United States",
      "colors": [
        "pink",
        "white"
      ],
      "emoji": "🌸",
      "funFact": "Unlike many azaleas that bloom in spring, this species uniquely flowers in the fall, adding color late in the year."
    },
    {
      "name": "Banksia integrifolia",
      "commonName": "Coast Banksia",
      "description": "An Australian native tree with golden cylindrical flower spikes that appear in late spring through autumn, important as a nectar source for birds and mammals.",
      "bloomingSeason": "August to December",
      "location": "Eastern Australia",
      "colors": [
        "golden yellow"
      ],
      "emoji": "🌻",
      "funFact": "Coast Banksia's flower spikes are rich in nectar and are a vital resource for honeyeaters and other pollinators during the cooler months."
    }
  ]
}