{
  "date": "October 29",
  "plants": [
    {
      "name": "Chrysanthemum indicum",
      "commonName": "Garden Mum",
      "description": "A popular autumn-flowering plant with densely petaled blossoms, often cultivated in gardens for fall color. Mums are known for their wide range of colors and intricate flower forms.",
      "bloomingSeason": "September to November",
      "location": "Temperate regions worldwide (native to East Asia)",
      "colors": [
        "yellow",
        "white",
        "red",
        "purple",
        "orange"
      ],
      "emoji": "🌼",
      "funFact": "Chrysanthemums hold cultural significance in many countries, symbolizing longevity and rejuvenation in Asia."
    },
    {
      "name": "Cyclamen hederifolium",
      "commonName": "Ivy-leaved Cyclamen",
      "description": "A hardy tuberous perennial that blooms in autumn with delicate pink to magenta flowers, often found in shady woodland environments.",
      "bloomingSeason": "September to November",
      "location": "Mediterranean Basin",
      "colors": [
        "pink",
        "magenta",
        "white"
      ],
      "emoji": "🌸",
      "funFact": "Cyclamen leaves, often heart-shaped or ivy-like, emerge in autumn along with flowers and can have striking silver patterns."
    },
    {
      "name": "Erica carnea",
      "commonName": "Winter Heath",
      "description": "A low-growing evergreen shrub offering bell-shaped flowers through late autumn into winter, favored for adding color to gardens when few other plants bloom.",
      "bloomingSeason": "October to April",
      "location": "Alps and mountainous areas of Europe, cultivated in temperate gardens",
      "colors": [
        "pink",
        "white",
        "purple"
      ],
      "emoji": "🌺",
      "funFact": "Winter Heath is one of the earliest heathers to bloom, often flowering through snow."
    },
    {
      "name": "Magnolia grandiflora",
      "commonName": "Southern Magnolia",
      "description": "An evergreen tree with large, fragrant white flowers that bloom sporadically throughout autumn and early winter in warmer climates.",
      "bloomingSeason": "Summer to November (sporadically)",
      "location": "Southeastern United States and similar climates",
      "colors": [
        "white"
      ],
      "emoji": "🌼",
      "funFact": "Its large glossy leaves and big fragrant flowers make it an iconic ornamental tree in the American South."
    }
  ]
}