{
  "date": "October 30",
  "plants": [
    {
      "name": "Chrysanthemum",
      "commonName": "Chrysanthemum",
      "description": "Chrysanthemums are popular garden flowers known for their vibrant, pompom-shaped blooms, often symbolizing autumn in temperate regions. They come in a variety of colors and are widely cultivated for fall displays.",
      "bloomingSeason": "September to November",
      "location": "Temperate regions worldwide (Asia, Europe, North America)",
      "colors": [
        "yellow",
        "red",
        "white",
        "orange",
        "purple"
      ],
      "emoji": "🌼",
      "funFact": "Chrysanthemums have been cultivated in China for over 2,500 years and are considered a symbol of longevity and rejuvenation."
    },
    {
      "name": "Camellia japonica",
      "commonName": "Camellia",
      "description": "Camellia japonica is an evergreen shrub that blooms in late fall to early spring with rose-like flowers, often in shades of pink, red, or white. It thrives in mild, temperate climates, especially in parts of East Asia and the southeastern United States.",
      "bloomingSeason": "October to April",
      "location": "East Asia and mild temperate regions worldwide",
      "colors": [
        "pink",
        "red",
        "white"
      ],
      "emoji": "🌺",
      "funFact": "The Camellia flower is the state flower of Alabama, USA, and has significant cultural value in East Asia."
    },
    {
      "name": "Grevillea robusta",
      "commonName": "Silky Oak",
      "description": "Grevillea robusta is a fast-growing Australian native tree with bright orange, spider-like flowers. It often blooms in spring and autumn in subtropical and tropical climates, providing nectar for birds and insects.",
      "bloomingSeason": "October to November, and sometimes throughout the year",
      "location": "Australia and subtropical regions worldwide",
      "colors": [
        "orange"
      ],
      "emoji": "🌺",
      "funFact": "Despite its name 'Robusta,' the Silky Oak is not an oak but belongs to the protea family."
    },
    {
      "name": "Calendula officinalis",
      "commonName": "Pot Marigold",
      "description": "Calendula is a hardy annual plant with bright orange or yellow daisy-like flowers. It blooms profusely in cooler months of fall and early winter in temperate regions and is often grown in herb gardens.",
      "bloomingSeason": "September to November",
      "location": "Temperate regions worldwide",
      "colors": [
        "orange",
        "yellow"
      ],
      "emoji": "🌻",
      "funFact": "Calendula flowers have been used medicinally and as a natural dye since ancient times."
    }
  ]
}