{
  "date": "October 31",
  "plants": [
    {
      "name": "Chrysanthemum morifolium",
      "commonName": "Garden Chrysanthemum",
      "description": "A popular ornamental flowering plant known for its vibrant and diverse flower colors. Chrysanthemums often symbolize autumn and are widely cultivated for fall floral displays.",
      "bloomingSeason": "September to November",
      "location": "Temperate regions worldwide",
      "colors": [
        "yellow",
        "white",
        "red",
        "purple",
        "orange"
      ],
      "emoji": "🌼",
      "funFact": "Chrysanthemums have been cultivated in China for over 3,000 years and are often associated with longevity and rejuvenation."
    },
    {
      "name": "Camellia japonica",
      "commonName": "Japanese Camellia",
      "description": "An evergreen shrub producing large, showy, rose-like flowers. Camellias bloom from mid-autumn through winter, adding bright color when many other plants have stopped flowering.",
      "bloomingSeason": "October to March",
      "location": "East Asia (Japan, Korea, China) and temperate gardens worldwide",
      "colors": [
        "red",
        "pink",
        "white"
      ],
      "emoji": "🌺",
      "funFact": "Camellia japonica was one of the first camellias introduced to Europe in the 18th century and remains a beloved ornamental plant."
    },
    {
      "name": "Erica cinerea",
      "commonName": "Bell Heather",
      "description": "A low-growing shrub native to Western Europe, producing bell-shaped purple-pink flowers. Often found in heathlands, it blooms in autumn, providing nectar for late-season pollinators.",
      "bloomingSeason": "July to October",
      "location": "Heathlands of Western Europe (UK, Ireland, France)",
      "colors": [
        "purple",
        "pink"
      ],
      "emoji": "💜",
      "funFact": "Bell Heather thrives in acidic, nutrient-poor soils and plays a crucial role in heathland ecosystems."
    },
    {
      "name": "Protea cynaroides",
      "commonName": "King Protea",
      "description": "South Africa's national flower, known for its massive flower heads resembling an artichoke. It blooms in late winter to spring in the Southern Hemisphere, which corresponds to October-November in South Africa.",
      "bloomingSeason": "August to November (Southern Hemisphere spring)",
      "location": "South Africa (Cape Floristic Region)",
      "colors": [
        "pink",
        "white"
      ],
      "emoji": "🌸",
      "funFact": "The King Protea's flower head is actually a cluster of many small flowers surrounded by colorful bracts."
    }
  ]
}