{
  "date": "June 3",
  "events": [
    {
      "year": 1965,
      "title": "Edward White's First American Spacewalk",
      "description": "American astronaut Edward H. White II performs the first American spacewalk during the Gemini 4 mission, spending about 23 minutes outside the spacecraft.",
      "category": "Space Exploration",
      "significance": "Marked a significant achievement in the US space program during the space race, demonstrating extravehicular activity capabilities."
    },
    {
      "year": 1989,
      "title": "Tiananmen Square Massacre",
      "description": "Chinese military forces violently suppress pro-democracy protests in Tiananmen Square, Beijing, leading to hundreds if not thousands of deaths.",
      "category": "Political History",
      "significance": "A pivotal moment in modern Chinese history highlighting government repression and human rights issues."
    },
    {
      "year": 1937,
      "title": "Hindenburg Disaster",
      "description": "The German passenger airship LZ 129 Hindenburg catches fire and is destroyed during its attempt to dock in New Jersey, killing 36 people.",
      "category": "Aviation Disaster",
      "significance": "Effectively ended the era of passenger airship travel due to safety concerns."
    },
    {
      "year": 1925,
      "title": "Scottsboro Boys Arrest",
      "description": "Nine African American teenagers are arrested in Alabama, accused of raping two white women, in a case that becomes a landmark in civil rights and legal history.",
      "category": "Civil Rights",
      "significance": "Exposed deep racial injustices in the American legal system and set precedents for fair trials."
    },
    {
      "year": 1947,
      "title": "Kennedy Marries Jacqueline Bouvier",
      "description": "John F. Kennedy, future President of the United States, marries Jacqueline Bouvier in a widely publicized ceremony.",
      "category": "Political History",
      "significance": "The couple became a prominent political and cultural symbol in America during the 1960s."
    }
  ]
}