{
  "date": "June 7",
  "events": [
    {
      "year": 1494,
      "title": "Signing of the Treaty of Tordesillas",
      "description": "Spain and Portugal signed the Treaty of Tordesillas, dividing newly discovered lands outside Europe between them along a meridian 370 leagues west of the Cape Verde islands.",
      "category": "International Diplomacy",
      "significance": "This treaty had a profound impact on the colonization patterns of the Americas and shaped the linguistic and cultural map of the New World."
    },
    {
      "year": 1654,
      "title": "Louis XIV crowned King of France",
      "description": "Louis XIV was crowned in Reims Cathedral, beginning one of the longest reigns in European history which led to the consolidation of absolute monarchy in France.",
      "category": "Monarchy",
      "significance": "His reign influenced French culture, politics, and expansion, establishing France as a dominant European power in the 17th century."
    },
    {
      "year": 1885,
      "title": "End of the Siege of Khartoum",
      "description": "General Charles Gordon was killed when Mahdist forces captured Khartoum in Sudan, ending the siege that had lasted nearly a year.",
      "category": "Military Conflict",
      "significance": "The event marked a key episode in British colonial history and influenced imperial policy in Africa."
    },
    {
      "year": 1942,
      "title": "Battle of Midway begins",
      "description": "The Battle of Midway commenced between the United States and Japan in the Pacific during World War II.",
      "category": "Military Conflict",
      "significance": "It became a turning point in the Pacific Theater, stopping Japanese expansion and shifting the balance of naval power to the Allies."
    },
    {
      "year": 1981,
      "title": "US Navy shoots down an Iranian passenger plane",
      "description": "During the Iran-Iraq War, a US Navy gunboat downed an Iranian civilian airliner, resulting in significant international controversy.",
      "category": "Military Incident",
      "significance": "This incident highlighted the dangers of regional conflicts impacting civilians and strained US-Iran relations further."
    }
  ]
}