{
  "date": "June 14",
  "events": [
    {
      "year": 1777,
      "title": "Adoption of the American Flag",
      "description": "The Continental Congress passed the Flag Resolution establishing the United States flag with thirteen stripes and thirteen stars.",
      "category": "Political/Founding",
      "significance": "This event marked the official creation of the American flag, a symbol of unity and independence for the new nation."
    },
    {
      "year": 1789,
      "title": "Storming of the Bastille Initiated in Paris",
      "description": "Although the main storming occurred on July 14, initial tensions and events leading to the French Revolution were set during this period in June.",
      "category": "Political/Revolution",
      "significance": "Marked the beginning of a period of revolution and radical political change in France, influencing global ideas about democracy."
    },
    {
      "year": 1940,
      "title": "Winston Churchill's 'Finest Hour' Speech",
      "description": "Churchill gave a stirring speech to the House of Commons as France was falling to Nazi Germany.",
      "category": "Political/War",
      "significance": "This speech rallied British morale during World War II and symbolized steadfast resistance against Nazi Germany."
    },
    {
      "year": 1775,
      "title": "Founding of the United States Army",
      "description": "The Continental Congress established the Continental Army, appointing George Washington as its commander.",
      "category": "Military",
      "significance": "Marked the formation of the army that would fight in the American Revolutionary War and later become the U.S. Army."
    },
    {
      "year": 1900,
      "title": "The Gold Standard Act Passed in the United States",
      "description": "The United States officially adopted the gold standard, establishing gold as the only standard for redeeming paper money.",
      "category": "Economic",
      "significance": "This act stabilized the U.S. economy and international trade by backing currency with gold reserves."
    }
  ]
}