{
  "date": "June 17",
  "events": [
    {
      "year": 1885,
      "title": "Completion of the Canadian Pacific Railway",
      "description": "The last spike of the Canadian Pacific Railway was driven at Craigellachie, British Columbia, completing the railway line across Canada.",
      "category": "Infrastructure",
      "significance": "This event was critical in uniting Canada from east to west, enabling transportation and economic development across the vast country."
    },
    {
      "year": 1944,
      "title": "D-Day: Operation Overlord initiated",
      "description": "Though the main Allied invasion of Normandy was on June 6, on June 17, the port of Cherbourg was liberated by American forces, securing an important entry point for Allied supplies.",
      "category": "Military",
      "significance": "Liberation of Cherbourg facilitated further Allied advances in Western Europe during World War II."
    },
    {
      "year": 1972,
      "title": "Watergate Break-in Occurs",
      "description": "Five men were arrested for breaking into the Democratic National Committee headquarters at the Watergate office complex in Washington, D.C.",
      "category": "Political",
      "significance": "This event led to the Watergate scandal, ultimately causing the resignation of U.S. President Richard Nixon in 1974."
    },
    {
      "year": 1940,
      "title": "King Victor Emmanuel III appoints Mussolini as Prime Minister of Italy",
      "description": "Following the collapse of the government, Victor Emmanuel III appointed Benito Mussolini as Prime Minister, allowing the fascist regime to consolidate power.",
      "category": "Political",
      "significance": "Marked the beginning of Italy's full alignment with Axis powers during World War II."
    },
    {
      "year": 2015,
      "title": "Charleston Church Shooting",
      "description": "A mass shooting occurred at Emanuel African Methodist Episcopal Church in Charleston, South Carolina, resulting in nine deaths.",
      "category": "Social",
      "significance": "The tragic event highlighted issues of racism and gun violence in the United States, sparking national conversations about race relations."
    }
  ]
}