{
  "date": "June 24",
  "events": [
    {
      "year": 793,
      "title": "Viking Raid on Lindisfarne",
      "description": "Norse Viking raiders attacked the monastery at Lindisfarne, off the northeast coast of England, marking the beginning of the Viking Age in Europe.",
      "category": "Military/Exploration",
      "significance": "This event signaled the start of extensive Viking raids and influence across Europe, affecting political and cultural landscapes."
    },
    {
      "year": 1497,
      "title": "John Cabot Sighted North America",
      "description": "Explorer John Cabot, sailing under the English flag, sighted land in North America, believed to be Newfoundland.",
      "category": "Exploration",
      "significance": "This expedition paved the way for future English claims and colonization in the Americas."
    },
    {
      "year": 1916,
      "title": "Battle of Mont Sorrel Begins",
      "description": "The Battle of Mont Sorrel, a significant World War I battle between Canadian and German forces near Ypres, Belgium, commenced.",
      "category": "Military",
      "significance": "This battle was notable for intense trench warfare and highlighted the sacrifices of Canadian forces during WWI."
    },
    {
      "year": 1948,
      "title": "Berlin Airlift Begins",
      "description": "The Western Allies initiated the Berlin Airlift to circumvent the Soviet blockade of West Berlin.",
      "category": "Political/Military",
      "significance": "The airlift symbolized Western commitment to West Berlin during the early Cold War, showcasing logistical ingenuity and political resolve."
    },
    {
      "year": 2010,
      "title": "World Health Organization Declares Haiti Cholera Outbreak Over",
      "description": "WHO officially declared the end of the cholera outbreak in Haiti that began after the 2010 earthquake.",
      "category": "Health/Public Policy",
      "significance": "Marked a major milestone in public health recovery efforts in the aftermath of a devastating natural disaster."
    }
  ]
}