{
  "date": "June 28",
  "events": [
    {
      "year": 1914,
      "title": "Assassination of Archduke Franz Ferdinand of Austria",
      "description": "Archduke Franz Ferdinand of Austria and his wife Sophie were assassinated in Sarajevo by Gavrilo Princip, an event that directly triggered the outbreak of World War I.",
      "category": "Political/Military",
      "significance": "This assassination set off a chain reaction of alliances and conflicts that led to the start of World War I, drastically altering global history."
    },
    {
      "year": 1919,
      "title": "Signing of the Treaty of Versailles",
      "description": "The Treaty of Versailles was signed, officially ending World War I. The treaty imposed heavy reparations and territorial losses on Germany.",
      "category": "Political/Diplomatic",
      "significance": "The harsh terms of the treaty contributed to economic hardship and political instability in Germany, ultimately influencing the rise of Nazism and leading to World War II."
    },
    {
      "year": 2005,
      "title": "The first legal same-sex marriages in Canada",
      "description": "Canada became the fourth country to legalize same-sex marriage nationwide, following a Supreme Court ruling that mandated the government to change laws.",
      "category": "Social/Legal",
      "significance": "This was a landmark moment for LGBTQ+ rights and equality, reflecting significant progress on social acceptance and legal recognition of same-sex relationships."
    },
    {
      "year": 1916,
      "title": "Start of the Battle of the Somme",
      "description": "The Battle of the Somme began during World War I with British and French forces launching a massive offensive against German positions along the River Somme in France.",
      "category": "Military",
      "significance": "One of the bloodiest battles in human history, it highlighted the brutal nature of trench warfare and had lasting effects on military tactics and public perception of the war."
    }
  ]
}