{
  "date": "October 2",
  "holidays": [
    {
      "name": "Do Something Nice Day",
      "description": "A day dedicated to performing random acts of kindness, encouraging people to spread positivity and brighten others’ days.",
      "origin": "This unofficial holiday emerged from various kindness campaigns aiming to promote compassion in daily life.",
      "category": "Awareness / Kindness",
      "emoji": "💖",
      "funFact": "Even small gestures, like complimenting a stranger or holding the door open, can dramatically improve someone’s day on Do Something Nice Day!"
    },
    {
      "name": "Name Your Car Day",
      "description": "A quirky day to give your beloved vehicle a unique, funny, or affectionate name.",
      "origin": "Started in the automotive enthusiast community as a humorous way to personify their cars, fostering a sense of camaraderie among drivers.",
      "category": "Pop Culture / Fun",
      "emoji": "🚗",
      "funFact": "Some famous cars like KITT from Knight Rider and Herbie the Love Bug are essentially celebrities because of their memorable names!"
    },
    {
      "name": "Gandhi Jayanti (India)",
      "description": "A national holiday in India commemorating the birthday of Mahatma Gandhi, the leader of the peaceful Indian independence movement.",
      "origin": "Observes Gandhi's birthday to honor his philosophy of non-violence and truth.",
      "category": "Historical / Cultural",
      "emoji": "🕊️",
      "funFact": "On Gandhi Jayanti, people around the world celebrate the 'International Day of Non-Violence' inspired by his teachings."
    },
    {
      "name": "World Farm Animals Day",
      "description": "A day to raise awareness about the plight of farm animals and promote animal rights and welfare.",
      "origin": "Established by animal advocacy groups to spotlight the ethical treatment of farm animals worldwide.",
      "category": "Awareness / Animal Rights",
      "emoji": "🐄",
      "funFact": "Despite being overshadowed by cuter pets, farm animals top the list in numbers globally and play a huge role in the food chain."
    }
  ]
}