{
  "date": "October 4",
  "holidays": [
    {
      "name": "World Animal Day",
      "description": "A day to celebrate animals and raise awareness about their rights and welfare worldwide.",
      "origin": "Established in 1931 at a convention of ecologists in Florence, Italy, it aims to promote better treatment of animals and recognition of their importance.",
      "category": "Awareness Day",
      "emoji": "🐾",
      "funFact": "The date coincides with the feast day of St. Francis of Assisi, the patron saint of animals!"
    },
    {
      "name": "Taco Day (UK)",
      "description": "A fun celebration of tacos, encouraging everyone to enjoy this delicious Mexican dish with friends and family.",
      "origin": "Popularized by British food chains and social media, this day shines a spotlight on the tasty treat outside of its traditional homeland.",
      "category": "Food Holiday",
      "emoji": "🌮",
      "funFact": "Although tacos are Mexican, the UK’s Taco Day is celebrated on October 4 instead of the US’s 'National Taco Day' on October 4 or 10 (varies)!"
    },
    {
      "name": "National Cinnamon Roll Day (Sweden)",
      "description": "Known as Kanelbullens Dag in Sweden, this sweet holiday celebrates the beloved cinnamon roll with coffee and cozy vibes.",
      "origin": "Started in 1999 by the Swedish Bakers' Association to boost the sales of cinnamon buns and enjoy fika, the cherished Swedish coffee break.",
      "category": "Food Holiday",
      "emoji": "🍥",
      "funFact": "Swedes consume an estimated 10 million cinnamon buns on this day alone—enough to give everyone in Sweden about two each!"
    },
    {
      "name": "Name Your Car Day",
      "description": "A quirky day encouraging people to give their vehicles unique and amusing names, turning ordinary cars into beloved companions.",
      "origin": "Unofficial, created by car enthusiasts who wanted to personalize their rides and share humorous stories about their cars.",
      "category": "Pop Culture Celebration",
      "emoji": "🚗",
      "funFact": "Naming cars often strengthens the bond between driver and vehicle — some say it can even improve your car’s 'mood' on road trips!"
    }
  ]
}