{
  "date": "October 6",
  "holidays": [
    {
      "name": "National Noodle Day",
      "description": "A day to celebrate the slurpy, saucy, and versatile noodle in all its glorious forms—from spaghetti to ramen, from fettuccine to udon.",
      "origin": "Started in the United States to honor the endless culinary creativity involving noodles, this day encourages cooking and enjoying noodles in any style.",
      "category": "Food",
      "emoji": "🍜",
      "funFact": "Did you know the longest noodle ever made was over 3,000 meters (about 1.86 miles) long? That's a whole lot of slurping!"
    },
    {
      "name": "Mad Hatter Day",
      "description": "Celebrates the quirky, eccentric character of the Mad Hatter from Lewis Carroll’s 'Alice’s Adventures in Wonderland', honoring whimsy and eccentricity in everyday life.",
      "origin": "The date October 6 is derived from the Mad Hatter’s line about it always being 6 o'clock — which is tea time! Fans embrace this day with hats, tea parties, and general zaniness.",
      "category": "Pop Culture",
      "emoji": "🎩",
      "funFact": "The phrase 'mad as a hatter' actually refers to hat makers who suffered mercury poisoning in the 18th-19th centuries, giving rise to the character's eccentric behavior."
    },
    {
      "name": "Aerobics Day",
      "description": "A lively day dedicated to getting your heart pumping and limbs moving through aerobics exercise, promoting fitness and fun.",
      "origin": "Became popular in the 1980s with the rise of aerobics classes and Jane Fonda’s workout videos, October 6 invites people to dance, jump, and groove for health.",
      "category": "Health & Fitness",
      "emoji": "🤸‍♀️",
      "funFact": "Aerobics was originally called 'aerobic dance' and was developed to help improve cardiovascular health through rhythmic exercise."
    },
    {
      "name": "World Smile Day",
      "description": "Encourages people worldwide to do acts of kindness and smile as a simple way to make the world a happier place.",
      "origin": "Started by Harvey Ball, the creator of the smiley face, the day is observed on the first Friday of October but is also celebrated informally on other dates like October 6 to spread joy.",
      "category": "Awareness / Kindness",
      "emoji": "😄",
      "funFact": "Harvey Ball was paid only $45 for creating the iconic smiley face back in 1963, which became one of the most recognizable symbols on the planet."
    }
  ]
}