{
  "date": "October 7",
  "holidays": [
    {
      "name": "National LED Bulb Day",
      "description": "A day to celebrate the energy-efficient and long-lasting LED light bulbs that illuminate our homes and reduce electricity bills.",
      "origin": "Established by lighting industry advocates to promote energy conservation and environmental awareness.",
      "category": "Environmental Awareness",
      "emoji": "💡",
      "funFact": "LED bulbs can last up to 25,000 hours, which is about 25 times longer than traditional incandescent bulbs!"
    },
    {
      "name": "International Frugal Fun Day",
      "description": "A quirky celebration encouraging people to have fun without spending a dime. Think free concerts, DIY crafts, and creative adventures!",
      "origin": "Started by thrifty communities to inspire joyful, low-cost living and environmental consciousness.",
      "category": "Lifestyle",
      "emoji": "🎉",
      "funFact": "The first recorded Frugal Fun Day had zero budget but attracted over 1,000 participants who brought their own games and snacks."
    },
    {
      "name": "World Smile Day (First Friday of October)",
      "description": "Though not always on October 7, sometimes this day coincides with the first Friday of October—a day to honor the power of a smile and spreading kindness.",
      "origin": "Created by Harvey Ball, the inventor of the smiley face, to promote goodwill and cheer worldwide.",
      "category": "Social/Emotional Health",
      "emoji": "😊",
      "funFact": "Millions of people participate worldwide by performing random acts of kindness and flashing big smiles to strangers."
    },
    {
      "name": "Bathtub Party Day",
      "description": "A lighthearted, unofficial holiday dedicated to enjoying a relaxing soak in the tub — with bubbles, rubber ducks, and maybe even a good book or tunes.",
      "origin": "Origin is unknown but embraced by self-care enthusiasts who value a quirky way to destress.",
      "category": "Self-Care Fun",
      "emoji": "🛁",
      "funFact": "Studies show that taking a warm bath can reduce stress hormones and improve sleep quality—bathtub parties are scientifically awesome!"
    }
  ]
}