{
  "date": "October 9",
  "holidays": [
    {
      "name": "Leif Erikson Day",
      "description": "Celebrates the Norse explorer believed to be the first European to set foot in North America, predating Columbus by nearly 500 years.",
      "origin": "Established by the U.S. Congress and first officially observed in 1964. It honors Leif Erikson’s adventurous spirit.",
      "category": "Historical / Cultural",
      "emoji": "🛶",
      "funFact": "Leif Erikson’s expedition reached an area called Vinland, which many believe to be coastal North America, around the year 1000 AD."
    },
    {
      "name": "National Moldy Cheese Day",
      "description": "An ode to the wonderfully pungent world of moldy cheeses like blue cheese, Roquefort, and Camembert.",
      "origin": "An unofficial foodie observance to encourage cheese lovers to embrace the funky and flavorful molds that make some cheeses spectacular.",
      "category": "Foodie / Fun",
      "emoji": "🧀",
      "funFact": "Blue cheese owes its distinctive veins to Penicillium roqueforti mold, which also contributed to the development of penicillin!"
    },
    {
      "name": "Fire Pup Day",
      "description": "A quirky celebration honoring the heroic fire dogs who assist firefighters in saving lives and property.",
      "origin": "Inspired by the devoted canines that have been a part of firefighting teams since the 18th century, celebrated mainly in firefighter communities.",
      "category": "Animal / Heroic",
      "emoji": "🐕‍🚒",
      "funFact": "Fire dogs were originally used to warn buildings of fire alarms and to help pull hoses before motorized trucks were common."
    },
    {
      "name": "Oktoberfest Ends",
      "description": "Marks the closing day of the world's largest beer festival held annually in Munich, Germany, famous for lederhosen, giant pretzels, and endless beer steins.",
      "origin": "A folk festival that began in 1810 to celebrate a royal wedding, now a global symbol of Bavarian culture and merrymaking.",
      "category": "Cultural / Celebration",
      "emoji": "🍺",
      "funFact": "Despite its name, Oktoberfest actually starts in September and ends on the first Sunday in October or October 3 if that Sunday falls on the 3rd."
    }
  ]
}