{
  "date": "October 10",
  "holidays": [
    {
      "name": "World Mental Health Day",
      "description": "A day dedicated to raising awareness and mobilizing efforts in support of mental health. It promotes mental well-being and encourages conversations around mental illness.",
      "origin": "Established in 1992 by the World Federation for Mental Health to focus global attention on mental health issues.",
      "category": "Awareness",
      "emoji": "🧠",
      "funFact": "Each year, a different theme is selected to highlight critical mental health topics, fostering worldwide dialogues."
    },
    {
      "name": "National Angel Food Cake Day",
      "description": "Celebrate the light and fluffy delight known as angel food cake, a heavenly treat known for its airy texture and simple ingredients.",
      "origin": "An unofficial food holiday honoring this classic American dessert, popularized in the 19th century.",
      "category": "Food",
      "emoji": "🍰",
      "funFact": "Angel food cake requires no fat or egg yolks and rises solely by the air whipped into egg whites, making it surprisingly delightful and low-fat!"
    },
    {
      "name": "World Homeless Day",
      "description": "A day designed to bring awareness to the plight of homeless individuals worldwide, encouraging community support and policy changes.",
      "origin": "Initiated in 2010 to complement the United Nations' goals to end homelessness globally.",
      "category": "Awareness",
      "emoji": "🏚️",
      "funFact": "Events around the world include clothing drives, soup kitchens, and storytelling to humanize the homeless experience."
    },
    {
      "name": "Emergency Nurse Day",
      "description": "A day to honor the hardworking emergency nurses who provide critical care in high-stress, fast-paced environments.",
      "origin": "Observed by nursing communities to recognize and celebrate these vital healthcare professionals.",
      "category": "Professional",
      "emoji": "🩺",
      "funFact": "Emergency nurses often juggle trauma cases, sudden illnesses, and crisis situations all in one shift, making them medical superheroes!"
    }
  ]
}