{
  "date": "October 11",
  "holidays": [
    {
      "name": "Coming Out Day",
      "description": "A day to support and celebrate the LGBTQ+ community by encouraging individuals to 'come out' and live openly and authentically.",
      "origin": "Started in 1988 to commemorate the 1987 National March on Washington for Lesbian and Gay Rights.",
      "category": "Awareness Day",
      "emoji": "🏳️‍🌈",
      "funFact": "The original goal was to make coming out more commonplace, and today it’s one of the most recognized LGBTQ+ awareness days worldwide."
    },
    {
      "name": "National Sausage Pizza Day",
      "description": "A delicious celebration dedicated to one of the most popular pizza toppings: sausage! Whether spicy or mild, it’s the perfect excuse to order a sausage pizza.",
      "origin": "An unofficial food holiday created by pizza lovers honoring sausage as a beloved topping.",
      "category": "Food Holiday",
      "emoji": "🍕",
      "funFact": "Sausage has been a pizza topping favorite since Italian immigrants brought their recipes to America in the early 1900s."
    },
    {
      "name": "International Day of the Girl Child",
      "description": "A day to highlight and address the needs and challenges girls face globally, while promoting girls’ empowerment and the fulfillment of their human rights.",
      "origin": "Established by the United Nations in 2011 to emphasize girls' rights and gender equality.",
      "category": "Awareness Day",
      "emoji": "👧",
      "funFact": "The day aims to support more opportunities in education, health, and protection against discrimination for girls worldwide."
    },
    {
      "name": "M&M’s Day",
      "description": "A playful celebration of the colorful candy-coated chocolates known and loved by millions around the world.",
      "origin": "Marks the introduction of M&M’s by Forrest Mars in 1941 during World War II to provide soldiers with heat-resistant chocolate.",
      "category": "Food Holiday",
      "emoji": "🍬",
      "funFact": "The original M&M’s came only in red, yellow, green, brown, and violet—but violet was later replaced with tan in 1949!"
    }
  ]
}