{
  "date": "October 12",
  "holidays": [
    {
      "name": "National Gumbo Day",
      "description": "A day to celebrate the hearty and flavorful Louisiana stew known as gumbo, which combines meats, seafood, and the 'holy trinity' of vegetables in a savory broth.",
      "origin": "This unofficial food holiday honors a beloved Cajun and Creole dish that represents the melting pot of cultures in Louisiana cuisine.",
      "category": "Food",
      "emoji": "🍲",
      "funFact": "Gumbo often includes okra or filé powder as a thickener, and the dish varies significantly across families and regions."
    },
    {
      "name": "National Moment of Frustration Day",
      "description": "A quirky observance encouraging people to acknowledge and release their daily frustrations instead of bottling them up.",
      "origin": "Started in the 1980s as a humorous reminder to embrace our human emotions and take a breath during stressful times.",
      "category": "Awareness",
      "emoji": "😤",
      "funFact": "The day humorously suggests smashing a plate or yelling into a pillow—but maybe not both!"
    },
    {
      "name": "Columbus Day (Alternative Observance: Indigenous Peoples’ Day)",
      "description": "While Columbus Day commemorates Christopher Columbus's arrival in the Americas, many communities use this day to honor Indigenous cultures and histories instead.",
      "origin": "Columbus Day dates back to the late 18th century, but Indigenous Peoples’ Day began as a movement in the late 20th century to recognize native resilience and contributions.",
      "category": "Historical/Cultural",
      "emoji": "🛶",
      "funFact": "Some places replace Columbus Day with Indigenous Peoples’ Day to focus on native rights and history rather than European colonization."
    },
    {
      "name": "National Fossil Day",
      "description": "A celebration dedicated to raising awareness of fossils, paleontology, and Earth's prehistoric past.",
      "origin": "Established in 2010 by the National Park Service to educate the public about fossils' scientific and historic significance.",
      "category": "Science/Education",
      "emoji": "🦕",
      "funFact": "On National Fossil Day, museums and parks often host fossil digs and educational events open to all ages."
    }
  ]
}