{
  "date": "October 14",
  "holidays": [
    {
      "name": "National Dessert Day",
      "description": "A sweet celebration encouraging everyone to indulge in their favorite desserts, from cakes to pies and everything sugary in between.",
      "origin": "While its exact origin is unclear, National Dessert Day has become a popular unofficial food holiday embraced by dessert lovers worldwide.",
      "category": "Food Holiday",
      "emoji": "🍰",
      "funFact": "On National Dessert Day, many bakeries and restaurants offer special deals or even free bites of dessert to celebrate the sweet tooth spirit!"
    },
    {
      "name": "Be Bald and Be Free Day",
      "description": "An empowering holiday celebrating baldness in all its forms, encouraging people to rock their bald heads with pride and confidence.",
      "origin": "Created to promote self-love and challenge beauty standards, this day reminds us that bald is beautiful.",
      "category": "Beauty & Self-Love",
      "emoji": "🦲",
      "funFact": "Some communities host fun Bald Walks or shaving parties to celebrate this day together, showing off their shiny scalps!"
    },
    {
      "name": "National Mole Day",
      "description": "A quirky celebration by chemistry enthusiasts marking Avogadro's number (6.022 x 10^23), a fundamental constant in chemistry.",
      "origin": "Established in 1981 by American chemists to foster interest in chemistry and honor the mole concept at 6:02 a.m. on October 23, but some extend festivities starting October 14 to build excitement.",
      "category": "Science Celebration",
      "emoji": "⚗️",
      "funFact": "Mole Day is often celebrated with mole-themed puns, experiments, and even mole-shaped treats to make chemistry fun!"
    },
    {
      "name": "National Yorkshire Pudding Day",
      "description": "A delicious day dedicated to enjoying the classic British side dish, Yorkshire pudding, typically served with roast beef and gravy.",
      "origin": "Though an unofficial food holiday, it celebrates a traditional British staple dating back to the 1700s.",
      "category": "Food Holiday",
      "emoji": "🥞",
      "funFact": "Yorkshire puddings were originally made to help fill you up before the meat course, so you’d eat less meat during hard times!"
    }
  ]
}