{
  "date": "October 15",
  "holidays": [
    {
      "name": "Global Handwashing Day",
      "description": "A day dedicated to increasing awareness and understanding about the importance of handwashing with soap as an effective and affordable way to prevent diseases and save lives.",
      "origin": "Established by Global Handwashing Partnership in 2008 to promote hygiene and reduce disease worldwide.",
      "category": "Awareness Day",
      "emoji": "🧼🖐️",
      "funFact": "If everyone worldwide washed their hands properly, it could reduce diarrheal diseases by up to 50%!"
    },
    {
      "name": "White Cane Safety Day",
      "description": "A day to recognize the achievements of people who are blind or visually impaired and to promote awareness of the white cane as a tool of independence.",
      "origin": "Proclaimed in the United States in 1964 to honor the white cane as a symbol of independence for blind individuals.",
      "category": "Awareness Day",
      "emoji": "⚪️🦯",
      "funFact": "The white cane was originally introduced in the early 20th century and revolutionized mobility for the blind."
    },
    {
      "name": "I Love Lucy Day",
      "description": "A day celebrating the classic and beloved American television sitcom featuring Lucille Ball's iconic comedic talent.",
      "origin": "Commemorates the premiere of the first episode of 'I Love Lucy' which originally aired on October 15, 1951.",
      "category": "Pop Culture Holiday",
      "emoji": "📺😂",
      "funFact": "Lucille Ball performed her famous chocolate factory scene on the show, which remains one of the most memorable moments in TV history."
    },
    {
      "name": "National Grouch Day",
      "description": "A fun occasion for those who embrace their inner grump to celebrate and own their grouchy mood without apologies!",
      "origin": "Started as a humorous unofficial day in the US to poke fun at grumpy personalities and moods.",
      "category": "Quirky Holiday",
      "emoji": "😠☕",
      "funFact": "This day encourages even the nicest people to let off some steam and be delightfully grouchy for a bit."
    }
  ]
}