{
  "date": "October 19",
  "holidays": [
    {
      "name": "Evaluate Your Life Day",
      "description": "A day dedicated to pausing and reflecting on your personal goals, achievements, and general life direction — a quirky self-assessment holiday!",
      "origin": "Created in 1985 by author and motivational speaker Angel Adelung who wanted people to take a moment for serious self-reflection amid busy lives.",
      "category": "Self-Improvement",
      "emoji": "🧐",
      "funFact": "Some people use this day to write themselves letters listing their life goals and reviewing progress from previous years."
    },
    {
      "name": "Dance Dress Day",
      "description": "An unusual observance inviting everyone to wear their fanciest dance attire all day just for fun—even if you don't dance!",
      "origin": "Started in the mid-2000s by a small dance community promoting creativity and joy through everyday dressing up.",
      "category": "Pop Culture/Fashion",
      "emoji": "💃",
      "funFact": "Even offices have joined in by hosting mini dance parties during breaks on this day."
    },
    {
      "name": "Chewing Gum Day",
      "description": "Celebrate the sticky, stretchy, and sometimes flavorful treat that has been blowing bubbles and freshening breath for ages.",
      "origin": "Traced back unofficially to 1869 when Thomas Adams patented the first commercial chewing gum made from chicle.",
      "category": "Food/Fun",
      "emoji": "🍬",
      "funFact": "Bubble gum was originally pink simply because that was the only color of the gum available when first invented."
    },
    {
      "name": "Desserts Day",
      "description": "A delightfully sweet day promoting the consumption of all kinds of desserts, from cakes to puddings to extravagant pastries.",
      "origin": "Origin unknown, but enjoyed by dessert lovers worldwide as a reason to indulge their sweet tooth guilt-free.",
      "category": "Food/Fun",
      "emoji": "🍰",
      "funFact": "Some people celebrate by trying to guess the origins of popular desserts while sampling them."
    }
  ]
}