{
  "date": "October 21",
  "holidays": [
    {
      "name": "Count Your Buttons Day",
      "description": "A quirky day dedicated to literally counting all the buttons you own—on your clothes, your couch, your crafts! It’s a playful way to appreciate the tiny fasteners that hold things together in style.",
      "origin": "The origin is lost to time, but it's thought to have started among sewing and craft enthusiasts as a fun way to organize and celebrate their collections.",
      "category": "Fun/Crafting",
      "emoji": "🧵",
      "funFact": "Avid button collectors can own thousands of buttons, sometimes worth more than gold depending on rarity!"
    },
    {
      "name": "National Mammoth Day",
      "description": "Celebrate the majestic Woolly Mammoth, those giant prehistoric elephants that roamed the Earth during the Ice Age.",
      "origin": "Started by paleontology enthusiasts to raise awareness about extinct species and the importance of biodiversity.",
      "category": "Awareness/Science",
      "emoji": "🐘",
      "funFact": "Some scientists are exploring the idea of 'de-extincting' mammoths using genetic engineering!"
    },
    {
      "name": "International Co-op Day",
      "description": "A day to recognize and celebrate cooperatives worldwide — businesses and organizations owned and run jointly by their members.",
      "origin": "Established by the International Cooperative Alliance, first celebrated in 1995 to promote cooperative principles.",
      "category": "Economic/Social Awareness",
      "emoji": "🤝",
      "funFact": "Cooperatives operate in nearly every industry, from agriculture to banking, serving over a billion people globally!"
    },
    {
      "name": "Back to the Future Day (October 21, 2015) - Nostalgia Remembrance",
      "description": "Though the iconic 2015 date celebrated Marty McFly’s arrival in the future, October 21 has since been humorously commemorated annually to honor quirky sci-fi fandom and future predictions.",
      "origin": "From the cult classic 'Back to the Future II' film, this date became famous for its 'future' setting.",
      "category": "Pop Culture/Nostalgia",
      "emoji": "🚗",
      "funFact": "Many fans dress up in 80s fashion or try to emulate Marty’s legendary self-lacing shoes on this day!"
    }
  ]
}