{
  "date": "October 22",
  "holidays": [
    {
      "name": "Caps Lock Day",
      "description": "A tongue-in-cheek holiday celebrating the overuse, love, or annoyance of typing in all capital letters. It's a day to acknowledge the 'shouting' tone of caps lock in digital communication.",
      "origin": "Started by internet users in the early 2000s as a humorous way to address online shouting, it’s celebrated twice a year—June 28 and October 22.",
      "category": "Tech Humor / Internet Culture",
      "emoji": "🖥️",
      "funFact": "Some people celebrate by typing entire messages in uppercase—and then apologizing for the 'virtual screaming!'."
    },
    {
      "name": "National Nut Day",
      "description": "A quirky food holiday celebrating all kinds of nuts—peanuts, almonds, walnuts, cashews, and more! It's a great day to snack healthy, try new nutty recipes, or just appreciate the crunch.",
      "origin": "Established in the U.S. to promote nut consumption due to their health benefits and culinary versatility.",
      "category": "Food / Health",
      "emoji": "🥜",
      "funFact": "Nuts are actually fruits with a hard shell, and some nuts like almonds are seeds inside a fruit, making them technically not 'true nuts.'"
    },
    {
      "name": "International Stuttering Awareness Day",
      "description": "A day to raise awareness about stuttering, promote understanding, and support people who stutter worldwide.",
      "origin": "Founded in 1998 by the International Stuttering Association to bring attention to the challenges and strengths of people who stutter.",
      "category": "Awareness / Health",
      "emoji": "🗣️",
      "funFact": "People who stutter often have unique ways of coping and communicating, showcasing resilience and creativity."
    },
    {
      "name": "Snowball Day",
      "description": "A playful unofficial holiday meant for spontaneously tossing snowballs if you live somewhere snowy in late October—or for daydreaming about winter snowball fights if you don’t!",
      "origin": "Mostly celebrated online and by winter sports enthusiasts as a fun pre-winter event.",
      "category": "Seasonal Fun / Play",
      "emoji": "❄️",
      "funFact": "Some people have snowball day parties with fake snow or cotton balls when it's too warm for real snow."
    }
  ]
}