{
  "date": "October 24",
  "holidays": [
    {
      "name": "World Development Information Day",
      "description": "A day dedicated to promoting awareness and mobilizing public opinion on development problems and the necessity of strengthening international cooperation to solve them.",
      "origin": "Established by the United Nations General Assembly in 1972 to draw attention to development issues globally.",
      "category": "Awareness Day",
      "emoji": "🌍",
      "funFact": "Despite its serious intent, many confuse this day for a celebration of tech development rather than global development issues!"
    },
    {
      "name": "National Bologna Day (USA)",
      "description": "Celebrate the humble yet surprisingly versatile bologna sandwich and all things bologna-related.",
      "origin": "Unofficial U.S. food holiday created by sandwich enthusiasts to honor this classic deli meat on October 24 each year.",
      "category": "Food Holiday",
      "emoji": "🥪",
      "funFact": "Bologna was named after the Italian city of Bologna, but American bologna is actually quite different from the original Mortadella sausage! It’s a staple lunchbox star."
    },
    {
      "name": "United Nations Day",
      "description": "Commemorates the anniversary of the UN Charter’s entry into force in 1945, promoting peace and international cooperation worldwide.",
      "origin": "Established in 1948 by the United Nations to mark its founding day.",
      "category": "Official International Day",
      "emoji": "🕊️",
      "funFact": "The UN has six official languages, and October 24th celebrations often include cultural performances representing all of them!"
    },
    {
      "name": "National Frankenstein Day (USA)",
      "description": "A celebration of Mary Shelley's iconic monster novel, Frankenstein, inspiring countless adaptations in books, movies, and pop culture.",
      "origin": "Observed in the USA to honor the novel’s impact since its 1818 publication on October 24.",
      "category": "Pop Culture Celebration",
      "emoji": "🧟‍♂️",
      "funFact": "Frankenstein was originally the name of the scientist, but the public often mistakes it to be the monster’s name—this day clears up the confusion with fun trivia!"
    }
  ]
}