{
  "date": "October 25",
  "holidays": [
    {
      "name": "National Greasy Food Day",
      "description": "A day dedicated to celebrating all things deliciously greasy, oily, and indulgent — from fried chicken to cheesy fries! It’s the perfect excuse to enjoy those guilty pleasures without the guilt.",
      "origin": "Originated as a fun food lover’s awareness day to embrace and enjoy greasy comfort foods.",
      "category": "Food Day",
      "emoji": "🍟",
      "funFact": "Studies have shown that greasy food cravings often spike this time of year when cooler weather hits, making it a perfect seasonal treat."
    },
    {
      "name": "World Pasta Day",
      "description": "An international celebration honoring the versatile and beloved pasta — from spaghetti to ravioli, this day encourages pasta lovers to try new recipes and share their love of this carb classic.",
      "origin": "Established in 1995 by the International Pasta Organization to promote pasta consumption worldwide.",
      "category": "Food Day",
      "emoji": "🍝",
      "funFact": "Italy produces over 3.6 million tons of pasta every year, making it one of the largest pasta-consuming nations on the planet."
    },
    {
      "name": "Mother-in-Law Day",
      "description": "A quirky day to acknowledge and appreciate mothers-in-law, often the subject of jokes and stereotypes. It’s a chance to build bridges or simply have some lighthearted fun!",
      "origin": "An unofficial observance with origins unclear, but celebrated in various communities as a humorous nod to family dynamics.",
      "category": "Family & Relationships",
      "emoji": "👵",
      "funFact": "In the U.S., there’s also a National Son-in-Law Day (October 25), making it a full in-law appreciation day!"
    },
    {
      "name": "Sourest Day of the Year",
      "description": "Celebrate all things sour—from sour candies to tangy foods and drinks. This day encourages sour lovers to pucker up and enjoy the zing!",
      "origin": "Created by candy companies as a marketing gimmick to promote sour-flavored products.",
      "category": "Food/Fun Celebration",
      "emoji": "🍋",
      "funFact": "The average sour candy contains citric acid, which actually stimulates saliva production, making your mouth water instantly!"
    }
  ]
}