{
  "date": "October 26",
  "holidays": [
    {
      "name": "National Pumpkin Day",
      "description": "A day to celebrate the versatile and beloved pumpkin, from pies to jack-o'-lanterns and everything in between.",
      "origin": "Pumpkins have been a staple in autumn celebrations for centuries, and this day was created to honor their iconic status in fall culture.",
      "category": "Food/Seasonal",
      "emoji": "🎃",
      "funFact": "Did you know the world’s heaviest pumpkin ever recorded weighed over 2,600 pounds? That’s enough pumpkin to make a mountain of pies!"
    },
    {
      "name": "Intersex Awareness Day",
      "description": "A day dedicated to raising awareness and promoting human rights for intersex individuals, people born with physical sex characteristics that don’t fit typical binary notions of male or female bodies.",
      "origin": "Established by intersex activists to increase visibility and combat stigma, it’s observed annually on October 26.",
      "category": "Awareness/Social Justice",
      "emoji": "⚧️",
      "funFact": "Intersex traits are more common than many think; around 1 in 2,000 babies are born with noticeable intersex characteristics!"
    },
    {
      "name": "Silly Sayings Day",
      "description": "A quirky celebration encouraging people to use, share, and laugh at silly, strange, or old-fashioned sayings and idioms.",
      "origin": "An unofficial holiday that grew popular online as a way to brighten conversations and embrace playful language.",
      "category": "Pop Culture/Linguistics",
      "emoji": "😜",
      "funFact": "Some silly sayings like 'mad as a hatter' come from bizarre historical practices — hat makers once used mercury, which made them actually go a bit mad!"
    },
    {
      "name": "National Frankenstein Day",
      "description": "Honoring Mary Shelley’s groundbreaking gothic novel 'Frankenstein,' a cornerstone of horror literature and pop culture.",
      "origin": "October 26 is the birthday of Mary Shelley, so fans celebrate her work and its enduring creepy charm on this day.",
      "category": "Literature/Pop Culture",
      "emoji": "🧟‍♂️",
      "funFact": "Mary Shelley wrote 'Frankenstein' when she was just 18 years old during a ghost-story contest with friends in 1816."
    }
  ]
}