{
  "date": "October 28",
  "holidays": [
    {
      "name": "National Chocolate Day (UK)",
      "description": "A delightful day dedicated to indulging in the rich, sweet, and decadent world of chocolate. Perfect excuse to eat chocolate in any form guilt-free!",
      "origin": "This unofficial holiday has been celebrated in the UK for years to promote chocolate and its delicious varieties.",
      "category": "Food Holiday",
      "emoji": "🍫",
      "funFact": "The average British person consumes around 180 chocolate bars per year, and on this day, that number definitely spikes!"
    },
    {
      "name": "International Animation Day",
      "description": "Celebrates the art of animation and its impact on entertainment and culture worldwide.",
      "origin": "Established in 2002 by the International Animated Film Association (ASIFA) to honor the first public performance of hand-drawn animation by Émile Reynaud on October 28, 1892.",
      "category": "Cultural/Arts",
      "emoji": "🎬",
      "funFact": "Émile Reynaud’s Théâtre Optique predated the famous Edison Kinetoscope by several years, pioneering animated storytelling on screen!"
    },
    {
      "name": "Steam Power Day",
      "description": "A quirky observance for enthusiasts of steam engines and the revolutionary power of steam technology during the Industrial Revolution.",
      "origin": "Informally celebrated by heritage railways and steam engine museums to honor the impact of steam locomotives and machinery on industry and society.",
      "category": "Technology History",
      "emoji": "🚂",
      "funFact": "On Steam Power Day, some heritage railways run special steam train rides with coal-fired locomotives, towering over the rails in spectacular fashion."
    },
    {
      "name": "Red Wine Day",
      "description": "A day for wine lovers to savor the depth, flavor, and complex aromas of red wine varieties from around the world.",
      "origin": "Originating as a fun social media trend encouraging enthusiasts to appreciate red wine without any guilt or excuses.",
      "category": "Food & Drink",
      "emoji": "🍷",
      "funFact": "Research shows moderate red wine consumption may have heart benefits thanks to antioxidants like resveratrol found in grape skins."
    }
  ]
}