{
  "date": "October 30",
  "holidays": [
    {
      "name": "Mischief Night",
      "description": "An unofficial night before Halloween tradition where pranksters play harmless tricks and practical jokes, often involving water balloons, toilet papering, or minor mischiefs in neighborhoods.",
      "origin": "Believed to have originated in the UK and spread to parts of the US, Mischief Night has a long history tied to Halloween revelry and youthful pranks.",
      "category": "Tradition",
      "emoji": "🎃",
      "funFact": "In some regions, it’s called 'Devil’s Night' and has inspired horror movies due to some communities experiencing more serious 'mischiefs'."
    },
    {
      "name": "Sourest Day",
      "description": "A deliciously tangy day dedicated to celebrating all things sour — from sour candies and drinks to pickles and fermented foods!",
      "origin": "A more recent creation by food enthusiasts looking to embrace the puckering, lip-smacking power of sour flavors around Halloween time.",
      "category": "Food Holiday",
      "emoji": "🍋",
      "funFact": "The world's sourest candy, called 'Warheads,' can make your face pucker so much it was once featured in a science fair experiment!"
    },
    {
      "name": "Frankenstein Day",
      "description": "A day to honor Mary Shelley's iconic gothic novel 'Frankenstein' and its numerous adaptations in literature, movies, and pop culture.",
      "origin": "Celebrated on Frankenstein’s 'birthday,' October 30th, marking Mary Shelley's creation of one of horror’s most enduring monsters.",
      "category": "Pop Culture",
      "emoji": "🧟‍♂️",
      "funFact": "The novel was written during the famous 1816 'year without a summer' when unusual weather inspired Mary Shelley’s chilling tale."
    },
    {
      "name": "Candy Corn Day",
      "description": "A quirky food holiday celebrating candy corn, the tri-colored sweet treat often associated with Halloween candy bowls and seasonal spills!",
      "origin": "Candy corn was created in the 1880s by the Wunderle Candy Company and has since become an iconic Halloween seasonal candy.",
      "category": "Food Holiday",
      "emoji": "🍬",
      "funFact": "Despite being loved and hated, Americans consume roughly 35 million pounds of candy corn each year – enough to wrap around the moon twice!"
    }
  ]
}