{
  "date": "June 23",
  "plants": [
    {
      "name": "Rosa spp.",
      "commonName": "Roses",
      "description": "Roses are a diverse group of flowering shrubs known for their fragrant and colorful blooms. In temperate regions of the Northern Hemisphere, many rose varieties bloom prolifically in late spring through early summer, making June a peak blooming period.",
      "bloomingSeason": "May to July",
      "location": "Northern Hemisphere temperate regions, especially Europe, North America",
      "colors": [
        "red",
        "pink",
        "white",
        "yellow",
        "orange"
      ],
      "emoji": "🌹",
      "funFact": "Roses have been cultivated for over 5,000 years and were used by the ancient Egyptians as a symbol of beauty and love."
    },
    {
      "name": "Nymphaea alba",
      "commonName": "White Water Lily",
      "description": "A floating aquatic plant with large white flowers and round green lily pads. White water lilies bloom in freshwater ponds and lakes during the warm months, often peaking in midsummer.",
      "bloomingSeason": "Late spring to early autumn (May to September)",
      "location": "Europe, North Africa, parts of Asia",
      "colors": [
        "white",
        "yellow center"
      ],
      "emoji": "💧",
      "funFact": "Water lilies have leaves that are coated with a water-repellent substance, allowing them to float on the water surface."
    },
    {
      "name": "Jacaranda mimosifolia",
      "commonName": "Jacaranda Tree",
      "description": "The jacaranda is a deciduous tree prized for its spectacular display of purple-blue trumpet-shaped flowers. In subtropical and tropical regions, it typically blooms profusely in late spring to early summer.",
      "bloomingSeason": "Late spring to early summer (May to June)",
      "location": "South America (native), also Australia, southern USA, South Africa",
      "colors": [
        "purple",
        "blue"
      ],
      "emoji": "🌸",
      "funFact": "Jacaranda wood is soft and light and is sometimes used for quality pencil manufacturing."
    },
    {
      "name": "Eucalyptus globulus",
      "commonName": "Blue Gum Eucalyptus",
      "description": "A tall evergreen tree native to Australia, known for its bluish-green leaves and clusters of white flowers. The blue gum eucalyptus blooms in Southern Hemisphere winter and spring but can also flower intermittently through early summer depending on the climate.",
      "bloomingSeason": "Winter to early summer (June to November)",
      "location": "Australia, cultivated worldwide in warm climates",
      "colors": [
        "white"
      ],
      "emoji": "🌿",
      "funFact": "Eucalyptus trees produce nectar-rich flowers that attract a variety of pollinators, including birds and bees."
    }
  ]
}