{
  "date": "June 24",
  "plants": [
    {
      "name": "Rosa spp.",
      "commonName": "Roses",
      "description": "Roses are iconic flowering shrubs known for their layered petals and pleasant fragrance. In temperate regions, many rose varieties are in full bloom during late spring to early summer, including June. They are widely cultivated in gardens and parks worldwide.",
      "bloomingSeason": "May to July",
      "location": "Temperate regions worldwide, including Europe, North America, and parts of Asia",
      "colors": [
        "red",
        "pink",
        "white",
        "yellow",
        "orange"
      ],
      "emoji": "🌹",
      "funFact": "Roses have been cultivated for over 5,000 years and are symbols of love and beauty in many cultures."
    },
    {
      "name": "Lupinus polyphyllus",
      "commonName": "Lupine",
      "description": "Lupines are herbaceous plants with tall spikes of flowers resembling pea blossoms. They thrive in temperate climates and bloom in late spring to early summer. Often found in wild meadows and cultivated gardens, they are nitrogen-fixing plants that improve soil fertility.",
      "bloomingSeason": "May to July",
      "location": "North America and parts of Europe, especially in cooler temperate zones",
      "colors": [
        "blue",
        "purple",
        "pink",
        "white"
      ],
      "emoji": "🌸",
      "funFact": "Some species of lupines can fix nitrogen in the soil, making them valuable in crop rotation."
    },
    {
      "name": "Delonix regia",
      "commonName": "Flamboyant tree (Royal Poinciana)",
      "description": "A striking tree known for its vivid scarlet flowers and fern-like leaves. It blooms in late spring to early summer in tropical and subtropical regions. Its fiery red-orange flowers create spectacular displays in urban and natural landscapes.",
      "bloomingSeason": "May to July",
      "location": "Tropical and subtropical regions, including the Caribbean, Africa, and South Asia",
      "colors": [
        "red",
        "orange"
      ],
      "emoji": "🌺",
      "funFact": "The flamboyant tree’s flowers have long stamens that give the appearance of flames, inspiring its common name."
    },
    {
      "name": "Boronia heterophylla",
      "commonName": "Red Boronia",
      "description": "A small shrub native to southwestern Australia, renowned for its bright red, star-shaped flowers. It blooms in the southern hemisphere’s winter to early summer, making June a prime month for viewing its vibrant floral displays.",
      "bloomingSeason": "June to August",
      "location": "Southwestern Australia",
      "colors": [
        "red"
      ],
      "emoji": "🌺",
      "funFact": "Boronias are prized in Australian gardens for their fragrant and colorful flowers despite their relatively short blooming period."
    }
  ]
}