{
  "date": "June 28",
  "plants": [
    {
      "name": "Rosa spp.",
      "commonName": "Roses",
      "description": "Roses are cherished flowering shrubs known for their beautiful, fragrant blooms with layered petals. They thrive in temperate climates and are often cultivated in gardens worldwide. In the Northern Hemisphere, many rose varieties bloom from late spring through summer, including late June.",
      "bloomingSeason": "May to July (Northern Hemisphere)",
      "location": "Temperate regions worldwide, including Europe, North America, and Asia",
      "colors": [
        "red",
        "pink",
        "white",
        "yellow",
        "orange",
        "purple"
      ],
      "emoji": "🌹",
      "funFact": "Roses have been symbols of love and beauty for thousands of years and contain more than 200 species."
    },
    {
      "name": "Lavandula angustifolia",
      "commonName": "English Lavender",
      "description": "English lavender is a fragrant evergreen shrub valued for its aromatic purple flower spikes. It blooms profusely in summer, attracting pollinators like bees and butterflies.",
      "bloomingSeason": "June to August",
      "location": "Mediterranean regions, also widely cultivated in gardens across temperate zones",
      "colors": [
        "purple",
        "violet"
      ],
      "emoji": "💜",
      "funFact": "Lavender oil distilled from English lavender is used in aromatherapy and cosmetics."
    },
    {
      "name": "Edwardsia grandiflora",
      "commonName": "Showy Prairie Clover",
      "description": "This wildflower is native to the central prairies of North America. It produces bright purple to pink flower clusters during early summer and plays a role in natural prairie ecosystems.",
      "bloomingSeason": "June to July",
      "location": "Central United States prairies",
      "colors": [
        "purple",
        "pink"
      ],
      "emoji": "🌸",
      "funFact": "Prairie clovers fix nitrogen in the soil, enriching prairie ecosystems."
    },
    {
      "name": "Nymphaea alba",
      "commonName": "European White Water Lily",
      "description": "A striking aquatic plant with large, fragrant white flowers that float on ponds and lakes. It blooms in summer months, including late June, in temperate freshwater habitats.",
      "bloomingSeason": "June to August",
      "location": "Freshwater bodies in Europe, parts of Asia, and North Africa",
      "colors": [
        "white"
      ],
      "emoji": "💧🌼",
      "funFact": "Water lilies move their flowers to track the sun and open during the day, closing at night."
    }
  ]
}