{
  "date": "December 5",
  "plants": [
    {
      "name": "Camellia japonica",
      "commonName": "Japanese Camellia",
      "description": "An evergreen shrub known for its large, showy flowers that bloom in late fall to early spring. The flowers have numerous petals and can be single or double.",
      "bloomingSeason": "October to April",
      "location": "East Asia (native); widely cultivated in temperate regions globally",
      "colors": [
        "red",
        "pink",
        "white"
      ],
      "emoji": "🌺",
      "funFact": "Camellia japonica was named after the Jesuit botanist Georg Kamel and is highly prized in traditional Japanese gardens."
    },
    {
      "name": "Nerium oleander",
      "commonName": "Oleander",
      "description": "A hardy evergreen shrub that blooms in warm climates almost year-round, with peak flowering in late spring and again in autumn to early winter.",
      "bloomingSeason": "May to December",
      "location": "Mediterranean Basin; widely cultivated in subtropical and tropical regions",
      "colors": [
        "pink",
        "red",
        "white",
        "yellow"
      ],
      "emoji": "🌸",
      "funFact": "Oleander is highly toxic; all parts of the plant contain compounds that can be fatal if ingested."
    },
    {
      "name": "Helleborus niger",
      "commonName": "Christmas Rose",
      "description": "A perennial plant that produces large, white flowers often blooming in winter, including December. It thrives in shaded woodlands and gardens in temperate areas.",
      "bloomingSeason": "December to February",
      "location": "Central and Southern Europe",
      "colors": [
        "white"
      ],
      "emoji": "❄️🌹",
      "funFact": "Despite its common name, Christmas Rose is not a true rose and blooms in the coldest months of the year."
    },
    {
      "name": "Brassica oleracea var. acephala",
      "commonName": "Kale Flowers",
      "description": "Flowering kale produces ornamental rosettes of colorful leaves and small yellow flowers in cool weather, often blooming into winter.",
      "bloomingSeason": "Fall to early winter",
      "location": "Worldwide cultivation in temperate climates",
      "colors": [
        "yellow"
      ],
      "emoji": "🥬",
      "funFact": "Kale flowers attract pollinators even during colder months, supporting beneficial insect populations in winter gardens."
    }
  ]
}