{
  "date": "December 14",
  "plants": [
    {
      "name": "Nerium oleander",
      "commonName": "Oleander",
      "description": "Oleander is a hardy evergreen shrub that produces clusters of fragrant, showy flowers throughout much of the year in warm climates, including December in Mediterranean and subtropical regions. It thrives in sunny, dry conditions and is often used in landscaping.",
      "bloomingSeason": "May to November, sometimes year-round in mild climates",
      "location": "Mediterranean Basin, Southern United States, Australia",
      "colors": [
        "Pink",
        "White",
        "Red"
      ],
      "emoji": "🌺",
      "funFact": "Despite being widely cultivated, all parts of oleander are highly toxic if ingested."
    },
    {
      "name": "Eucalyptus pauciflora",
      "commonName": "Snow Gum",
      "description": "Snow Gum is a eucalyptus species native to the high-altitude regions of southeastern Australia. It typically blooms in late spring to early summer but can have sporadic blooming extending into the southern hemisphere summer, including December. The flowers are fluffy clusters of stamens without petals.",
      "bloomingSeason": "November to January",
      "location": "Australian Alps and surrounding highlands",
      "colors": [
        "Creamy White"
      ],
      "emoji": "🌿",
      "funFact": "Snow Gum is well adapted to cold alpine environments and is one of the few eucalyptus species that withstand snow."
    },
    {
      "name": "Camellia sasanqua",
      "commonName": "Sasanqua Camellia",
      "description": "Sasanqua Camellia is a species of camellia that blooms in late autumn to early winter, producing fragrant, delicate flowers often used in traditional Japanese gardens. It thrives in temperate climates and is popular in East Asia and parts of the southeastern United States.",
      "bloomingSeason": "October to December",
      "location": "Japan, China, Southeastern United States",
      "colors": [
        "White",
        "Pink",
        "Light Red"
      ],
      "emoji": "🌸",
      "funFact": "Sasanqua camellias were historically used to make tea and oil in Japan."
    },
    {
      "name": "Hamamelis virginiana",
      "commonName": "Witch Hazel",
      "description": "Witch Hazel is a deciduous shrub native to North America that blooms in late fall to early winter. Its unique yellow, spidery flowers appear on bare branches and are known for their fragrant, astringent properties, commonly used medicinally.",
      "bloomingSeason": "October to December",
      "location": "Eastern North America",
      "colors": [
        "Yellow"
      ],
      "emoji": "🍂",
      "funFact": "Witch hazel flowers in late fall and winter as an adaptation to attract winter-active pollinators."
    }
  ]
}