{
  "date": "December 17",
  "plants": [
    {
      "name": "Nerium oleander",
      "commonName": "Oleander",
      "description": "Oleander is an evergreen shrub commonly found in Mediterranean climates. It produces fragrant and showy clusters of flowers that bloom almost year-round in frost-free subtropical and tropical regions, including December in places like Southern California and the Mediterranean basin.",
      "bloomingSeason": "Spring to late fall, but in frost-free areas blooms can appear in December",
      "location": "Southern California (USA), Mediterranean region",
      "colors": [
        "Pink",
        "White",
        "Red"
      ],
      "emoji": "🌺",
      "funFact": "Despite its beauty, all parts of the oleander plant are highly toxic if ingested."
    },
    {
      "name": "Witch Hazel (Hamamelis virginiana)",
      "commonName": "Witch Hazel",
      "description": "This deciduous shrub is remarkable for blooming in late fall to early winter, often from October to December. It produces spidery yellow flowers with a sweet fragrance, providing winter interest and important nectar sources for pollinators.",
      "bloomingSeason": "October to December",
      "location": "Eastern North America",
      "colors": [
        "Yellow"
      ],
      "emoji": "🌼",
      "funFact": "Witch hazel extract is widely used for its medicinal astringent properties."
    },
    {
      "name": "Camellia japonica",
      "commonName": "Camellia",
      "description": "Camellias are popular flowering shrubs in temperate climates that bloom in late fall and winter. Their large, rose-like flowers can bloom throughout December in milder parts of the world, such as parts of East Asia and the southern United States.",
      "bloomingSeason": "October to March (varies with cultivar)",
      "location": "East Asia, Southeastern USA",
      "colors": [
        "Pink",
        "Red",
        "White"
      ],
      "emoji": "🌸",
      "funFact": "Camellia oil derived from the seeds is used in cosmetic products and cooking."
    },
    {
      "name": "Leptospermum scoparium",
      "commonName": "Manuka",
      "description": "Manuka is a flowering shrub native to New Zealand and southeastern Australia, known for its dense clusters of small white or pink flowers that bloom primarily in late spring to early summer. However, in milder climates or different subspecies, bloom can extend into early winter months including December in the Southern Hemisphere.",
      "bloomingSeason": "Spring to early summer; some blooming into December in certain regions",
      "location": "New Zealand, Australia",
      "colors": [
        "White",
        "Pink"
      ],
      "emoji": "🌿",
      "funFact": "Manuka flowers produce nectar used by bees to make unique Manuka honey, famous for its medicinal properties."
    }
  ]
}