{
  "date": "July 3",
  "events": [
    {
      "year": 1775,
      "title": "George Washington Appointed Commander-in-Chief",
      "description": "The Second Continental Congress appointed George Washington as the commander-in-chief of the Continental Army during the American Revolutionary War.",
      "category": "Political/Military",
      "significance": "This appointment marked the beginning of Washington's military leadership that would eventually lead to American independence."
    },
    {
      "year": 1863,
      "title": "Battle of Gettysburg Ends",
      "description": "The decisive battle of Gettysburg concluded with Union forces defeating the Confederate Army, marking a turning point in the American Civil War.",
      "category": "Military",
      "significance": "The victory helped to halt the Confederate invasion of the North and boosted Union morale."
    },
    {
      "year": 1890,
      "title": "U.S. Census Bureau Declares the Frontier Closed",
      "description": "The U.S. Census Bureau announced that the American frontier was no longer discernible, marking the end of westward expansion.",
      "category": "Social/Political",
      "significance": "This declaration symbolized the closing of a significant chapter in American history and the beginning of the modern era."
    },
    {
      "year": 1962,
      "title": "French President Charles de Gaulle Gives 'Vive le Québec Libre!' Speech",
      "description": "During a visit to Canada, de Gaulle's proclamation supported Quebec's independence movement, stirring diplomatic tensions.",
      "category": "Political",
      "significance": "The speech intensified debates over Quebec sovereignty and strained Franco-Canadian relations."
    },
    {
      "year": 2005,
      "title": "Live 8 Concerts Held Worldwide",
      "description": "A series of benefit concerts took place globally to raise awareness of poverty in Africa and pressure G8 leaders to increase aid.",
      "category": "Cultural/Social",
      "significance": "The concerts mobilized international attention and influenced policy discussions on global poverty."
    }
  ]
}