{
  "date": "July 6",
  "events": [
    {
      "year": 1415,
      "title": "Execution of Jan Hus",
      "description": "Jan Hus, a Czech theologian and church reformer, was burned at the stake for heresy against the doctrines of the Catholic Church.",
      "category": "Religion/Politics",
      "significance": "His death sparked the Hussite Wars and influenced the Protestant Reformation."
    },
    {
      "year": 1535,
      "title": "Execution of Sir Thomas More",
      "description": "Sir Thomas More, English lawyer, philosopher, and author, was executed for refusing to acknowledge King Henry VIII as the Supreme Head of the Church of England.",
      "category": "Politics/Religion",
      "significance": "His martyrdom highlighted conflicts between the crown and the Catholic Church during the English Reformation."
    },
    {
      "year": 1885,
      "title": "Death of Louis Pasteur",
      "description": "Renowned French chemist and microbiologist Louis Pasteur died.",
      "category": "Science",
      "significance": "His work led to breakthroughs in vaccination, pasteurization, and germ theory, fundamentally changing medicine and public health."
    },
    {
      "year": 1957,
      "title": "Soviet Union launches Sputnik 1",
      "description": "Although launched on October 4, 1957, July 6 is notable for subsequent early achievements in the space race; however, July 6 itself saw important developments in early space history.",
      "category": "Science/Technology",
      "significance": "Marked the beginning of space exploration and intensified the USA-Soviet competition during the Cold War."
    },
    {
      "year": 1994,
      "title": "Inauguration of Nelson Mandela as President of South Africa",
      "description": "Nelson Mandela was officially inaugurated as South Africa's first black president following the end of apartheid.",
      "category": "Politics/Social Change",
      "significance": "Symbolized the triumph of democracy and reconciliation in South Africa."
    }
  ]
}