{
  "date": "July 20",
  "events": [
    {
      "year": 1969,
      "title": "Apollo 11 Moon Landing",
      "description": "Apollo 11 astronauts Neil Armstrong and Buzz Aldrin landed on the Moon, and Armstrong became the first human to walk on the lunar surface.",
      "category": "Space Exploration",
      "significance": "Marked humanity's first successful manned mission to another celestial body, a major milestone in space exploration."
    },
    {
      "year": 1944,
      "title": "Failed Assassination Attempt on Adolf Hitler (July 20 Plot)",
      "description": "A group of German officers attempted to assassinate Adolf Hitler with a bomb in an effort to overthrow the Nazi regime.",
      "category": "World War II / Political History",
      "significance": "Demonstrated internal opposition to Hitler within Germany and had lasting impacts on resistance movements during the war."
    },
    {
      "year": 1214,
      "title": "Battle of Bouvines",
      "description": "King Philip II of France defeated an English coalition led by King John and Emperor Otto IV, solidifying French royal power.",
      "category": "Medieval Warfare",
      "significance": "Established French dominance in the region and contributed to the decline of English territories in France."
    },
    {
      "year": 1948,
      "title": "First Polio Vaccine Tested",
      "description": "Dr. Hilary Koprowski administered the first effective oral poliovirus vaccine to a child in a clinical test.",
      "category": "Medical Milestone",
      "significance": "Paved the way for widespread polio immunization and eventual near-eradication of the disease."
    },
    {
      "year": 1871,
      "title": "Great Fire of Chicago Ends",
      "description": "After several days, the Great Chicago Fire was finally contained, having destroyed much of the city.",
      "category": "Disaster",
      "significance": "Led to major urban rebuilding, modernization, and improved fire safety standards."
    }
  ]
}