{
  "date": "July 23",
  "events": [
    {
      "year": 1829,
      "title": "The London Protocol established Greece's independence",
      "description": "The London Protocol was signed by Britain, France, and Russia, recognizing Greece as an independent sovereign state, ending its war of independence from the Ottoman Empire.",
      "category": "Political",
      "significance": "This marked the formal recognition of Greek independence, a major step in the decline of Ottoman authority in Europe."
    },
    {
      "year": 1903,
      "title": "First Tour de France begins",
      "description": "The inaugural Tour de France bicycle race started in Paris as a 6-stage race over 2,428 kilometers, which would become the world's most famous and challenging cycling race.",
      "category": "Sports",
      "significance": "The beginning of what would become a globally significant sporting event and cultural tradition."
    },
    {
      "year": 1921,
      "title": "NY State Assembly refuses Socialist membership",
      "description": "The New York State Assembly voted to expel five Socialist assembly members, reflecting tensions during the Red Scare post World War I.",
      "category": "Political",
      "significance": "An example of political suppression during a period of fear of communist influence in the US."
    },
    {
      "year": 1952,
      "title": "Egyptian Revolution begins",
      "description": "A group of Egyptian army officers, known as the Free Officers Movement, led a coup d'état that eventually led to the overthrow of King Farouk and the establishment of a republic.",
      "category": "Political",
      "significance": "Marked the end of the monarchy in Egypt and the beginning of a new political era."
    },
    {
      "year": 1988,
      "title": "The Piper Alpha disaster",
      "description": "An explosion and fire on the North Sea oil platform Piper Alpha resulted in the death of 167 workers, making it one of the deadliest offshore oil disasters in history.",
      "category": "Disaster",
      "significance": "Led to major changes in offshore oil platform safety regulations worldwide."
    }
  ]
}