{
  "date": "July 26",
  "events": [
    {
      "year": 1953,
      "title": "Start of the Cuban Revolution",
      "description": "Fidel Castro, along with his revolutionaries, attacked the Moncada Barracks in Santiago de Cuba, marking the beginning of the Cuban Revolution against the Batista regime.",
      "category": "Political Revolution",
      "significance": "This event is considered the start of the Cuban Revolution, which eventually led to the overthrow of Fulgencio Batista and the establishment of a socialist government in Cuba under Castro."
    },
    {
      "year": 1945,
      "title": "Creation of the United Nations Charter",
      "description": "The United Nations Charter was signed by 50 countries in San Francisco at the conclusion of the United Nations Conference on International Organization.",
      "category": "International Relations",
      "significance": "The charter established the United Nations, an international organization aimed at promoting peace, security, and cooperation among nations."
    },
    {
      "year": 1933,
      "title": "U.S. Congress Passes the Glass-Steagall Act",
      "description": "The Banking Act of 1933, commonly known as the Glass-Steagall Act, was enacted to separate commercial and investment banking and to provide banking reforms in response to the Great Depression.",
      "category": "Economic Policy",
      "significance": "The act sought to restore public confidence in the banking system and reduce the risk of financial speculation that contributed to the 1929 stock market crash."
    },
    {
      "year": 1957,
      "title": "Independence of Ghana",
      "description": "Ghana gained independence from British colonial rule, becoming the first sub-Saharan African country to do so.",
      "category": "Decolonization",
      "significance": "Ghana's independence marked a major milestone in the wave of decolonization across Africa and inspired other nations to seek self-governance."
    },
    {
      "year": 1908,
      "title": "First Model T Ford Produced",
      "description": "The first Model T automobile was produced by the Ford Motor Company.",
      "category": "Industrial Innovation",
      "significance": "The Model T was the first affordable automobile that opened car travel to the middle class, revolutionizing transportation and American industry."
    }
  ]
}