{
  "date": "July 31",
  "events": [
    {
      "year": 1498,
      "title": "Vasco da Gama Arrives in Calicut, India",
      "description": "Portuguese explorer Vasco da Gama reaches Calicut (now Kozhikode), India, establishing a sea route from Europe to Asia.",
      "category": "Exploration",
      "significance": "This event marks the beginning of direct maritime trade between Europe and Asia, influencing global trade and colonialism."
    },
    {
      "year": 1790,
      "title": "Invention of the First Patent System in the United States",
      "description": "The first U.S. patent was granted to Samuel Hopkins for a process of making potash, establishing the U.S. patent system.",
      "category": "Innovation",
      "significance": "It laid the foundation for protecting intellectual property, encouraging innovation and technological growth in America."
    },
    {
      "year": 1914,
      "title": "Germany Declares War on Russia, Escalating World War I",
      "description": "Germany formally declares war on Russia, marking a significant escalation in the outbreak of World War I.",
      "category": "War",
      "significance": "This declaration intensified the conflict, leading to widespread involvement of world powers in the war."
    },
    {
      "year": 1964,
      "title": "The Civil Rights Act is Signed into U.S. Law",
      "description": "President Lyndon B. Johnson signed the Civil Rights Act of 1964, outlawing discrimination based on race, color, religion, sex, or national origin.",
      "category": "Civil Rights",
      "significance": "A landmark legislation in the struggle for equality, it helped end segregation and promoted equal opportunity."
    },
    {
      "year": 1991,
      "title": "Dissolution of the Warsaw Pact Announced",
      "description": "The member states of the Warsaw Pact announce that the alliance will cease to function, effectively dissolving it.",
      "category": "Political",
      "significance": "The end of this military alliance marked the winding down of Cold War tensions and shifted geopolitical dynamics in Europe."
    }
  ]
}