{
  "date": "January 1",
  "events": [
    {
      "year": 1804,
      "title": "Haiti Declares Independence",
      "description": "On January 1, 1804, Haiti proclaimed its independence from France, completing the Haitian Revolution and establishing the first independent Black republic.",
      "category": "World/Independence",
      "significance": "A landmark in anti-colonial struggle and abolition, influencing future movements for independence and abolition in the Caribbean."
    },
    {
      "year": 1863,
      "title": "Emancipation Proclamation Takes Effect",
      "description": "The Emancipation Proclamation, issued by President Abraham Lincoln, declared the freedom of enslaved people in Confederate-held territories and reframed the Civil War as a fight against slavery.",
      "category": "American Civil War / Slavery",
      "significance": "Reoriented the war’s purpose, paved the path toward abolition and the 13th Amendment."
    },
    {
      "year": 1901,
      "title": "Federation of Australia",
      "description": "The six Australian colonies united to form the Commonwealth of Australia, creating a single federal nation.",
      "category": "Political History / Nation-building",
      "significance": "Birth of modern Australia and a model for federation within the British Empire."
    },
    {
      "year": 1959,
      "title": "Cuban Revolution Reaches Power",
      "description": "Fidel Castro’s forces seized control of Havana as Batista fled the country, marking the triumph of the Cuban Revolution.",
      "category": "Cold War / Revolutions",
      "significance": "Transforms Caribbean politics and reshapes Cold War dynamics, influencing U.S.–Cuba relations for decades."
    },
    {
      "year": 1994,
      "title": "NAFTA Comes Into Force",
      "description": "The North American Free Trade Agreement entered into force among the United States, Canada, and Mexico, creating a trilateral trade bloc.",
      "category": "Economics / International Trade",
      "significance": "Significant reshaping of North American trade and economic integration, with lasting impacts on industries and labor."
    }
  ]
}