{
  "date": "January 6",
  "events": [
    {
      "year": 1066,
      "title": "Coronation of Harold II as King of England",
      "description": "After the death of Edward the Confessor, Harold II was crowned king of England on January 6, 1066, at Westminster Abbey. This event preceded the Norman Conquest later that year.",
      "category": "Political history / Monarchy (England)",
      "significance": "Marked the last major Anglo-Saxon reign and set the stage for the Norman conquest that reshaped English governance and culture."
    },
    {
      "year": 1838,
      "title": "Samuel Morse publicly demonstrates the electric telegraph",
      "description": "On January 6, 1838, Samuel F. B. Morse demonstrated the electric telegraph to an audience, showcasing a method for rapid long-distance communication.",
      "category": "Technology / Inventions",
      "significance": "Pioneered modern long-distance communication networks, laying the groundwork for a global telegraph system that transformed information exchange."
    },
    {
      "year": 1937,
      "title": "Roosevelt outlines the Judicial Procedures Reform Bill (court-packing plan)",
      "description": "On January 6, 1937, U.S. President Franklin D. Roosevelt proposed a plan to expand the Supreme Court to obtain more favorable rulings for New Deal legislation.",
      "category": "Politics / Law",
      "significance": "A controversial move that sparked extensive political backlash and altered the dynamics of Roosevelt’s presidency and constitutional politics."
    },
    {
      "year": 2021,
      "title": "January 6 U.S. Capitol attack",
      "description": "Supporters of President Donald Trump stormed the U.S. Capitol in Washington, D.C., while Congress was certifying the 2020 presidential election results.",
      "category": "Political history / Civil unrest",
      "significance": "Shook the American political system, led to multiple deaths and injuries, and prompted widespread debates about democracy, security, and accountability."
    }
  ]
}