{
  "date": "January 15",
  "events": [
    {
      "year": 1559,
      "title": "Elizabeth I crowned Queen of England",
      "description": "Elizabeth I was crowned queen at Westminster Abbey, marking the formal beginning of her long reign and the Elizabethan era after the death of her sister, Mary I.",
      "category": "Monarchy/Politics",
      "significance": "Solidified the Tudor dynasty and set the stage for a period of relative stability and cultural flowering in England."
    },
    {
      "year": 1759,
      "title": "The British Museum opens to the public",
      "description": "The British Museum in London opens its doors as a national public museum, offering access to its vast collections.",
      "category": "Culture/History",
      "significance": "Pioneered the model of a public, publicly funded museum and expanded access to knowledge about world history."
    },
    {
      "year": 1967,
      "title": "First Super Bowl played",
      "description": "The Green Bay Packers defeated the Kansas City Chiefs 35–10 in the first AFL–NFL World Championship Game, held at the Los Angeles Memorial Coliseum.",
      "category": "Sports",
      "significance": "Launched the NFL's championship game into a global entertainment phenomenon and began a long-running sports tradition."
    },
    {
      "year": 2001,
      "title": "Wikipedia launches",
      "description": "Wikipedia, a free, collaborative online encyclopedia, is launched and quickly grows into a major source of information.",
      "category": "Technology/Internet",
      "significance": "Revolutionized how knowledge is created, edited, and consumed on the internet."
    },
    {
      "year": 2009,
      "title": "Miracle on the Hudson",
      "description": "US Airways Flight 1549, piloted by Captain Chesley Sullenberger, ditched in the Hudson River after a bird strike; all 155 people aboard survived.",
      "category": "Aviation",
      "significance": "Displayed exceptional piloting and crisis management, becoming a symbol of effective emergency response."
    }
  ]
}