{
  "date": "January 18",
  "events": [
    {
      "year": 1778,
      "title": "Captain James Cook Reaches the Hawaiian Islands",
      "description": "Captain James Cook became the first European to visit the Hawaiian Islands, which he named the Sandwich Islands.",
      "category": "Exploration",
      "significance": "This event marked the first recorded European contact with Hawaii, opening the islands to increased interaction and eventual integration into global maritime routes."
    },
    {
      "year": 1919,
      "title": "Paris Peace Conference Opens",
      "description": "Delegates from over 30 countries met in Paris to negotiate the peace treaties that would end World War I.",
      "category": "Diplomatic History",
      "significance": "The decisions made at this conference redefined national borders and set the stage for international relations in the 20th century, leading to the Treaty of Versailles."
    },
    {
      "year": 1943,
      "title": "Zookeeper Who Saved Jews During Holocaust Recognized",
      "description": "Zoo director Janusz Korczak refused to abandon the orphans in his care and died with them in Treblinka extermination camp (commemorated on January 18).",
      "category": "World War II / Holocaust",
      "significance": "Korczak's sacrifice symbolizes courage and humanity during the Holocaust, and he is remembered as a hero who protected children under dire circumstances."
    },
    {
      "year": 1991,
      "title": "Operation Desert Storm Begins",
      "description": "The U.S.-led coalition launched air strikes against Iraq, initiating the Gulf War to expel Iraqi forces from Kuwait.",
      "category": "Military History",
      "significance": "This marked the start of a major conflict in the Middle East with significant geopolitical implications for regional stability and international relations."
    },
    {
      "year": 1943,
      "title": "Socrates Dies",
      "description": "Greek classical philosopher Socrates died in Athens after being sentenced to death by poison for corrupting youth and impiety.",
      "category": "Philosophy",
      "significance": "Socrates is considered a foundational figure in Western philosophy, and his method of inquiry influenced centuries of thought."
    }
  ]
}