{
  "date": "January 26",
  "events": [
    {
      "year": 1788,
      "title": "First Fleet Arrives in Australia",
      "description": "The First Fleet, carrying convicts and settlers, arrived at Botany Bay, marking the beginning of British colonization in Australia.",
      "category": "Exploration/Colonization",
      "significance": "This event is considered the founding of modern Australia and is commemorated as Australia Day."
    },
    {
      "year": 1837,
      "title": "Michigan Becomes the 26th U.S. State",
      "description": "Michigan was admitted to the United States as the 26th state, following its settlement and development.",
      "category": "Political History",
      "significance": "This expanded the United States and contributed to its westward growth during the 19th century."
    },
    {
      "year": 1930,
      "title": "Indian Independence Movement: Pledge of Purna Swaraj",
      "description": "The Indian National Congress declared January 26 as the day for complete independence (Purna Swaraj) from British rule.",
      "category": "Political History",
      "significance": "This declaration was a pivotal moment in the Indian independence movement, eventually leading to India's freedom in 1947."
    },
    {
      "year": 1950,
      "title": "India Becomes a Republic",
      "description": "The Constitution of India came into effect, and India was declared a sovereign republic.",
      "category": "Political History",
      "significance": "This marked the official transition of India to a republic, with a president as its head of state, and is celebrated annually as Republic Day."
    },
    {
      "year": 1965,
      "title": "Sir Winston Churchill Dies",
      "description": "Winston Churchill, former Prime Minister of the United Kingdom, died at the age of 90.",
      "category": "Political History",
      "significance": "Churchill was a significant leader during World War II and his death marked the end of an era in British politics."
    }
  ]
}