{
  "date": "February 2",
  "holidays": [
    {
      "name": "Groundhog Day",
      "description": "A tradition where a groundhog predicts the weather: if it sees its shadow, six more weeks of winter; if not, an early spring arrives.",
      "origin": "Dating back to ancient European weather lore, brought to America by German immigrants; popularized in Punxsutawney, Pennsylvania.",
      "category": "Folklore / Weather",
      "emoji": "🌤️",
      "funFact": "The most famous groundhog, Punxsutawney Phil, has been 'predicting' the weather since 1887!"
    },
    {
      "name": "Bubble Gum Day",
      "description": "A day to celebrate bubble gum – blowing bubbles, chewing away stress, and enjoying everything about this chewy treat!",
      "origin": "Created by bubble gum enthusiasts to honor its invention and quirky fun nature.",
      "category": "Food / Fun",
      "emoji": "🍬",
      "funFact": "Bubble gum was invented in 1928 by Walter Diemer, an accountant who created the first bubble gum that didn't stick to everything."
    },
    {
      "name": "World Wetlands Day",
      "description": "An environmental observance promoting awareness about the importance of wetlands for biodiversity and ecosystem health.",
      "origin": "Established in 1997 to mark the signing of the Ramsar Convention on Wetlands in 1971.",
      "category": "Environmental Awareness",
      "emoji": "🌿",
      "funFact": "Wetlands cover only 6% of the Earth's surface but support 40% of all species! They're like nature's unsung heroes."
    },
    {
      "name": "Fettuccine Alfredo Day",
      "description": "The day to celebrate the creamy, cheesy delight of Fettuccine Alfredo, an Italian pasta dish beloved worldwide.",
      "origin": "Inspired by Giuseppe Alfredo invented in Rome in 1914 and popularized to the world thanks to Hollywood stars.",
      "category": "Food / Cultural",
      "emoji": "🍝",
      "funFact": "Legend says that Hollywood stars Douglas Fairbanks and Mary Pickford loved Alfredo's creamy pasta so much they brought the recipe back to the U.S., making it a sensation!"
    }
  ]
}