{
  "date": "February 3",
  "holidays": [
    {
      "name": "Feed the Birds Day",
      "description": "A charming day dedicated to taking a break and feeding our feathered friends, whether in your backyard or local park. It’s a pause to appreciate the simple joy of birdsong and nature’s winged wonders.",
      "origin": "Inspired by the iconic song \"Feed the Birds\" from Disney’s Mary Poppins, the day encourages kindness to birds and raises awareness about protecting bird habitats.",
      "category": "Nature/Animal Appreciation",
      "emoji": "🐦",
      "funFact": "Studies show that feeding birds in winter can help them survive harsh conditions and boost their populations."
    },
    {
      "name": "Caribbean Carnival Day",
      "description": "A vibrant celebration embracing the colorful culture, music, and costumes of Caribbean carnivals held all over the world, featuring calypso, reggae, steelpan music, and dancing.",
      "origin": "Rooted in the Caribbean’s colonial history and African cultural heritage, carnival events typically take place before Lent; this day recognizes their joyous spirit year-round.",
      "category": "Cultural/Festival",
      "emoji": "🎭",
      "funFact": "The world's largest Caribbean Carnival outside the Caribbean is held annually in Toronto, known as the Toronto Caribbean Carnival."
    },
    {
      "name": "Golden Retriever Lover's Day",
      "description": "A day to celebrate one of the friendliest and most popular dog breeds, known for their luscious golden coats and gentle temperament.",
      "origin": "Celebrated unofficially by dog lovers to honor Golden Retrievers and promote adoption and responsible pet ownership.",
      "category": "Pet/Animal",
      "emoji": "🐕‍🦺",
      "funFact": "Golden Retrievers are often used in therapy and assistance roles because of their intelligence and friendly nature."
    },
    {
      "name": "The Day the Music Died Remembrance Day",
      "description": "Marks the anniversary of the tragic 1959 plane crash that took the lives of Buddy Holly, Ritchie Valens, and The Big Bopper, forever impacting rock and roll history.",
      "origin": "Commemorates the loss of key early rock pioneers, leading to new musical directions and remembrance events.",
      "category": "Music History/Remembrance",
      "emoji": "🎸",
      "funFact": "The phrase 'The Day the Music Died' comes from Don McLean's 1971 hit song 'American Pie.'"
    },
    {
      "name": "Wisdom Teeth Day",
      "description": "A humorous unofficial observance dedicated to those who have had their wisdom teeth removed — a shared rite of passage that often comes with funny stories and ice cream cravings.",
      "origin": "Began among dental communities and social media as a lighthearted nod to this common dental procedure.",
      "category": "Health/Humor",
      "emoji": "😬",
      "funFact": "On average, about 5 million wisdom teeth are removed in the United States every year."
    }
  ]
}