{
  "date": "February 4",
  "holidays": [
    {
      "name": "World Cancer Day",
      "description": "A global initiative to raise awareness, improve education, and encourage research in the fight against cancer.",
      "origin": "Established by the Union for International Cancer Control (UICC) in 2000 to unite the world in the fight against cancer.",
      "category": "Awareness Day",
      "emoji": "🎗️",
      "funFact": "Despite its serious intent, many participants organize quirky events like cancer-themed costume runs to engage the community!"
    },
    {
      "name": "Create a Vacuum Day",
      "description": "A playful, pseudo-scientific day dedicated to the idea of making a perfect vacuum—because who doesn't want an excuse to talk about physics and space?",
      "origin": "Origin unknown, likely started by science enthusiasts fascinated with the concept of vacuum.",
      "category": "Science/Quirky",
      "emoji": "🧪",
      "funFact": "While we can't create a perfect vacuum on Earth, the day inspires creative experiments in a lot of classrooms worldwide!"
    },
    {
      "name": "Thank a Mailman Day",
      "description": "Express gratitude to the hardworking mail carriers who deliver our letters, packages, and occasional bills with a smile.",
      "origin": "An unofficial holiday celebrated mainly in the United States as a recognition of postal workers' efforts.",
      "category": "Appreciation Day",
      "emoji": "📬",
      "funFact": "February is often chosen because it’s one of the coldest months, so thanking a mailman then is extra sweet!"
    },
    {
      "name": "Tater Tot Day",
      "description": "A celebration of the beloved crispy, golden potato treat known as Tater Tots! Perfect day to indulge in this snack or try some creative recipes.",
      "origin": "Officially recognized in the United States to honor the invention of Tater Tots by the Ore-Ida company in 1953.",
      "category": "Food Holiday",
      "emoji": "🥔",
      "funFact": "There are now gourmet versions of Tater Tots topped with everything from cheese and jalapeños to pulled pork!"
    }
  ]
}