{
  "date": "February 5",
  "holidays": [
    {
      "name": "National Weatherperson's Day",
      "description": "A day to recognize and thank those who keep us informed and prepared by reporting the weather — from local meteorologists to national forecasters.",
      "origin": "Commemorates the birthday of John Jeffries, one of America’s first weather observers, born February 5, 1744.",
      "category": "Awareness",
      "emoji": "🌦️",
      "funFact": "John Jeffries was not only a weather observer but also the first person to fly in a hot air balloon in the U.S., using it to study the atmosphere!"
    },
    {
      "name": "World Nutella Day",
      "description": "A celebration dedicated to Nutella, the beloved chocolate-hazelnut spread that's perfect on toast, pancakes, and pretty much everything delicious.",
      "origin": "Started unofficially by a blogger in 2007 to honor her love of Nutella.",
      "category": "Food",
      "emoji": "🍫",
      "funFact": "Over 365,000 tons of Nutella are consumed worldwide every year — that’s enough to circle the globe more than 10 times if you put the jars end to end!"
    },
    {
      "name": "Wear Red Day (UK)",
      "description": "An unofficial day to wear something red to raise awareness for heart disease and promote heart health, especially in women.",
      "origin": "Part of the British Heart Foundation’s efforts to spotlight cardiovascular health.",
      "category": "Awareness",
      "emoji": "❤️",
      "funFact": "Red clothing is said to boosts confidence and energy, making this day not only meaningful but stylish too!"
    },
    {
      "name": "World Nutella Day",
      "description": "A sweet celebration honoring the iconic hazelnut spread loved by millions worldwide, encouraging fans to share recipes and enjoy Nutella creatively.",
      "origin": "Began as a social media celebration started by a Nutella enthusiast in 2007.",
      "category": "Pop Culture/Food",
      "emoji": "🥄",
      "funFact": "Nutella was invented post-WWII by an Italian pastry maker who stretched limited cocoa supplies by mixing hazelnuts into the spread!"
    }
  ]
}