{
  "date": "February 6",
  "holidays": [
    {
      "name": "National Frozen Yogurt Day",
      "description": "A delicious day to celebrate the creamy, tangy delight that is frozen yogurt. Cool off and enjoy this healthier alternative to ice cream!",
      "origin": "This day originated in the early 2000s when frozen yogurt shops started booming in the U.S., capitalizing on the health-conscious trends of the time.",
      "category": "Food Holiday",
      "emoji": "🍦",
      "funFact": "Frozen yogurt was first popularized in the 1970s but saw a resurgence with probiotic claims in the 2000s."
    },
    {
      "name": "Waitangi Day (New Zealand)",
      "description": "Commemorating the signing of the Treaty of Waitangi in 1840, considered New Zealand's founding document between Maori chiefs and the British Crown.",
      "origin": "Treaty signed on February 6, 1840, establishing cooperation and a legal framework between indigenous Maori and British settlers.",
      "category": "Historical/Political",
      "emoji": "🇳🇿",
      "funFact": "It's also a day of peaceful protest and reflection for many Maori communities, making it both a celebration and a reminder of ongoing issues."
    },
    {
      "name": "Lame Duck Day",
      "description": "A humorous observance marking the period when elected officials who aren’t returning to office have limited power and influence.",
      "origin": "The term 'lame duck' dates back to 18th century British Parliament and became political slang for officials serving out a term with diminished authority.",
      "category": "Pop Culture/Political",
      "emoji": "🦆",
      "funFact": "The phrase 'lame duck' originally referred to businessmen who defaulted on their debts — how’s that for political insult roots?"
    },
    {
      "name": "Berry Fast Day",
      "description": "A quirky celebration reminding us to slow down and appreciate fresh berries, one of nature’s juiciest treats.",
      "origin": "This lesser-known observance encourages enjoying and promoting the health benefits of berries during their season, especially in regions where February is harvest time.",
      "category": "Food/Nature",
      "emoji": "🍓",
      "funFact": "Berries are packed with antioxidants; eating them slowly might just make the flavor last longer and your brain happier!"
    }
  ]
}