{
  "date": "February 8",
  "holidays": [
    {
      "name": "Kite Flying Day",
      "description": "A whimsical day to dust off your kite and send it soaring high into the winter winds! Celebrate the simple joy of kite flying and enjoy a breeze-blown adventure.",
      "origin": "Tracing back to ancient China where kites were used for military and scientific purposes, Kite Flying Day celebrates that timeless pastime that brings people together.",
      "category": "Outdoor Activity",
      "emoji": "🪁",
      "funFact": "Did you know the world’s largest kite was over 6,000 square feet and flew in Hong Kong? That’s a giant canvas in the sky!"
    },
    {
      "name": "Laugh and Get Rich Day",
      "description": "Embrace the power of laughter today! This quirky holiday inspires giggles and guffaws as a way to attract good fortune and positive vibes.",
      "origin": "Popularized by a motivational book emphasizing laughter’s role in success, this fun day encourages you to boost your wealth by smiling.",
      "category": "Self-Improvement",
      "emoji": "😂",
      "funFact": "Laughter can boost your immune system and even burn calories—so laughing your way to riches might just be scientifically valid!"
    },
    {
      "name": "Pizza Day (United Kingdom)",
      "description": "A savory celebration dedicated to everyone’s favorite cheesy pie—whether thin crust, deep dish, or loaded with toppings, today is your excuse to indulge.",
      "origin": "Gained popularity in the UK as a special day to honor pizza’s deliciousness, this unofficial food holiday brings pizza lovers together nationwide.",
      "category": "Food",
      "emoji": "🍕",
      "funFact": "February 8th is different from the US National Pizza Day on February 9th—so pizza fans get to party two days in a row!"
    },
    {
      "name": "Boy Scouts Day",
      "description": "Honoring the founding of the Boy Scouts of America in 1910, this day celebrates youth development, outdoor skills, and community service.",
      "origin": "Commemorates the birthday of the Boy Scouts, an organization created to empower young people through adventure and education.",
      "category": "Historical/Youth Organization",
      "emoji": "🪖",
      "funFact": "The Boy Scouts of America was directly inspired by the Scouting movement started by Robert Baden-Powell in the UK just a few years earlier."
    }
  ]
}