{
  "date": "February 10",
  "holidays": [
    {
      "name": "Umbrella Day",
      "description": "Celebrate the trusty umbrella, your best friend against rain, shine, or even unexpected snow showers! Get out your coolest, quirkiest umbrella and dance in the drizzle.",
      "origin": "Originally popularized by an American umbrella company in the mid-20th century to boost umbrella sales during slow months.",
      "category": "Object Appreciation",
      "emoji": "☂️",
      "funFact": "The earliest umbrella was designed over 4,000 years ago in ancient Egypt, initially to provide shade from the sun rather than rain!"
    },
    {
      "name": "Have a Brown Day",
      "description": "Embrace all things brown today—wear brown clothing, eat chocolate, coffee, or baked goods, and appreciate the understated elegance of the color brown.",
      "origin": "Created by someone who realized brown rarely gets its own special day, encouraging people to celebrate this warm, comforting color.",
      "category": "Color Celebration",
      "emoji": "🤎",
      "funFact": "Despite being a common color, brown is rarely chosen as a favorite color—yet it's vital in nature from soil to chocolate!"
    },
    {
      "name": "Don't Cry Over Spilled Milk Day",
      "description": "An unofficial day reminding everyone not to waste energy worrying about small mistakes or misfortunes—like spilling milk! Clean up, laugh it off, and move on.",
      "origin": "Inspired by the age-old saying encouraging resilience and optimism during minor setbacks.",
      "category": "Proverb Awareness",
      "emoji": "🥛",
      "funFact": "The phrase 'Don't cry over spilled milk' dates back to at least the 17th century, promoting practical positivity."
    },
    {
      "name": "Clean Out Your Computer Day",
      "description": "A quirky tech holiday encouraging digital spring cleaning. Delete old files, organize folders, and maybe even delete some embarrassing selfies.",
      "origin": "Started by a tech company to promote computer maintenance and reduce digital clutter.",
      "category": "Tech & Productivity",
      "emoji": "🖥️",
      "funFact": "Cleaning your computer’s hard drive can actually speed up its performance and free up valuable space!"
    }
  ]
}