{
  "date": "February 11",
  "holidays": [
    {
      "name": "Make a Friend Day",
      "description": "A perfect day to reach out and make a new friend. Whether in person or online, it's all about kindness and connection!",
      "origin": "The exact origin is unclear, but it’s celebrated as a way to promote social connection and goodwill.",
      "category": "Social/Relationship",
      "emoji": "🤝",
      "funFact": "Studies show making new friends can boost happiness and mental health, so today’s holiday is scientifically proven to be good for you!"
    },
    {
      "name": "National Don’t Cry Over Spilled Milk Day",
      "description": "An unofficial day reminding us not to sweat the small stuff, especially when things go wrong!",
      "origin": "Thought to have originated from the old proverb encouraging people to move on from minor mishaps.",
      "category": "Motivational/Philosophical",
      "emoji": "🥛",
      "funFact": "Spilled milk has been the subject of many idioms, but no one actually cries over it on this day—just laughs!"
    },
    {
      "name": "International Day of Women and Girls in Science",
      "description": "A UN observance celebrating the role of women and girls in science and technology fields.",
      "origin": "Established by the United Nations in 2015 to promote gender equality in STEM.",
      "category": "Awareness/Education",
      "emoji": "🔬",
      "funFact": "Despite growing participation, women still make up less than 30% of researchers worldwide—even with this empowering day!"
    },
    {
      "name": "National Clean Out Your Refrigerator Day",
      "description": "An odd but strangely satisfying day encouraging people to clean and organize their fridges.",
      "origin": "Created by household tips enthusiasts and promoted on social media to encourage food safety and reduce waste.",
      "category": "Household/Organizational",
      "emoji": "🧹",
      "funFact": "Cleaning out your fridge can reduce food waste and even save money—plus the bonus of discovering expired mystery items!"
    }
  ]
}