{
  "date": "February 12",
  "holidays": [
    {
      "name": "Plimsoll Day",
      "description": "Celebrate the safety and science of ships by honoring the Plimsoll Line, a marking on a ship's hull showing the maximum safe loading limit!",
      "origin": "Named after Samuel Plimsoll, a British politician who championed maritime safety laws in the 19th century.",
      "category": "Historical / Safety Awareness",
      "emoji": "🚢",
      "funFact": "Thanks to the Plimsoll Line, overloaded ships are less likely to sink, making maritime travel much safer worldwide."
    },
    {
      "name": "Darwin Day",
      "description": "Celebrate the birth of Charles Darwin and the wonder of evolution and scientific discovery! It's a day to honor science, reason, and the spirit of curiosity.",
      "origin": "Commemorates Charles Darwin's birthday on February 12, 1809.",
      "category": "Science / Education",
      "emoji": "🧬",
      "funFact": "Darwin Day inspires many science museums and educational groups to hold special events promoting biology and understanding of life."
    },
    {
      "name": "Get A Different Name Day",
      "description": "Feeling stuck with your name? This quirky holiday encourages people to think about what it would be like to have a completely different name—unleash your creativity!",
      "origin": "An informal observance encouraging fun and reflection on names and identities.",
      "category": "Fun / Self-Expression",
      "emoji": "🆔",
      "funFact": "Some people use this day to prank friends by pretending to have a new, unusual name for the day!"
    },
    {
      "name": "National Plum Pudding Day",
      "description": "A sweet and spiced celebration of plum pudding—a classic British Christmas dessert enjoyed year-round by dessert aficionados!",
      "origin": "An unofficial food holiday appreciating traditional desserts made with dried fruits and spices.",
      "category": "Food / Dessert",
      "emoji": "🍮",
      "funFact": "Despite its name, plum pudding rarely contains actual plums; the 'plum' traditionally referred to raisins or other dried fruits."
    }
  ]
}