{
  "date": "February 15",
  "holidays": [
    {
      "name": "Singles Awareness Day",
      "description": "A humorous day for single people to celebrate themselves and poke fun at the commercialism of Valentine's Day. It's a lighthearted way to embrace singlehood and maybe indulge in some self-care or fun antics.",
      "origin": "Originating as an ironic counterpart to Valentine's Day, Singles Awareness Day gained popularity with college students and singles communities as a tongue-in-cheek observance.",
      "category": "Pop Culture",
      "emoji": "💁‍♀️",
      "funFact": "Some singles celebrate by exchanging cheeky 'anti-Valentine' cards or hosting parties where the only rule is: no couple talk allowed!"
    },
    {
      "name": "National Gumdrop Day",
      "description": "A sweet celebration dedicated to the colorful, chewy gumdrop candy—perfect for brightening winter days with sugary delight!",
      "origin": "Established in the mid-20th century when candy companies promoted fun food holidays to boost sales during the winter slump.",
      "category": "Food Holiday",
      "emoji": "🍬",
      "funFact": "Gumdrops became wildly popular after the Great Chicago Fire of 1871 because candy makers supplied gumdrops as treats during the city's rebuilding period!"
    },
    {
      "name": "WAFFLE FRIDAY (European Promotion)",
      "description": "While not widely celebrated worldwide, some European countries consider the Friday nearest to February 15 a day to celebrate waffles, much like Belgium's love for this delicious treat.",
      "origin": "Began as a marketing campaign by waffle companies in Europe to boost mid-winter sales and share waffle recipes.",
      "category": "Food Holiday",
      "emoji": "🧇",
      "funFact": "Most European waffle celebrations include competitions to make the craziest waffle topping combinations—think waffles topped with cheese, meats, or even ice cream!"
    },
    {
      "name": "Susan B. Anthony Day",
      "description": "Honors the birthday of Susan B. Anthony, a pivotal leader for women's suffrage and rights in the United States. A day to remember the fight for equality.",
      "origin": "Officially recognized in some U.S. states since 1985 to commemorate Anthony's impact on women's rights and voting laws.",
      "category": "Historical/Awareness",
      "emoji": "👩‍🎓",
      "funFact": "Susan B. Anthony was arrested in 1872 for voting illegally in the presidential election—she refused to pay the fine as a protest!"
    }
  ]
}