{
  "date": "February 18",
  "holidays": [
    {
      "name": "Pet Theft Awareness Day",
      "description": "A day to raise awareness about the rising problem of pet theft and to encourage pet owners to take steps to protect their furry friends.",
      "origin": "Started in the UK by animal welfare groups to spotlight the growing issue of pet thefts and illegal pet sales.",
      "category": "Awareness",
      "emoji": "🐾",
      "funFact": "Pet theft rates tend to spike around Valentine's Day, making mid-February crucial for pet safety vigilance."
    },
    {
      "name": "Battery Day (Not Tesla's)",
      "description": "A quirky salute to the humble battery, celebrating the invention that powers our gadgets and keeps our world ticking.",
      "origin": "Informally recognized by tech enthusiasts to appreciate battery technology innovation, not to be confused with commercial 'Battery Day' events.",
      "category": "Tech Celebration",
      "emoji": "🔋",
      "funFact": "The first electrochemical battery, the Voltaic Pile, was invented in 1800 by Alessandro Volta — the 'volt' is named after him!"
    },
    {
      "name": "National Drink Wine Day (Unofficial)",
      "description": "A perfect reason to swirl, sip, and savor your favorite wine varietal with friends or solo indulgence.",
      "origin": "An informal food and drink holiday celebrated primarily on social media by wine lovers around the world.",
      "category": "Food & Drink",
      "emoji": "🍷",
      "funFact": "Despite its name, the biggest consumption of wine on this day happens in the US, not traditional wine-producing countries."
    },
    {
      "name": "World Pangolin Day (Second Saturday of February, but sometimes observed around this date)",
      "description": "A day dedicated to celebrating and protecting the pangolin, the world's most trafficked mammal, known for its unique scaly armor.",
      "origin": "Created by conservation groups to spotlight pangolin conservation efforts globally.",
      "category": "Awareness/Wildlife",
      "emoji": "🦔",
      "funFact": "Pangolins are the only mammals wholly covered in scales, which they use like armor to protect themselves from predators."
    }
  ]
}