{
  "date": "February 21",
  "holidays": [
    {
      "name": "International Sticky Bun Day",
      "description": "A deliciously sweet day dedicated to enjoying the gooey, cinnamon-swirled treat known as the sticky bun.",
      "origin": "While the exact origins are unclear, sticky buns have been a beloved American pastry since the 18th century, and this quirky day celebrates their mouthwatering glory.",
      "category": "Food",
      "emoji": "🍯",
      "funFact": "Sticky buns were once called 'clover leaf rolls' and sometimes baked with pecans or walnuts for an extra crunch!"
    },
    {
      "name": "Single Tasking Day",
      "description": "Encourages people to ditch multitasking and focus on one task at a time to boost productivity and reduce stress.",
      "origin": "Originated as a mindful productivity movement to combat the modern habit of juggling too many things at once.",
      "category": "Lifestyle & Wellness",
      "emoji": "🧘",
      "funFact": "Studies show single-tasking can increase productivity by 20-40%, but very few people practice it daily!"
    },
    {
      "name": "World Sound Healing Day",
      "description": "A day to honor the healing power of sound and music, promoting therapy through vibrations and frequencies.",
      "origin": "Sound healing has roots in ancient cultures like Tibetan chanting and Aboriginal didgeridoos, and this day celebrates its modern therapeutic revival.",
      "category": "Health & Wellness",
      "emoji": "🎶",
      "funFact": "Certain sound frequencies like 528 Hz are believed to encourage DNA repair and promote well-being!"
    },
    {
      "name": "National Sticky Bun Day",
      "description": "Celebrates the sticky bun, a sweet treat similar to a cinnamon roll but often with nuts and sticky syrup topping.",
      "origin": "Primarily celebrated in the U.S., this day indulges lovers of the gooey pastry on February 21 annually.",
      "category": "Food",
      "emoji": "🥐",
      "funFact": "Sticky buns were so popular during Victorian times that entire cookbooks were dedicated to their luscious variations!"
    }
  ]
}