{
  "date": "February 22",
  "holidays": [
    {
      "name": "National Margarita Day",
      "description": "A day celebrated by enjoying the classic tequila-based cocktail made with lime juice, triple sec, and salt on the rim of the glass. It's a fiesta in every sip!",
      "origin": "Popularized in the US by cocktail enthusiasts and bars to celebrate this beloved drink, especially in festive or wintery months.",
      "category": "Food & Drink",
      "emoji": "🍹",
      "funFact": "The Margarita is said to have been invented accidentally for a customer allergic to many spirits, and has since become one of the most popular cocktails worldwide."
    },
    {
      "name": "World Thinking Day",
      "description": "An international day where Girl Guides and Girl Scouts around the world think about their peers, promote global friendship, and fundraise for worldwide causes.",
      "origin": "Started in 1926 to coincide with the birthday of Lord Baden-Powell and his wife, founders of the scouting movement.",
      "category": "Social Awareness",
      "emoji": "🧠",
      "funFact": "The theme of World Thinking Day changes yearly, focusing on issues like equality, climate, and education that engage young people globally."
    },
    {
      "name": "Be Humble Day",
      "description": "A reminder to get off your high horse and practice humility, appreciating others’ contributions without boasting.",
      "origin": "Unofficial & modern self-improvement observance encouraging personal growth through modesty.",
      "category": "Self-Improvement",
      "emoji": "🙇‍♂️",
      "funFact": "Celebrating humility can actually improve your social relationships and decrease stress — so being humble is being smart!"
    },
    {
      "name": "Conditional Service Day",
      "description": "Commemorates the 1983 Supreme Court ruling that allowed members of the military to receive 'conditional service' status, acknowledging unique service terms.",
      "origin": "Honors a specific legal and military policy evolution in the United States.",
      "category": "History/Military",
      "emoji": "🎖️",
      "funFact": "Conditional Service Day remains obscure but highlights how military laws adapt to changing needs and circumstances."
    }
  ]
}