{
  "date": "February 26",
  "holidays": [
    {
      "name": "National Pistachio Day",
      "description": "A crunchy, nutty holiday celebrating the delicious and versatile pistachio nut. Perfect for snacking, baking, or just enjoying straight from the shell!",
      "origin": "Started as a fun food celebration in the US to highlight pistachios' health benefits and unique flavor.",
      "category": "Food Holiday",
      "emoji": "🥜",
      "funFact": "Pistachios are one of the oldest flowering nut trees and have been enjoyed for over 9,000 years!"
    },
    {
      "name": "Tell a Fairy Tale Day",
      "description": "Celebrate the magic of storytelling by sharing your favorite fairy tales or making up your own whimsical tales.",
      "origin": "An unofficial holiday to encourage creativity and the sharing of folklore across generations.",
      "category": "Literary/Creative Holiday",
      "emoji": "📚",
      "funFact": "Many classic fairy tales, like those by the Brothers Grimm, were first passed down orally before being written down."
    },
    {
      "name": "Don't Cry Over Spilled Milk Day",
      "description": "A quirky encouragement to let go of minor mishaps and not to worry about things that can't be changed – basically, keep your spirits up!",
      "origin": "An informal reminder inspired by the proverb 'Don't cry over spilled milk' promoting positivity.",
      "category": "Motivational/Quirky Holiday",
      "emoji": "🥛",
      "funFact": "The phrase dates back to at least the 17th century, emphasizing practical wisdom."
    },
    {
      "name": "Spay Day USA",
      "description": "A day dedicated to promoting the importance of spaying and neutering pets to control the animal population and prevent homelessness.",
      "origin": "Started by animal welfare groups to raise awareness and encourage responsible pet ownership.",
      "category": "Awareness/Animal Welfare",
      "emoji": "🐾",
      "funFact": "Since its inception, Spay Day USA has helped millions of pets receive spaying/neutering surgeries."
    }
  ]
}