{
  "date": "February 27",
  "holidays": [
    {
      "name": "No Brainer Day",
      "description": "A playful day to celebrate doing things with absolute ease and minimal effort. Perfect for lazy decisions or effortless tasks!",
      "origin": "Originated as an informal observance encouraging people to take it easy and appreciate simple choices in life.",
      "category": "Lifestyle / Fun",
      "emoji": "🤔",
      "funFact": "No Brainer Day is all about celebrating the small victories where complex thinking isn't necessary—like choosing pizza for dinner!"
    },
    {
      "name": "Kahlúa Day",
      "description": "A delicious day dedicated to the coffee-flavored liqueur Kahlúa, popular in cocktails like the White Russian and Black Russian.",
      "origin": "Celebrated by cocktail enthusiasts who appreciate this sweet, coffee-infused spirit.",
      "category": "Food & Drink",
      "emoji": "🍸",
      "funFact": "Kahlúa is a staple ingredient in many famous cocktails and was first created in Veracruz, Mexico in 1936."
    },
    {
      "name": "Public Sleeping Day",
      "description": "A quirky observance encouraging people to not be ashamed of catching some Zzz’s in public places — embrace the power nap!",
      "origin": "Started online among nap enthusiasts who promoted the health benefits of napping anytime, anywhere.",
      "category": "Health & Wellness",
      "emoji": "😴",
      "funFact": "Public Sleeping Day celebrates the fact that some of history’s greatest thinkers took public naps for inspiration."
    },
    {
      "name": "Tooth Fairy Day",
      "description": "A whimsical day to honor the mythical Tooth Fairy who collects children's lost teeth and leaves a surprise under their pillow.",
      "origin": "Celebrating a common childhood tradition prevalent in many cultures, emphasizing the magic of growing up.",
      "category": "Folklore & Family",
      "emoji": "🧚",
      "funFact": "The Tooth Fairy tradition dates back to the early 1900s but was popularized through children’s books and media."
    }
  ]
}