{
  "date": "February 28",
  "holidays": [
    {
      "name": "National Public Sleeping Day",
      "description": "A humorous holiday encouraging people to take a nap anywhere they want — on the bus, in a park, or even at the office (if your boss allows!). It celebrates the art of catching some unexpected Zzzs in public.",
      "origin": "This quirky observance started as an internet meme and social media challenge spreading around the early 2010s, encouraging people to share photos of themselves napping in odd public places.",
      "category": "Quirky / Lifestyle",
      "emoji": "😴",
      "funFact": "In Japan, ‘inemuri’ (sleeping on the job or in public) is actually seen as a sign of diligence rather than laziness!"
    },
    {
      "name": "National Chocolate Soufflé Day",
      "description": "Celebrate the deliciously delicate and airy dessert known as the chocolate soufflé. Perfect day to indulge in some French-inspired baking or enjoy it at a fancy restaurant.",
      "origin": "Chocolate soufflé has been a French culinary classic since the 18th century, but this food day was created by dessert enthusiasts to honor the soufflé’s magical rise and melt-in-your-mouth texture.",
      "category": "Food",
      "emoji": "🍫",
      "funFact": "The word 'soufflé' comes from the French verb 'souffler,' meaning 'to blow' or 'to puff,' which perfectly describes how the dessert rises!"
    },
    {
      "name": "Rare Disease Day (sometimes observed on Feb 28)",
      "description": "A day to raise awareness for rare diseases and advocate for better research, treatment, and support for individuals affected by them. It highlights the challenges faced by people with conditions affecting very few worldwide.",
      "origin": "Established in 2008 by EURORDIS, a European rare disease alliance, February 28 (or 29 in leap years) was chosen to emphasize rarity — just like the date itself!",
      "category": "Awareness",
      "emoji": "🎗️",
      "funFact": "There are over 7,000 known rare diseases, but only a fraction have approved treatments, which is why awareness days like this are vital."
    },
    {
      "name": "Floral Design Day",
      "description": "A celebration of the art and creativity involved in designing floral arrangements, encouraging people to appreciate, create, and gift beautiful bouquets.",
      "origin": "This day originated from floral industry organizations to promote the profession and inspire people to explore floral design as a form of artistic expression.",
      "category": "Art / Hobby",
      "emoji": "💐",
      "funFact": "The oldest known floral arrangement dates back to ancient Egyptian tombs, around 2500 BCE, showing humanity's long love affair with flowers."
    }
  ]
}