{
  "date": "September 5",
  "holidays": [
    {
      "name": "Be Late for Something Day",
      "description": "A quirky day dedicated to giving yourself permission to be fashionably late, procrastinate, or arrive just a few minutes behind schedule without guilt.",
      "origin": "Created in 1988 by an anonymous holiday enthusiast as a humorous reminder to sometimes relax about punctuality and embrace the joy of being late.",
      "category": "Humor/Behavioral",
      "emoji": "⏰",
      "funFact": "It encourages people to break free from their strict schedules and enjoy a little unexpected spontaneity in their day."
    },
    {
      "name": "National Cheese Pizza Day",
      "description": "A delicious celebration honoring the classic cheese pizza, the beloved base for countless toppings and a staple of comfort food worldwide.",
      "origin": "An informal food holiday celebrated mainly in the United States, spotlighting everyone's favorite simple pizza.",
      "category": "Food",
      "emoji": "🍕",
      "funFact": "Cheese pizza is the most ordered type of pizza globally, making this day a cheesy delight for many!"
    },
    {
      "name": "National Textile Day",
      "description": "A day to appreciate the art, science, and industry of textiles — the fabrics and materials woven and knitted into the things we wear and use daily.",
      "origin": "Established to recognize the importance of textiles in culture, fashion, and manufacturing, and the skilled hands behind them.",
      "category": "Industry/Appreciation",
      "emoji": "🧵",
      "funFact": "Textiles have been around for at least 5,000 years, and this day honors that rich history of innovation and creativity."
    },
    {
      "name": "International Day of Charity",
      "description": "A United Nations-observed day dedicated to encouraging charitable giving and voluntary service to alleviate humanitarian crises and poverty.",
      "origin": "Proclaimed by the UN General Assembly in 2012 to raise awareness and inspire people to contribute to social causes worldwide.",
      "category": "Awareness/Charity",
      "emoji": "🤝",
      "funFact": "The date commemorates the anniversary of the death of Mother Teresa, known worldwide for her lifelong charitable work."
    }
  ]
}