{
  "date": "September 7",
  "holidays": [
    {
      "name": "Salami Day",
      "description": "A delicious celebration dedicated to the savory and spicy cured meat we all love: salami! This day invites gourmands to enjoy salami in sandwiches, charcuterie boards, or even on pizza.",
      "origin": "Likely created by meat enthusiasts and foodies to honor a classic deli staple, its exact origin is unknown but it’s celebrated mostly in the US.",
      "category": "Food Holiday",
      "emoji": "🥪",
      "funFact": "Salami was originally made by Italian farmers as a way to preserve meat for winter months using fermentation and curing."
    },
    {
      "name": "International Day of Clean Air for Blue Skies",
      "description": "An important environmental awareness day dedicated to improving air quality worldwide and protecting human health by promoting cleaner air policies and lifestyles.",
      "origin": "Established by the United Nations General Assembly in 2019 to address growing global air pollution issues.",
      "category": "Awareness Day",
      "emoji": "🌍",
      "funFact": "Breathing polluted air is responsible for an estimated 7 million premature deaths globally every year."
    },
    {
      "name": "Street Music Day",
      "description": "A lively celebration of musicians bringing their tunes to the streets, filling public spaces with entertaining performances and spontaneous concerts.",
      "origin": "Started by street performers and supporters of local music culture to highlight the art of busking and free public music.",
      "category": "Pop Culture/Music",
      "emoji": "🎸",
      "funFact": "Busking has been a tradition since ancient times, believed to date back to Ancient Greece and Rome."
    },
    {
      "name": "National Salami Day (United States)",
      "description": "Another tasty nod specifically in the US recognizing salami as a beloved deli meat for sandwiches, snacks, and culinary creativity.",
      "origin": "An unofficial food holiday embraced by American sandwich shops and meat lovers everywhere.",
      "category": "Food Holiday",
      "emoji": "🥯",
      "funFact": "The word 'salami' comes from the Italian word 'salare,' meaning 'to salt,' an essential step in preserving the meat."
    }
  ]
}