{
  "date": "September 8",
  "holidays": [
    {
      "name": "International Literacy Day 📚",
      "description": "A day to celebrate the importance of literacy as a matter of dignity and human rights.",
      "origin": "Established by UNESCO in 1966 to raise awareness about illiteracy around the world.",
      "category": "Awareness Day",
      "emoji": "📚",
      "funFact": "Despite its serious theme, some communities hold quirky 'read-a-thons' dressed as their favorite book characters to make literacy fun!"
    },
    {
      "name": "National Ampersand Day &",
      "description": "A celebration of the humble ampersand (&) symbol, honoring its quirky charm and historical importance in written language.",
      "origin": "Originated informally among typophiles and graphic designers appreciating this unique character.",
      "category": "Pop Culture/Letter Appreciation",
      "emoji": "&",
      "funFact": "The ampersand was originally a ligature of the letters 'e' and 't' (Latin for 'and'), making it literally a blend of two letters!"
    },
    {
      "name": "No Rhyme (Nor Reason) Day 🤪",
      "description": "A day to embrace silliness and do things without rhyme or reason, breaking free from logic and routine.",
      "origin": "Began as a lighthearted internet meme turned unofficial holiday encouraging quirky spontaneity.",
      "category": "Quirky/Fun",
      "emoji": "🤪",
      "funFact": "People often try to speak in nonsensical rhymes or tell bizarre stories that make absolutely no sense at all on this day!"
    },
    {
      "name": "Salami Day 🥪",
      "description": "A delicious day dedicated to celebrating salami, the cured sausage beloved worldwide.",
      "origin": "Unofficial food holiday from the US food enthusiast community, spotlighting versatile deli meats.",
      "category": "Food Holiday",
      "emoji": "🥪",
      "funFact": "Salami is derived from the Italian word 'salare,' meaning 'to salt,' and this day often inspires creative sandwich recipes featuring the spicy sausage!"
    }
  ]
}