{
  "date": "September 9",
  "holidays": [
    {
      "name": "National Teddy Bear Day",
      "description": "A day to celebrate the beloved stuffed animal, the teddy bear, and its cuddly comfort.",
      "origin": "Created to honor the teddy bear, named after U.S. President Theodore 'Teddy' Roosevelt, inspired by a 1902 hunting trip story.",
      "category": "Pop Culture / Toys 🧸",
      "emoji": "🧸",
      "funFact": "The teddy bear was supposedly invented independently by Morris Michtom in the U.S. and Richard Steiff in Germany around the same time."
    },
    {
      "name": "International Sudoku Day",
      "description": "A celebration for puzzle lovers to enjoy the logic game Sudoku, sharpening minds worldwide.",
      "origin": "Sudoku became popular globally in the early 2000s, though its roots trace back to 18th-century Swiss mathematician Leonhard Euler's Latin squares.",
      "category": "Games / Puzzles 🧩",
      "emoji": "🧩",
      "funFact": "The first Sudoku puzzles were published in Japan in the 1980s, and the name Sudoku means 'single number' in Japanese."
    },
    {
      "name": "Wonderful Weirdos Day",
      "description": "A day to appreciate and celebrate all the wonderfully weird, extraordinary, quirky people who make life more interesting.",
      "origin": "An unofficial modern observance started on social media to embrace individuality and uniqueness.",
      "category": "Awareness / Self-expression 🦄",
      "emoji": "🦄",
      "funFact": "People celebrate Wonderful Weirdos Day by sharing stories or photos of their quirkiest habits or hobbies."
    },
    {
      "name": "National Chow Mein Day",
      "description": "A tasty day dedicated to enjoying the crisp and savory flavors of chow mein noodles.",
      "origin": "Chow mein, a Chinese-American dish, became popular in the U.S. in the early 20th century as Chinese immigrants adapted traditional recipes.",
      "category": "Food / Cuisine 🍜",
      "emoji": "🍜",
      "funFact": "The term 'chow mein' literally means 'fried noodles' in Cantonese."
    }
  ]
}