{
  "date": "September 12",
  "holidays": [
    {
      "name": "National Video Games Day",
      "description": "A day to celebrate the world of video games and the joy they bring to players of all ages.",
      "origin": "Originating in the early 2000s as gaming became mainstream, this day honors the creativity and fun of video games.",
      "category": "Pop Culture",
      "emoji": "🎮",
      "funFact": "The best-selling video game of all time, Minecraft, has sold over 200 million copies worldwide!"
    },
    {
      "name": "Chocolate Milkshake Day",
      "description": "A delicious day dedicated to enjoying the creamy, sweet treat of chocolate milkshakes!",
      "origin": "An unofficial food holiday created by aficionados of this classic dessert drink.",
      "category": "Food",
      "emoji": "🥤",
      "funFact": "The first ice cream milkshake, similar to what we know today, dates back to the early 20th century and was originally an alcoholic eggnog!"
    },
    {
      "name": "National Pet Memorial Day",
      "description": "A day to honor and remember the beloved pets who have passed away and the joy they brought to our lives.",
      "origin": "Established in 2000 in the United States to give pet owners a chance to celebrate the lives of their furry friends.",
      "category": "Awareness",
      "emoji": "🐾",
      "funFact": "Studies show that talking about deceased pets and holding memorials can help pet owners with the grieving process."
    },
    {
      "name": "Defy Superstition Day",
      "description": "Encourages people to face their irrational fears and break free from superstitious beliefs, like walking under ladders or breaking mirrors.",
      "origin": "An unofficial quirky observance that gained traction via social media as a positive and humorous reminder to challenge unfounded fears.",
      "category": "Quirky",
      "emoji": "🧙‍♂️",
      "funFact": "Many common superstitions, such as Friday the 13th being unlucky, have no basis in reality but continue to influence behavior worldwide."
    }
  ]
}