{
  "date": "September 13",
  "holidays": [
    {
      "name": "International Chocolate Day",
      "description": "A delightful day dedicated to indulging in the world's most beloved sweet treat: chocolate! Perfect excuse to eat as much chocolate as you like without guilt.",
      "origin": "Though no single origin story exists, this day celebrates the widespread love for chocolate and its global cultural significance.",
      "category": "Food",
      "emoji": "🍫",
      "funFact": "Chocolate was once used as currency by the ancient Aztecs!"
    },
    {
      "name": "Positive Thinking Day",
      "description": "A quirky holiday encouraging everyone to think positively, spread good vibes, and look on the bright side of life.",
      "origin": "Founded by Christian D. Larson, a New Thought leader, to promote optimism and the power of positive thinking.",
      "category": "Awareness",
      "emoji": "🙂",
      "funFact": "Studies show that positive thinking can actually improve your physical health!"
    },
    {
      "name": "Defy Superstition Day",
      "description": "A fun, rebellious day challenging common superstitions—walk under ladders, open umbrellas indoors, break mirrors, and laugh in the face of bad luck!",
      "origin": "Started by skeptics and lovers of superstition lore as a way to poke fun at irrational fears.",
      "category": "Pop Culture / Humor",
      "emoji": "🧙‍♂️",
      "funFact": "The fear of the number 13 is so strong, there's a term for it: triskaidekaphobia."
    },
    {
      "name": "Hugging Day",
      "description": "An unofficial but warm-hearted day dedicated to sharing hugs with friends, family, or even strangers to boost happiness and reduce stress.",
      "origin": "Emerging from various 'hug therapy' and mental health awareness movements promoting the power of physical touch.",
      "category": "Health & Wellness",
      "emoji": "🤗",
      "funFact": "A single hug can release oxytocin, known as the 'love hormone,' that helps reduce stress and create bonds."
    }
  ]
}