{
  "date": "September 14",
  "holidays": [
    {
      "name": "National Cream-Filled Donut Day",
      "description": "A delightful day dedicated to celebrating those irresistible donuts filled with creamy goodness inside, from vanilla custard to chocolate cream!",
      "origin": "This day is celebrated informally by donut lovers and bakeries across the U.S., though no official proclamation exists; it's a sweet excuse to indulge!",
      "category": "Food",
      "emoji": "🍩",
      "funFact": "Cream-filled donuts were originally popularized in the early 20th century as a luxurious pastry treat, making today the perfect excuse to embrace sweet decadence."
    },
    {
      "name": "National Coloring Day",
      "description": "A day encouraging people of all ages to break out the crayons, colored pencils, or markers and get creative with coloring for relaxation and fun.",
      "origin": "Founded by the Crayola company to celebrate creativity, mindfulness, and art in a simple, fun way.",
      "category": "Arts & Culture",
      "emoji": "🎨",
      "funFact": "Coloring isn’t just for kids — it’s known to reduce stress and anxiety in adults, making this a bizarrely therapeutic holiday!"
    },
    {
      "name": "Eat an Extra Dessert Day",
      "description": "The perfect excuse to toss dietary rules out the window and enjoy an additional dessert after your usual meal — no guilt allowed!",
      "origin": "This unofficial, food-themed holiday became popular on social media as a fun way to 'reward' oneself mid-September.",
      "category": "Food",
      "emoji": "🍰",
      "funFact": "Studies show that a little indulgence now and then can boost mood and satisfaction, so this holiday might actually be good for you!"
    },
    {
      "name": "Pokémon Day (International, celebrated on different days but some fans mark it mid-September)",
      "description": "While official Pokémon Day is February 27, some fans celebrate their own Pokémon themed days throughout the year, including September 14, in honor of game releases or events.",
      "origin": "Created by Pokémon fans globally to celebrate the beloved game, anime, and trading card franchise.",
      "category": "Pop Culture",
      "emoji": "🎮",
      "funFact": "Pokémon was inspired by creator Satoshi Tajiri’s childhood love of collecting creatures and exploring nature — a passion that sparked a worldwide craze!"
    }
  ]
}