{
  "date": "September 15",
  "holidays": [
    {
      "name": "International Dot Day",
      "description": "A creative celebration inspired by a children's book encouraging people to embrace their creativity and courage through making marks and 'dots.'",
      "origin": "Based on Peter H. Reynolds's book 'The Dot,' International Dot Day started in 2009 as a way to encourage creativity and self-expression in schools worldwide.",
      "category": "Creativity & Education",
      "emoji": "🎨",
      "funFact": "Schools in over 185 countries participate each year by creating art projects and sharing their 'dots' online!"
    },
    {
      "name": "National Double Cheeseburger Day",
      "description": "A delicious day dedicated to celebrating the mouthwatering joy of double cheeseburgers piled high with cheese and patties.",
      "origin": "Created by burger lovers and popularized by food enthusiasts, this day is unofficial but widely recognized by burger joints and fans alike.",
      "category": "Food Holiday",
      "emoji": "🍔",
      "funFact": "The first known double cheeseburger dates back to the 1930s, making this indulgent treat nearly a century old!"
    },
    {
      "name": "International Day of Democracy",
      "description": "An observance dedicated to promoting and upholding the principles of democracy around the globe, highlighting the importance of citizen participation and human rights.",
      "origin": "Established by the United Nations in 2007 to encourage awareness and respect for democratic processes worldwide.",
      "category": "Awareness & Social Justice",
      "emoji": "🗳️",
      "funFact": "This day is marked by events like debates, discussions, and voting awareness campaigns globally."
    },
    {
      "name": "Engineering Week (start)",
      "description": "Some regions kick off a week-long celebration of engineering achievements starting on this date, honoring innovators and inspiring future engineers.",
      "origin": "Various engineering societies and institutions organize events during this week to boost STEM education and celebrate engineering milestones.",
      "category": "STEM & Education",
      "emoji": "🛠️",
      "funFact": "Engineering Week often features challenges that have participants build bridges from unusual materials or design Rube Goldberg machines!"
    }
  ]
}