{
  "date": "September 16",
  "holidays": [
    {
      "name": "Collect Rocks Day",
      "description": "A day dedicated to appreciating the humble, fascinating world of rocks. Whether you’re a serious collector or just like skipping stones, today is all about rocks!",
      "origin": "Unknown origin, likely started by rock enthusiasts to celebrate geology and nature’s sculptures.",
      "category": "Nature & Hobby",
      "emoji": "🪨",
      "funFact": "Some rocks have their own names and fan clubs, like the famous Half Dome in Yosemite or the Glossopteris fossil rocks."
    },
    {
      "name": "International Chocolate Milkshake Day",
      "description": "Celebrate the classic indulgence that is the chocolate milkshake — creamy, chocolaty, and utterly delightful!",
      "origin": "Originated in the U.S. as a fun day for milkshake enthusiasts and diners alike to enjoy this sweet treat.",
      "category": "Food & Drink",
      "emoji": "🥤",
      "funFact": "The first milkshakes date back to the 1880s, originally as alcoholic whiskey drinks before evolving into the kid-friendly classic drink."
    },
    {
      "name": "Mexican Independence Day",
      "description": "A vibrant celebration marking Mexico’s independence from Spain in 1810, featuring parades, music, dancing, and fireworks!",
      "origin": "Commemorates the 'Grito de Dolores' by Miguel Hidalgo, the call to arms that started the Mexican War of Independence.",
      "category": "National & Cultural",
      "emoji": "🇲🇽",
      "funFact": "The celebrations officially begin on the night of September 15 with 'El Grito,' where the president reenacts Hidalgo’s call from the balcony of the National Palace in Mexico City."
    },
    {
      "name": "Play-Doh Day",
      "description": "Honoring the iconic modeling compound that has inspired creativity and messy fun for generations of kids and adults alike.",
      "origin": "Celebrated on September 16 because Play-Doh was first trademarked in 1956 on this day.",
      "category": "Pop Culture & Toys",
      "emoji": "🎨",
      "funFact": "Play-Doh was originally created as a wallpaper cleaner before kids discovered it as a modeling clay!"
    }
  ]
}