{
  "date": "September 20",
  "holidays": [
    {
      "name": "International Talk Like a Pirate Day",
      "description": "A playful celebration encouraging people worldwide to talk like pirates, using phrases like 'Ahoy!' and 'Avast!' to bring out their inner buccaneer.",
      "origin": "Created in 1995 by friends John Baur and Mark Summers as a fun inside joke, which then went viral and became an internationally recognized quirky holiday.",
      "category": "Pop Culture Fun",
      "emoji": "🏴‍☠️",
      "funFact": "This holiday inspired pirate-themed events in bars, schools, and even software updates that add pirate speak!"
    },
    {
      "name": "National Pepperoni Pizza Day",
      "description": "A delicious tribute to the most popular pizza topping—pepperoni! Perfect excuse to enjoy a cheesy, spicy slice (or three).",
      "origin": "An unofficial food holiday celebrated by pizza lovers to honor their favorite topping, with no specific founding date but gaining traction in food communities.",
      "category": "Food Celebration",
      "emoji": "🍕",
      "funFact": "Pepperoni is the most requested pizza topping in the United States, edging out mushrooms and sausage."
    },
    {
      "name": "National Hunting and Fishing Day (USA)",
      "description": "A day dedicated to appreciating and promoting ethical hunting and fishing activities and outdoor sportsmanship.",
      "origin": "Established by the United States Congress in 1972 to recognize the contributions of hunters and fishermen to wildlife conservation.",
      "category": "Awareness/Outdoor Sports",
      "emoji": "🎣",
      "funFact": "Hunters and anglers contribute billions to wildlife and habitat conservation efforts annually through license fees and taxes."
    },
    {
      "name": "Coombe Fish Festival (Cornwall, UK)",
      "description": "A quirky, fish-themed local festival in a small Cornish village celebrating fishing traditions with games and seafood tastings.",
      "origin": "Centuries-old village festival rooted in fishing culture, evolving into a quirky community event each September.",
      "category": "Local Cultural Festival",
      "emoji": "🐟",
      "funFact": "Some festival games include 'wet fish throwing' contests to see who can toss fresh fish the farthest!"
    }
  ]
}