{
  "date": "September 21",
  "holidays": [
    {
      "name": "International Day of Peace",
      "description": "A day dedicated to promoting peace among nations and peoples, encouraging ceasefires and non-violence worldwide.",
      "origin": "Established by the United Nations in 1981 to promote peace and end violence internationally.",
      "category": "Awareness Day",
      "emoji": "☮️",
      "funFact": "On this day, many people release doves or participate in peace ceremonies, and some airports even halt all activities for a minute of silence."
    },
    {
      "name": "Miniature Golf Day",
      "description": "Celebrate the quirky fun of miniature golf, a whimsical twist on regular golf with creative obstacle courses!",
      "origin": "Began as a popular unofficial day among mini-golf enthusiasts to celebrate putting and silly courses.",
      "category": "Fun/Food",
      "emoji": "⛳️",
      "funFact": "The first miniature golf course was created in 1916 and was known as 'Tom Thumb Golf'—after the famous fairy tale character!"
    },
    {
      "name": "World Rhino Day",
      "description": "An awareness day focused on protecting rhinos and their habitats from poaching and extinction.",
      "origin": "Started in 2010 by the World Wildlife Fund to highlight rhino conservation efforts globally.",
      "category": "Awareness Day",
      "emoji": "🦏",
      "funFact": "Only five species of rhinos exist today, and they are critically endangered due to poaching for their horns."
    },
    {
      "name": "Proud To Be Polish Day",
      "description": "A celebration of Polish heritage, culture, and pride by people of Polish descent around the world.",
      "origin": "An unofficial day embraced by Polish communities worldwide to honor their roots and traditions.",
      "category": "Cultural",
      "emoji": "🇵🇱",
      "funFact": "Poland is home to the world’s biggest castle, Malbork Castle, built entirely of bricks and dating back to the 13th century!"
    }
  ]
}