{
  "date": "September 23",
  "holidays": [
    {
      "name": "Celebrate Bisexuality Day",
      "description": "A day to recognize and celebrate the bisexual community, their history, and contributions to LGBTQ+ culture.",
      "origin": "Started in 1999 by three bisexual rights activists to increase visibility and acceptance.",
      "category": "Awareness",
      "emoji": "🏳️‍🌈",
      "funFact": "The official color of bisexuality is a unique pink, purple, and blue flag designed in 1998."
    },
    {
      "name": "National Snack Stick Day",
      "description": "A delicious day dedicated to celebrating snack sticks — those flavorful, portable meat treats perfect for on-the-go munching.",
      "origin": "Food enthusiasts created this day to honor snack sticks as a convenient and tasty snack option.",
      "category": "Food",
      "emoji": "🥓",
      "funFact": "Snack sticks originated from carnitas-style sausage recipes and became popular in American snack aisles in the 20th century."
    },
    {
      "name": "Autumnal Equinox / Mabon (Pagan Holiday)",
      "description": "Marking the balance of day and night, Mabon is a pagan festival celebrating the second harvest and giving thanks.",
      "origin": "Rooted in ancient nature-based religions, Mabon honors the changing seasons and bounty of fall.",
      "category": "Seasonal/Pagan",
      "emoji": "🍂",
      "funFact": "Mabon is named after a Welsh mythological figure, Mabon ap Modron, known as a divine youth."
    },
    {
      "name": "International Podcast Day",
      "description": "A global day celebrating the incredible world of podcasts — from storytelling and education to comedy and investigative journalism.",
      "origin": "Created by podcast enthusiasts in 2014 to raise awareness of podcasts worldwide.",
      "category": "Pop Culture",
      "emoji": "🎙️",
      "funFact": "There are over 2 million podcasts available worldwide, with new episodes published daily on every imaginable topic."
    }
  ]
}