{
  "date": "September 24",
  "holidays": [
    {
      "name": "National Punctuation Day",
      "description": "A quirky celebration dedicated to the little marks that make our writing clear and fun, like commas, semicolons, and exclamation points! It encourages people to appreciate and correctly use punctuation in their everyday writing.",
      "origin": "Created in 2004 by author and punctuation enthusiast Jeff Rubin to spread awareness about the importance of punctuation in written communication.",
      "category": "Language & Literature",
      "emoji": "✍️",
      "funFact": "Some fans of National Punctuation Day practice daring feats like debating the Oxford comma or correcting street signs on this day!"
    },
    {
      "name": "Talk Like a Pirate Day",
      "description": "An unofficial holiday where everyone is encouraged to speak and dress like a pirate, complete with 'Arrr!' and 'Ahoy, matey!'",
      "origin": "Started as a joke in 1995 by friends John Baur and Mark Summers, it quickly became an international phenomenon celebrated by pirates and landlubbers alike.",
      "category": "Pop Culture & Fun",
      "emoji": "🏴‍☠️",
      "funFact": "Even cruise lines and restaurants join in by hosting pirate-themed events, and some people increase their pirate vocabulary just for this day!"
    },
    {
      "name": "National Cherries Jubilee Day",
      "description": "A deliciously flamboyant day to honor the classic dessert made with cherries and liqueur, flambéed and served over ice cream!",
      "origin": "Named after Chef Auguste Escoffier's famous creation, this day celebrates the sweet, fiery treat enjoyed since the early 20th century.",
      "category": "Food & Drink",
      "emoji": "🍒",
      "funFact": "The dramatic flaming of the cherries is a crowd-pleaser — and the dessert was reportedly a favorite of Queen Victoria!"
    },
    {
      "name": "World Rivers Day",
      "description": "A global celebration to highlight the importance of rivers in ecology, culture, and economy, promoting conservation and sustainable use.",
      "origin": "Established in 2005 by the Global Rivers Environmental Education Network, it's held every fourth Sunday of September but is often observed on the 24th when that coincides.",
      "category": "Environmental Awareness",
      "emoji": "🌊",
      "funFact": "Events include river cleanups, educational talks, and even canoe races, turning friendly competition into river stewardship!"
    }
  ]
}