{
  "date": "September 26",
  "holidays": [
    {
      "name": "Johnny Appleseed Day",
      "description": "This day celebrates the legendary American pioneer nurseryman Johnny Appleseed, known for planting apple trees across the United States.",
      "origin": "Inspired by John Chapman, an early 19th-century folk hero who became famous for his generous spirit and apple orchards.",
      "category": "Historical/Folklore",
      "emoji": "🍎",
      "funFact": "Johnny Appleseed didn’t just plant apple trees for fun — apples were used to make hard cider, which was often safer to drink than water back then!"
    },
    {
      "name": "National Dumpling Day (USA)",
      "description": "A day to savor the delicious, doughy, and often meat- or veggie-filled delights known as dumplings, celebrated especially in American food culture.",
      "origin": "An unofficial food holiday created by food enthusiasts to appreciate diverse culinary traditions involving dumplings.",
      "category": "Food",
      "emoji": "🥟",
      "funFact": "Dumplings come in so many forms worldwide — from Japanese gyoza to Polish pierogi — and each has its own unique twist!"
    },
    {
      "name": "European Day of Languages",
      "description": "A day dedicated to promoting language learning and cultural diversity across Europe and beyond.",
      "origin": "Established by the Council of Europe in 2001 to encourage lifelong language education and celebrate Europe’s rich linguistic heritage.",
      "category": "Awareness/Culture",
      "emoji": "🌍",
      "funFact": "Europe has around 225 indigenous languages, making it one of the most linguistically diverse regions on Earth!"
    },
    {
      "name": "Love Note Day",
      "description": "A sweet, often secret holiday encouraging people to write love notes or heartfelt messages to someone special, spreading affection in simple, old-fashioned ways.",
      "origin": "An unofficial day that caught traction with romantics and stationary lovers who enjoy handwritten notes.",
      "category": "Pop Culture/Romance",
      "emoji": "💌",
      "funFact": "Before phones and texts, love notes were the original emojis — and way more romantic!"
    }
  ]
}