{
  "date": "September 27",
  "holidays": [
    {
      "name": "Crush a Can Day",
      "description": "A day dedicated to the simple yet satisfying act of crushing an empty can. Perfect for venting stress or just enjoying a little hands-on fun!",
      "origin": "Started as an informal environmental awareness stunt encouraging recycling and minimizing trash volume.",
      "category": "Environmental/Quirky",
      "emoji": "🗑️",
      "funFact": "Despite its silliness, crushing cans saves significant landfill space and is surprisingly therapeutic for many!"
    },
    {
      "name": "Chocolate Milkshake Day",
      "description": "Celebrate one of the most delicious and refreshing beverages by enjoying a rich, creamy chocolate milkshake.",
      "origin": "A classic American treat day that grew from diner culture and the rise of soda fountains in the early 20th century.",
      "category": "Food",
      "emoji": "🥤",
      "funFact": "The first chocolate milkshake is said to have been invented in the early 1900s, long before blenders existed — bartenders used shakers!"
    },
    {
      "name": "National Corned Beef Hash Day",
      "description": "A day to savor the hearty breakfast favorite of corned beef, potatoes, and onions all fried up to golden perfection.",
      "origin": "Derived from traditional Irish-American cuisine, celebrated mainly in the US.",
      "category": "Food",
      "emoji": "🍳",
      "funFact": "Corned beef hash was a popular way for Irish immigrants to stretch costly meat with inexpensive potatoes, creating a beloved dish!"
    },
    {
      "name": "World Tourism Day",
      "description": "An international observance promoting the importance of tourism and its social, cultural, political, and economic value worldwide.",
      "origin": "Established by the United Nations World Tourism Organization in 1980.",
      "category": "Awareness",
      "emoji": "🌍",
      "funFact": "Each year, World Tourism Day highlights a different theme; in recent years it has focused on sustainable and accessible tourism."
    }
  ]
}