{
  "date": "September 28",
  "holidays": [
    {
      "name": "Ask a Stupid Question Day",
      "description": "A day encouraging people to ask questions, no matter how silly they seem, fostering curiosity and learning without fear of judgment.",
      "origin": "Started in 1986 by teachers in the United States to encourage students to speak up and remove the stigma around 'stupid' questions.",
      "category": "Education / Fun",
      "emoji": "❓",
      "funFact": "Teachers observe that students often learn best when they feel safe enough to ask any question, and this day celebrates that spirit of curiosity."
    },
    {
      "name": "National Skyscraper Day",
      "description": "An ode to the architectural marvels piercing the sky, celebrating human ingenuity in building tall structures that define city skylines worldwide.",
      "origin": "Established to honor the first skyscraper built in Chicago in 1885, marking a turning point in architecture.",
      "category": "Architecture / History",
      "emoji": "🏙️",
      "funFact": "The first skyscraper, the Home Insurance Building in Chicago, was only 10 stories tall but revolutionized building design with its steel frame."
    },
    {
      "name": "National Good Neighbor Day",
      "description": "A reminder to appreciate and foster community spirit by being kind and helpful to neighbors near and far.",
      "origin": "Proclaimed in 1978 by President Jimmy Carter to promote neighborly relations and community cooperation.",
      "category": "Community / Social Awareness",
      "emoji": "🤝",
      "funFact": "Some towns celebrate this day with block parties and communal meals, strengthening neighborhood bonds."
    },
    {
      "name": "Eat an Extra Dessert Day",
      "description": "An unofficial but deliciously popular holiday that gives everyone permission to indulge in an extra sweet treat without guilt.",
      "origin": "Popularized in internet culture and food communities as a fun, excuse-to-splurge day.",
      "category": "Food / Fun",
      "emoji": "🍰",
      "funFact": "Dessert lovers worldwide celebrate by sharing photos of their favorite extra-helping sweets on social media."
    }
  ]
}