{
  "date": "September 29",
  "holidays": [
    {
      "name": "International Coffee Day ☕",
      "description": "A day to celebrate the beloved brew that kickstarts mornings worldwide and fuels countless late nights.",
      "origin": "Started in Japan in 1983 and officially recognized by the International Coffee Organization in 2015 to promote coffee growers and the coffee trade.",
      "category": "Food & Drink",
      "emoji": "☕",
      "funFact": "On International Coffee Day, many cafes offer free or discounted coffee to celebrate the bean!"
    },
    {
      "name": "National Comic Book Day 📚",
      "description": "A celebration of comic books and graphic novels that bring heroes, villains, and fantastic tales to life in colorful panels.",
      "origin": "Originated in the USA to honor the rich history and influence of comic books in pop culture.",
      "category": "Pop Culture",
      "emoji": "📚",
      "funFact": "The first modern comic book is often credited to 'Action Comics #1,' which introduced Superman in 1938."
    },
    {
      "name": "World Heart Day ❤️",
      "description": "An awareness day dedicated to raising awareness about cardiovascular diseases and promoting heart-healthy living worldwide.",
      "origin": "Established by the World Heart Federation in 2000 to encourage preventive measures against heart disease.",
      "category": "Health Awareness",
      "emoji": "❤️",
      "funFact": "Heart disease is the leading cause of death globally, making this day crucial for spreading life-saving information."
    },
    {
      "name": "Confucius Day 🧧",
      "description": "A day to honor Confucius, the ancient Chinese philosopher known for his teachings on ethics, proper social relationships, and justice.",
      "origin": "Celebrated on Confucius's birthday (traditionally September 28 or 29) mainly in East Asian cultures.",
      "category": "Philosophy & Culture",
      "emoji": "🧧",
      "funFact": "Confucius's ideas have influenced education and government in East Asia for over two millennia."
    }
  ]
}