{
  "date": "2024-09-02",
  "plants": [
    {
      "name": "Helianthus annuus",
      "commonName": "Sunflower",
      "description": "Sunflowers are tall annual plants known for their large, bright yellow flower heads that track the sun across the sky. They are native to North America and commonly bloom late summer into early fall.",
      "bloomingSeason": "July to September",
      "location": "Temperate regions, especially North America and Europe",
      "colors": [
        "yellow"
      ],
      "emoji": "🌻",
      "funFact": "Sunflowers exhibit heliotropism, turning their blooms to follow the sun's movement during the day."
    },
    {
      "name": "Camellia japonica",
      "commonName": "Japanese Camellia",
      "description": "An evergreen shrub or small tree prized for its large, rose-like flowers which bloom in late winter through fall depending on cultivar and region.",
      "bloomingSeason": "September to April (varies by variety and climate)",
      "location": "East Asia and cultivated worldwide in mild climates",
      "colors": [
        "red",
        "pink",
        "white"
      ],
      "emoji": "🌺",
      "funFact": "Camellias are closely related to the tea plant, Camellia sinensis, whose leaves are used to make traditional tea."
    },
    {
      "name": "Hibiscus rosa-sinensis",
      "commonName": "Chinese Hibiscus",
      "description": "A tropical shrub with large, showy flowers that bloom year-round in warm climates, peaking in late summer to early fall.",
      "bloomingSeason": "Year-round in tropical climates, including September",
      "location": "Tropical and subtropical regions worldwide",
      "colors": [
        "red",
        "yellow",
        "pink",
        "orange",
        "white"
      ],
      "emoji": "🌺",
      "funFact": "Hibiscus flowers are often used to make herbal teas and natural dyes."
    },
    {
      "name": "Aster amellus",
      "commonName": "European Michaelmas Daisy",
      "description": "A perennial wildflower native to Europe, known for its star-shaped floral heads and late blooming in late summer to fall.",
      "bloomingSeason": "August to October",
      "location": "Temperate Europe",
      "colors": [
        "purple",
        "pink",
        "white"
      ],
      "emoji": "💜",
      "funFact": "Michaelmas daisies signal the approach of Michaelmas, a traditional autumn festival around September 29th."
    }
  ]
}