{
  "date": "September 6",
  "plants": [
    {
      "name": "Aster amellus",
      "commonName": "European Michaelmas Daisy",
      "description": "Aster amellus is a perennial wildflower native to Europe, known for its daisy-like flowers with vibrant purple petals and yellow centers. It thrives in temperate climates and blooms in late summer to early autumn, attracting pollinators such as bees and butterflies.",
      "bloomingSeason": "August to October",
      "location": "Europe, temperate regions",
      "colors": [
        "purple",
        "yellow"
      ],
      "emoji": "🌸",
      "funFact": "Michaelmas daisies are often associated with the feast of St. Michael (Michaelmas) on September 29, marking the transition to autumn."
    },
    {
      "name": "Rudbeckia hirta",
      "commonName": "Black-eyed Susan",
      "description": "Rudbeckia hirta is a North American native wildflower famous for its bright yellow petals and dark brown central cones. It thrives in a variety of habitats including prairies and roadsides, blooming from mid-summer into early fall and providing valuable nectar to insects.",
      "bloomingSeason": "June to September",
      "location": "North America",
      "colors": [
        "yellow",
        "brown"
      ],
      "emoji": "🌻",
      "funFact": "Black-eyed Susans can reseed themselves abundantly, making them a staple in wildflower mixes and native plant gardens."
    },
    {
      "name": "Hibiscus rosa-sinensis",
      "commonName": "Chinese Hibiscus",
      "description": "A tropical shrub widely cultivated in warm climates, known for its large, showy flowers with overlapping petals that come in various colors including red, pink, orange, and white. It blooms year-round in frost-free areas, including September, and attracts hummingbirds and butterflies.",
      "bloomingSeason": "Year-round in tropical/subtropical areas",
      "location": "Tropical and subtropical regions worldwide",
      "colors": [
        "red",
        "pink",
        "orange",
        "white"
      ],
      "emoji": "🌺",
      "funFact": "Hibiscus flowers open in the morning and usually wilt by the evening, lasting only a day but opening anew daily during blooming seasons."
    },
    {
      "name": "Solidago canadensis",
      "commonName": "Canada Goldenrod",
      "description": "A late summer to autumn blooming perennial native to North America, characterized by clusters of small, bright yellow flowers that form plume-like heads. Goldenrod often grows in meadows and along roadsides, and it plays a vital role in supporting pollinators late in the growing season.",
      "bloomingSeason": "August to November",
      "location": "North America",
      "colors": [
        "yellow"
      ],
      "emoji": "🌼",
      "funFact": "Despite common misconceptions, goldenrod is not a major cause of hay fever; ragweed pollen, which blooms at the same time, is usually responsible."
    }
  ]
}