{
  "date": "September 7",
  "plants": [
    {
      "name": "Aster amellus",
      "commonName": "European Michaelmas Daisy",
      "description": "A perennial herb native to Europe, known for its star-shaped purple or blue flowers that bloom abundantly in late summer to early autumn. It attracts butterflies and bees and is often used in ornamental gardens.",
      "bloomingSeason": "August to October",
      "location": "Europe, cultivated worldwide",
      "colors": [
        "purple",
        "blue"
      ],
      "emoji": "🌸",
      "funFact": "The name 'Michaelmas Daisy' comes from its peak blooming around the feast of St. Michael (September 29)."
    },
    {
      "name": "Erythrina crista-galli",
      "commonName": "Cockspur Coral Tree",
      "description": "A striking small tree native to South America producing vibrant red, bird-attracting flowers with unique shapes resembling a rooster's crest. It blooms primarily in late winter to early spring in the Southern Hemisphere but can bloom into September in some subtropical climates.",
      "bloomingSeason": "August to September",
      "location": "South America (Argentina, Uruguay), subtropical regions",
      "colors": [
        "red"
      ],
      "emoji": "🌺",
      "funFact": "Erythrina crista-galli is the national flower of Argentina and Uruguay."
    },
    {
      "name": "Solidago canadensis",
      "commonName": "Canada Goldenrod",
      "description": "A tall, flowering herbaceous perennial native to North America, it produces dense clusters of bright yellow flowers in late summer and fall, commonly found in meadows and along roadsides.",
      "bloomingSeason": "August to October",
      "location": "North America",
      "colors": [
        "yellow"
      ],
      "emoji": "💛",
      "funFact": "Goldenrods are important nectar sources for migrating butterflies and beneficial insects."
    },
    {
      "name": "Chrysanthemum morifolium",
      "commonName": "Florist's Chrysanthemum",
      "description": "A popular autumn-blooming garden plant originating from East Asia, with flowers available in diverse colors and forms. Chrysanthemums symbolize longevity and rejuvenation in many cultures.",
      "bloomingSeason": "September to November",
      "location": "East Asia, cultivated worldwide",
      "colors": [
        "white",
        "yellow",
        "red",
        "purple",
        "orange"
      ],
      "emoji": "🌼",
      "funFact": "In Japan, chrysanthemums are celebrated annually in a festival called 'Kiku Matsuri.'"
    }
  ]
}