{
  "date": "September 8",
  "plants": [
    {
      "name": "Helianthus annuus",
      "commonName": "Sunflower",
      "description": "Sunflowers are large, bright yellow flowers known for their ability to track the sun's movement. They thrive in temperate climates and are often cultivated for their seeds and oil.",
      "bloomingSeason": "July to September",
      "location": "Temperate regions worldwide, including North America and Europe",
      "colors": [
        "yellow",
        "brown"
      ],
      "emoji": "🌻",
      "funFact": "Sunflowers exhibit heliotropism, turning their flower heads to follow the sun from east to west during the day."
    },
    {
      "name": "Rudbeckia hirta",
      "commonName": "Black-eyed Susan",
      "description": "Black-eyed Susan features vibrant yellow petals surrounding a dark brown central cone. It is a hardy wildflower frequently seen in meadows and prairies.",
      "bloomingSeason": "June to September",
      "location": "Eastern and Central North America",
      "colors": [
        "yellow",
        "dark brown"
      ],
      "emoji": "🌼",
      "funFact": "This plant is the state flower of Maryland, USA, symbolizing encouragement and motivation."
    },
    {
      "name": "Dahlias",
      "commonName": "Dahlia",
      "description": "Dahlias display a wide variety of colors and flower forms, from small pom-poms to large dinner-plate blooms. They are popular ornamental plants in gardens.",
      "bloomingSeason": "July to October",
      "location": "Cultivated worldwide, originally from Mexico and Central America",
      "colors": [
        "red",
        "pink",
        "white",
        "purple",
        "yellow",
        "orange"
      ],
      "emoji": "💐",
      "funFact": "Dahlias were declared the national flower of Mexico in 1963, reflecting their cultural significance."
    },
    {
      "name": "Hydrangea macrophylla",
      "commonName": "Bigleaf Hydrangea",
      "description": "Bigleaf hydrangeas are known for their large, spherical flower clusters that change color based on soil pH, ranging from pink to blue.",
      "bloomingSeason": "June to September",
      "location": "Native to Japan; widely cultivated in temperate gardens globally",
      "colors": [
        "blue",
        "pink",
        "white"
      ],
      "emoji": "🌸",
      "funFact": "The color variation in hydrangea flowers is due to aluminum availability in the soil, which is influenced by soil pH."
    }
  ]
}