{
  "date": "September 18",
  "plants": [
    {
      "name": "Rudbeckia hirta",
      "commonName": "Black-eyed Susan",
      "description": "A hardy flowering plant native to North America, known for its bright yellow petals surrounding a dark brown central cone. It thrives in meadows and gardens, attracting bees and butterflies.",
      "bloomingSeason": "June to October",
      "location": "Eastern and Central United States",
      "colors": [
        "yellow",
        "brown"
      ],
      "emoji": "🌼",
      "funFact": "Black-eyed Susans are often used in herbal teas and have been used by Native Americans for medicinal purposes."
    },
    {
      "name": "Helianthus annuus",
      "commonName": "Sunflower",
      "description": "Tall annual plants with large, radiant flower heads composed of bright yellow ray florets and a central disc that matures into seeds. These plants are widely cultivated and bloom late summer into fall.",
      "bloomingSeason": "July to September",
      "location": "Temperate regions worldwide",
      "colors": [
        "yellow"
      ],
      "emoji": "🌻",
      "funFact": "Sunflowers exhibit heliotropism; young flower heads track the sun's movement across the sky during the day."
    },
    {
      "name": "Fuchsia magellanica",
      "commonName": "Hardy Fuchsia",
      "description": "A deciduous shrub producing elegant, pendulous flowers usually in shades of red and purple. It blooms late summer to early fall and is native to southern South America, often grown in gardens in temperate climates.",
      "bloomingSeason": "July to October",
      "location": "Southern South America, cultivated in gardens worldwide",
      "colors": [
        "red",
        "purple"
      ],
      "emoji": "🌺",
      "funFact": "Despite their delicate appearance, hardy fuchsias are surprisingly cold tolerant, surviving frosts that kill other fuchsia species."
    },
    {
      "name": "Erica arborea",
      "commonName": "Tree Heather",
      "description": "An evergreen shrub or small tree producing dense clusters of small bell-shaped white or pale pink flowers. Common in Mediterranean and temperate regions, its flowers bloom late summer through fall.",
      "bloomingSeason": "August to October",
      "location": "Mediterranean Basin, Macaronesia",
      "colors": [
        "white",
        "pink"
      ],
      "emoji": "🌸",
      "funFact": "Tree heath wood was historically used in the production of high-quality charcoal for gunpowder manufacturing."
    }
  ]
}