{
  "date": "September 21",
  "plants": [
    {
      "name": "Aster amellus",
      "commonName": "European Michaelmas Daisy",
      "description": "A hardy perennial native to Europe, known for its daisy-like purple flowers that bloom in late summer and early autumn. It thrives in well-drained soils and full sun.",
      "bloomingSeason": "August to October",
      "location": "Europe",
      "colors": [
        "purple",
        "lavender",
        "white"
      ],
      "emoji": "🌸",
      "funFact": "Michaelmas daisies are named after the Christian festival of Michaelmas, celebrated around September 29, reflecting their peak bloom time."
    },
    {
      "name": "Rudbeckia hirta",
      "commonName": "Black-eyed Susan",
      "description": "A North American wildflower recognizable by its bright yellow petals surrounding a dark brown central cone. It blooms profusely in late summer and early fall, attracting pollinators.",
      "bloomingSeason": "June to September",
      "location": "North America",
      "colors": [
        "yellow",
        "brown"
      ],
      "emoji": "🌻",
      "funFact": "Black-eyed Susans are named for their dark, central cone which looks like an eye surrounded by bright petals."
    },
    {
      "name": "Nelumbo nucifera",
      "commonName": "Sacred Lotus",
      "description": "An aquatic plant native to Asia, noted for its large, fragrant pink or white flowers that bloom above water in warm months and can still be seen in bloom in early autumn in warmer climates.",
      "bloomingSeason": "June to October",
      "location": "Asia and tropical regions",
      "colors": [
        "pink",
        "white"
      ],
      "emoji": "🌺",
      "funFact": "The Sacred Lotus is a symbol of purity and spiritual awakening in many Asian cultures, and its seeds can remain viable for centuries."
    },
    {
      "name": "Grevillea robusta",
      "commonName": "Silky Oak",
      "description": "An Australian tree that produces vibrant orange clusters of spider-like flowers in late winter to early spring in the Southern Hemisphere, which corresponds to August-September, sometimes extending into October.",
      "bloomingSeason": "August to October (Southern Hemisphere)",
      "location": "Australia",
      "colors": [
        "orange"
      ],
      "emoji": "🌼",
      "funFact": "Despite its name, the Silky Oak is not a true oak; it is in the protea family and is valued for its timber and ornamental flowers."
    }
  ]
}