{
  "date": "September 22",
  "plants": [
    {
      "name": "Echinacea purpurea",
      "commonName": "Purple Coneflower",
      "description": "A hardy perennial native to North America, known for its large daisy-like purple flowers and prominent cone-shaped centers. It attracts pollinators such as bees and butterflies and is often used in herbal remedies.",
      "bloomingSeason": "June to October",
      "location": "Eastern and Central United States",
      "colors": [
        "Purple",
        "Pink"
      ],
      "emoji": "🌸",
      "funFact": "Echinacea has been traditionally used by Native Americans for its medicinal properties, especially to support the immune system."
    },
    {
      "name": "Dahlia pinnata",
      "commonName": "Dahlia",
      "description": "A tuberous perennial native to Mexico, notable for its wide range of flower forms and colors. Dahlias produce large, showy blooms that often appear in late summer and early fall, making them popular in gardens and floral arrangements.",
      "bloomingSeason": "July to October",
      "location": "Mexico and widely cultivated in temperate zones worldwide",
      "colors": [
        "Red",
        "Pink",
        "Orange",
        "Yellow",
        "White"
      ],
      "emoji": "🌺",
      "funFact": "Dahlias are the national flower of Mexico and have over 42 species growing wild in the country."
    },
    {
      "name": "Solidago canadensis",
      "commonName": "Canada Goldenrod",
      "description": "A perennial wildflower with dense clusters of small yellow flowers. It is native to North America and blooms in late summer and early fall, often signaling the arrival of autumn.",
      "bloomingSeason": "August to October",
      "location": "North America, especially Canada and United States",
      "colors": [
        "Yellow"
      ],
      "emoji": "💛",
      "funFact": "Goldenrod is an important late-season nectar source for bees and butterflies."
    },
    {
      "name": "Camellia sasanqua",
      "commonName": "Sasanqua Camellia",
      "description": "An evergreen shrub native to Japan, known for its smaller, fragrant flowers that bloom from early fall into winter. It is often used for ornamental purposes in gardens and is prized for its glossy leaves and extended blooming period.",
      "bloomingSeason": "September to December",
      "location": "Japan and cultivated in temperate regions",
      "colors": [
        "Pink",
        "White",
        "Red"
      ],
      "emoji": "🌹",
      "funFact": "Sasanqua camellias bloom in autumn, providing color and fragrance when many other plants have finished flowering."
    }
  ]
}