{
  "date": "September 24",
  "plants": [
    {
      "name": "Dahlia pinnata",
      "commonName": "Dahlia",
      "description": "Dahlias are tuberous plants known for their vibrant, multi-petaled flowers that come in a broad spectrum of colors. They bloom in late summer to early autumn, making them a favorite ornamental garden plant.",
      "bloomingSeason": "August to October",
      "location": "Native to Mexico and Central America; cultivated worldwide in temperate climates",
      "colors": [
        "red",
        "pink",
        "yellow",
        "white",
        "orange",
        "purple"
      ],
      "emoji": "🌸",
      "funFact": "Dahlias were declared the national flower of Mexico in 1963 due to their cultural significance and striking beauty."
    },
    {
      "name": "Rudbeckia hirta",
      "commonName": "Black-eyed Susan",
      "description": "A hardy wildflower with bright yellow petals surrounding a dark brown central cone. It is a symbol of encouragement and motivation in North America and often blooms in late summer through fall.",
      "bloomingSeason": "June to October",
      "location": "Native to North America, commonly found in meadows and along roadsides",
      "colors": [
        "yellow",
        "orange"
      ],
      "emoji": "🌻",
      "funFact": "Black-eyed Susans are known to attract pollinators such as bees and butterflies, supporting ecological health."
    },
    {
      "name": "Erica carnea",
      "commonName": "Winter Heath",
      "description": "An evergreen shrub that produces profuse small bell-shaped flowers, often appearing as early as late winter but in some climates can continue blooming into early autumn, especially cultivars adapted to temperate zones.",
      "bloomingSeason": "Late winter to early spring, some lasting into early autumn in mild climates",
      "location": "Native to alpine regions of central and southern Europe",
      "colors": [
        "pink",
        "white",
        "red"
      ],
      "emoji": "🌺",
      "funFact": "Erica carnea can bloom through snow and frost, making it a unique early or late bloomer depending on climate."
    },
    {
      "name": "Helianthus annuus",
      "commonName": "Sunflower",
      "description": "Sunflowers are tall, sturdy plants with large flower heads composed of bright yellow ray florets and a central disc. They bloom in late summer to early autumn and are widely cultivated for seeds and oil production.",
      "bloomingSeason": "July to September (sometimes extending into October)",
      "location": "Native to North America; widely cultivated globally",
      "colors": [
        "yellow",
        "orange",
        "brown"
      ],
      "emoji": "🌻",
      "funFact": "Sunflowers exhibit heliotropism, turning to face the sun during the day, optimizing photosynthesis."
    }
  ]
}