{
  "date": "September 28",
  "plants": [
    {
      "name": "Aster amellus",
      "commonName": "European Michaelmas Daisy",
      "description": "A hardy perennial native to Europe, producing daisy-like violet to purple flowers. It blooms late in the season, adding vibrant color to gardens when many other plants have finished blooming.",
      "bloomingSeason": "August to October",
      "location": "Europe, temperate regions",
      "colors": [
        "purple",
        "violet"
      ],
      "emoji": "🌸",
      "funFact": "Michaelmas daisies are named after the feast of Michaelmas, celebrated on September 29, because they bloom around this time."
    },
    {
      "name": "Rudbeckia hirta",
      "commonName": "Black-eyed Susan",
      "description": "A widely cultivated and native North American wildflower with bright yellow petals and a dark brown center disc. It provides late summer to early autumn color and is a favorite for pollinators.",
      "bloomingSeason": "June to October",
      "location": "North America",
      "colors": [
        "yellow",
        "brown"
      ],
      "emoji": "🌻",
      "funFact": "Black-eyed Susans are important nectar sources for butterflies and bees in late summer landscapes."
    },
    {
      "name": "Cyclamen hederifolium",
      "commonName": "Ivy-leaved Cyclamen",
      "description": "A bulbous perennial native to parts of Europe and the Mediterranean. It blooms in early autumn with delicate pink or white flowers and decorative variegated leaves, often under deciduous trees.",
      "bloomingSeason": "September to November",
      "location": "Southern Europe and Mediterranean",
      "colors": [
        "pink",
        "white"
      ],
      "emoji": "🌺",
      "funFact": "Cyclamen hederifolium is one of the few plants that bloom in autumn when many other flowers have faded."
    },
    {
      "name": "Dendrobium nobile",
      "commonName": "Noble Dendrobium Orchid",
      "description": "An epiphytic orchid from Asia, it blooms in late winter to early autumn depending on the climate, with elegant clusters of fragrant purple and white flowers.",
      "bloomingSeason": "August to October",
      "location": "Himalayas, Southeast Asia",
      "colors": [
        "purple",
        "white"
      ],
      "emoji": "💐",
      "funFact": "Dendrobium orchids are commonly used in traditional medicines in Asia for their purported health benefits."
    }
  ]
}