{
  "date": "September 29",
  "plants": [
    {
      "name": "Echinacea purpurea",
      "commonName": "Purple Coneflower",
      "description": "A perennial herbaceous flowering plant native to North America, known for its distinctive purple-pink petals surrounding a prominent spiny central cone. It thrives in prairies and open woodlands and is popular in gardens for attracting pollinators.",
      "bloomingSeason": "June to October",
      "location": "Eastern and Central North America",
      "colors": [
        "purple",
        "pink"
      ],
      "emoji": "🌸",
      "funFact": "Purple Coneflower is widely used in herbal remedies and is believed to boost the immune system."
    },
    {
      "name": "Dahlia pinnata",
      "commonName": "Garden Dahlia",
      "description": "A tuberous perennial plant native to Mexico, famous for its large, vibrant, and diverse flower forms and colors. Dahlias are popular ornamental plants often blooming late summer to fall, before the first frost.",
      "bloomingSeason": "July to October",
      "location": "Mexico, Cultivated worldwide",
      "colors": [
        "red",
        "pink",
        "white",
        "yellow",
        "orange",
        "purple"
      ],
      "emoji": "🌺",
      "funFact": "Dahlias are the national flower of Mexico and were originally cultivated by the Aztecs."
    },
    {
      "name": "Rhododendron ferrugineum",
      "commonName": "Alpenrose",
      "description": "A low-growing evergreen shrub found in the Alps and Pyrenees, producing clusters of pink to red bell-shaped flowers. It blooms in late summer to early fall at high altitudes.",
      "bloomingSeason": "August to October",
      "location": "Alpine regions of Europe",
      "colors": [
        "pink",
        "red"
      ],
      "emoji": "🌹",
      "funFact": "Despite its beauty, Alpenrose is toxic if ingested due to grayanotoxins."
    },
    {
      "name": "Chrysanthemum morifolium",
      "commonName": "Florist’s Chrysanthemum",
      "description": "A widely cultivated herbaceous perennial known for its abundant and colorful daisy-like flowers, chrysanthemums bloom in autumn and are a symbol of longevity and rejuvenation in many cultures.",
      "bloomingSeason": "September to November",
      "location": "Native to East Asia, widely cultivated globally",
      "colors": [
        "yellow",
        "white",
        "red",
        "purple"
      ],
      "emoji": "🌼",
      "funFact": "In Japan, chrysanthemums are celebrated annually during the 'Festival of Happiness'."
    }
  ]
}