{
  "date": "May 6",
  "plants": [
    {
      "name": "Rhododendron ponticum",
      "commonName": "Rhodedendron",
      "description": "A large evergreen shrub or small tree bearing clusters of bell-shaped flowers that range from lavender to purple and white. It thrives in temperate climates and is often found in woodlands and gardens.",
      "bloomingSeason": "April to June",
      "location": "Europe (UK, Spain), Western Asia",
      "colors": [
        "Purple",
        "Lavender",
        "White"
      ],
      "emoji": "🌸",
      "funFact": "Rhododendron ponticum is known for its ability to thrive in acidic soils and can become invasive in some regions due to its dense growth."
    },
    {
      "name": "Lilium spp.",
      "commonName": "Lily",
      "description": "Lilies are herbaceous flowering plants growing from bulbs, recognized for their large, prominent flowers which bloom in various colors, including white, pink, orange, and yellow. Many species bloom in late spring to early summer.",
      "bloomingSeason": "April to June",
      "location": "Northern Hemisphere (temperate zones)",
      "colors": [
        "White",
        "Pink",
        "Orange",
        "Yellow"
      ],
      "emoji": "🌺",
      "funFact": "Lilies have been cultivated for thousands of years and are often symbols of purity and refined beauty in many cultures."
    },
    {
      "name": "Jacaranda mimosifolia",
      "commonName": "Jacaranda Tree",
      "description": "This deciduous tree is known for its striking and abundant clusters of trumpet-shaped violet-blue flowers which create a spectacular display.",
      "bloomingSeason": "Late April to June",
      "location": "Subtropical and tropical regions (South America native, also Australia, South Africa)",
      "colors": [
        "Violet-blue"
      ],
      "emoji": "💜",
      "funFact": "In many cities like Pretoria (South Africa), May is called 'Jacaranda season' due to the profusion of these trees blooming, often covering streets with their purple blossoms."
    },
    {
      "name": "Camellia japonica",
      "commonName": "Japanese Camellia",
      "description": "An evergreen shrub famed for its large, rose-like flowers which bloom in cooler months but often continue into spring, showcasing glossy dark green leaves and a variety of colors from white to deep red.",
      "bloomingSeason": "Late winter to early May",
      "location": "East Asia (Japan, China, Korea) and cultivated worldwide",
      "colors": [
        "Red",
        "Pink",
        "White"
      ],
      "emoji": "🌹",
      "funFact": "Camellia japonica's leaves are used to produce some types of tea, and it holds cultural significance in Japan where it is often associated with the samurai."
    }
  ]
}