{
  "date": "November 3",
  "holidays": [
    {
      "name": "Sandwich Day",
      "description": "A glorious day to celebrate the humble sandwich, that delicious edible invention combining slices of bread with endless fillings!",
      "origin": "Named after John Montagu, the 4th Earl of Sandwich, who is credited with popularizing the sandwich in the 18th century when he ordered meat tucked between bread to eat without interrupting his card game.",
      "category": "Food Holiday",
      "emoji": "🥪",
      "funFact": "The sandwich has so many variations worldwide that every culture seems to have its own special take on bread-and-filling combos!"
    },
    {
      "name": "National Candy Day",
      "description": "A sweet observance to indulge in your favorite candies, celebrating sugary treats that bring joy and a burst of flavor.",
      "origin": "Created in the U.S. to honor candy lovers and the confectionery industry, this day makes November a secondary Halloween-esque sugar rush!",
      "category": "Food Holiday",
      "emoji": "🍬",
      "funFact": "Americans consume approximately 2.8 billion pounds of chocolate candy each year—no wonder candy days are so popular!"
    },
    {
      "name": "Golden Spike Day",
      "description": "Commemorates the completion of the first transcontinental railroad in the U.S. on May 10, 1869, but this day is unofficially celebrated on November 3 as a nod to railroad history enthusiasts.",
      "origin": "Honors the driving of the ‘Golden Spike’ at Promontory Summit, Utah, symbolizing the unification of eastern and western America by rail.",
      "category": "Historical Celebration",
      "emoji": "🚂",
      "funFact": "The Golden Spike was actually an ornate ceremonial spike, not a real functional railroad spike!"
    },
    {
      "name": "Use Your Common Sense Day",
      "description": "A quirky reminder to trust your instincts and apply a bit of good old-fashioned common sense to everyday life and decisions.",
      "origin": "A modern, unofficial day created to encourage practical thinking and sensible behavior amid the complexities of daily life.",
      "category": "Awareness Day",
      "emoji": "🤔",
      "funFact": "This day’s unofficial motto could be: ‘Because sometimes Google can't fix everything.’"
    }
  ]
}