{
  "date": "November 4",
  "holidays": [
    {
      "name": "Use Your Imagination Day",
      "description": "A day dedicated to letting your creativity run wild and thinking outside the box. Perfect time to unleash your inner artist, dreamer, or storyteller!",
      "origin": "Origin unclear but recognized by various creativity advocates and online communities as a day to boost imaginative thinking.",
      "category": "Creativity & Imagination",
      "emoji": "🧠✨",
      "funFact": "Inventor Thomas Edison reportedly believed imagination was more important than knowledge, making this day all about innovation."
    },
    {
      "name": "National Candy Day (USA)",
      "description": "A sweet celebration where candy lovers indulge in all their favorite sugary treats—chocolates, gummies, lollipops and more!",
      "origin": "Started as a marketing campaign in the 20th century but now a popular unofficial food holiday appreciated by candy fans everywhere.",
      "category": "Food Holiday",
      "emoji": "🍬🍭",
      "funFact": "Approximately 2 billion pounds of candy are sold in the U.S. each year! National Candy Day is the perfect excuse to eat a little extra."
    },
    {
      "name": "Deviled Egg Day",
      "description": "Honoring the classic appetizer of hard-boiled eggs stuffed with creamy, often tangy yolk mixtures. A quirky culinary celebration that egg enthusiasts adore.",
      "origin": "The exact origin date is unknown, but deviled eggs have been around since ancient Rome, gaining popularity in the U.S. by the 19th century.",
      "category": "Food Holiday",
      "emoji": "🥚😈",
      "funFact": "During the Victorian era, 'deviled' referred to spicy or zesty dishes, hence the name Deviled Eggs comes from the mildly spicy yolk filling."
    },
    {
      "name": "Death of Guy Fawkes Day (historical observance)",
      "description": "Commemorates the capture of Guy Fawkes who attempted the infamous Gunpowder Plot to blow up the English Parliament in 1605. While November 5th is the main celebration, November 4th is remembered as the day just before the plot was foiled.",
      "origin": "Historical British event from the 17th century, leading to annual Bonfire Night celebrations.",
      "category": "Historical Observance",
      "emoji": "🔥🎆",
      "funFact": "Guy Fawkes Night originated as a Protestant celebration that has evolved into a popular bonfire and fireworks night in the UK."
    }
  ]
}