{
  "date": "November 6",
  "holidays": [
    {
      "name": "Marathon Day",
      "description": "A day to celebrate the incredible endurance and spirit of marathon runners worldwide.",
      "origin": "Commemorates the legendary run of the Greek soldier Pheidippides from Marathon to Athens, inspiring modern marathons.",
      "category": "Sports & Fitness",
      "emoji": "🏃‍♂️",
      "funFact": "The first organized marathon was held during the 1896 Athens Olympics and was inspired by this very historical run!"
    },
    {
      "name": "Nachos Day",
      "description": "A delicious tribute to the beloved crunchy, cheesy snack that has won hearts around the world.",
      "origin": "Celebrates the invention of nachos by Ignacio \"Nacho\" Anaya in 1943 at a restaurant in Piedras Negras, Mexico.",
      "category": "Food & Drink",
      "emoji": "🧀",
      "funFact": "Nachos were originally created to satisfy hungry customers with limited ingredients—just tortillas, cheese, and jalapeños!"
    },
    {
      "name": "Saxophone Day",
      "description": "Honors the saxophone, the iconic and sultry instrument that defined jazz and blues music.",
      "origin": "Celebrates the birthday of Adolphe Sax, the Belgian inventor of the saxophone, born on November 6, 1814.",
      "category": "Music & Culture",
      "emoji": "🎷",
      "funFact": "Adolphe Sax patented the saxophone in 1846; it initially received mixed reactions but became a cornerstone of modern music."
    },
    {
      "name": "Bittersweet Chocolate with Almonds Day",
      "description": "A tasty celebration for fans of bittersweet chocolate and crunchy almonds together in perfect harmony.",
      "origin": "A food holiday created by chocolate lovers to enjoy this classic and sophisticated flavor combo.",
      "category": "Food & Drink",
      "emoji": "🍫",
      "funFact": "Combining bittersweet chocolate with almonds not only tastes great but also offers antioxidants and healthy fats!"
    }
  ]
}