{
  "date": "November 8",
  "holidays": [
    {
      "name": "American Teddy Bear Day",
      "description": "A day dedicated to celebrating the iconic teddy bear, a beloved stuffed animal named after President Theodore Roosevelt.",
      "origin": "Inspired by a 1902 hunting trip where Roosevelt refused to shoot a captured bear, leading to a toy maker creating the teddy bear in his honor.",
      "category": "Pop Culture",
      "emoji": "🧸",
      "funFact": "The teddy bear inspired the creation of one of the first mass-produced stuffed animals, making it a classic childhood companion worldwide."
    },
    {
      "name": "International Tongue Twister Day",
      "description": "Celebrate the fun and challenge of tongue twisters—phrases designed to be difficult to articulate quickly and correctly.",
      "origin": "An informal celebration to encourage linguistic fun and improve diction by practicing tricky phrases.",
      "category": "Linguistics & Fun",
      "emoji": "👅",
      "funFact": "The oldest known printed tongue twister appeared in 1871: “She sells seashells by the seashore.”"
    },
    {
      "name": "Calzone Day",
      "description": "A mouthwatering day dedicated to the calzone, Italy’s delicious folded pizza pocket filled with cheese, meats, and veggies.",
      "origin": "Celebrates Italian cuisine and the culinary delight of calzones, which originated in Naples in the 18th century.",
      "category": "Food",
      "emoji": "🥟",
      "funFact": "Calzones are often called 'pizza pockets' because they pack all the toppings inside a portable crust—perfect for eating on the go!"
    },
    {
      "name": "Equality Day",
      "description": "A day promoting awareness and advocacy for social equality and justice across all communities.",
      "origin": "Observed by various groups to highlight ongoing struggles for civil rights and fair treatment worldwide.",
      "category": "Awareness",
      "emoji": "⚖️",
      "funFact": "Equality Day reminds us that achieving equal rights remains a vital cause in every society across the globe."
    }
  ]
}