{
  "date": "November 10",
  "holidays": [
    {
      "name": "Forget-Me-Not Day",
      "description": "A day to remember loved ones and cherish memories by sending someone a forget-me-not flower or simply sharing a heartfelt message.",
      "origin": "Forget-Me-Not flowers have long symbolized remembrance, and this day was adopted to encourage people to keep others in their hearts and minds.",
      "category": "Awareness / Remembrance",
      "emoji": "🌸",
      "funFact": "Forget-me-nots were the first flowers sent from space! Astronauts took their seeds on a mission to promote peace and remembrance."
    },
    {
      "name": "Vanilla Cupcake Day",
      "description": "Celebrate the humble yet delicious vanilla cupcake! Bake, eat, or share your favorite vanilla cupcakes to honor this classic treat.",
      "origin": "Growing popularity of cupcakes led to the creation of various days celebrating different flavors, and vanilla—being a timeless classic—earned its own day.",
      "category": "Food Holiday",
      "emoji": "🧁",
      "funFact": "Though often overshadowed by chocolate, vanilla is one of the most labor-intensive flavors to produce, coming from orchid pods requiring hand pollination!"
    },
    {
      "name": "Accounting Day",
      "description": "An unconventional holiday dedicated to celebrating the often overlooked heroes of finance — accountants! It's a nod of appreciation to those who keep the money flowing smoothly.",
      "origin": "Established to honor the founding of the American Institute of Certified Public Accountants (AICPA) which officially began on November 10 in 1887.",
      "category": "Professional / Awareness",
      "emoji": "📊",
      "funFact": "On Accounting Day, some accountants celebrate by balancing their own checkbooks to the last penny — talk about dedication!"
    },
    {
      "name": "Earmuffs Day",
      "description": "On this chilly November day, celebrate the invention and use of earmuffs — the perfect accessory to keep your ears warm and your style cool.",
      "origin": "Invented by Chester Greenwood in 1873, earmuffs have a quirky origin story that November 10 honors every year.",
      "category": "Invention / Fun",
      "emoji": "🎧",
      "funFact": "Chester Greenwood was just 15 when he invented earmuffs after getting frustrated by cold ears during winter skating sessions!"
    }
  ]
}