{
  "date": "November 11",
  "holidays": [
    {
      "name": "Singles' Day",
      "description": "Originally a Chinese unofficial holiday celebrating single people, Singles' Day has transformed into the world's largest online shopping extravaganza, surpassing Black Friday with insane sales and deals.",
      "origin": "Began in the 1990s among students in China as a day to celebrate being single; popularized commercially by Alibaba in the 2000s.",
      "category": "Pop Culture / Shopping",
      "emoji": "🛍️",
      "funFact": "On Singles' Day, Alibaba once raked in sales exceeding $30 billion in just 24 hours!"
    },
    {
      "name": "Origami Day",
      "description": "A day to honor the traditional Japanese art of paper folding, Origami Day encourages creativity and precision by transforming flat sheets of paper into intricate shapes and figures.",
      "origin": "Japan; the exact origin is unclear, but the day is recognized to promote this beautiful craft worldwide.",
      "category": "Arts & Crafts",
      "emoji": "📄",
      "funFact": "Did you know? The word 'origami' comes from 'ori' meaning folding, and 'kami' meaning paper."
    },
    {
      "name": "National French Dip Day",
      "description": "Celebrate this delicious sandwich featuring thinly sliced roast beef dipped in savory au jus. It's a carnivore's delight and a lesser-known but beloved American food holiday.",
      "origin": "The French dip sandwich was reportedly invented in Los Angeles in the early 1900s, with claims from multiple eateries about its origin.",
      "category": "Food",
      "emoji": "🥪",
      "funFact": "Contrary to what the name suggests, the sandwich isn’t French — it’s an American invention named for the style of sandwich rather than nationality."
    },
    {
      "name": "Veterans Day (U.S.)",
      "description": "A federal holiday dedicated to honoring military veterans who served in the United States Armed Forces. Though solemn, many quirky celebrations and parades happen nationwide.",
      "origin": "Originally Armistice Day, marking the end of World War I on November 11, 1918; renamed Veterans Day in 1954 to honor all U.S. veterans.",
      "category": "Awareness / National Holiday",
      "emoji": "🎖️",
      "funFact": "November 11 was chosen because the armistice ending WWI went into effect on the 11th hour of the 11th day of the 11th month."
    }
  ]
}