{
  "date": "November 12",
  "holidays": [
    {
      "name": "Happy Hour Day",
      "description": "A celebration dedicated to that magical time when cocktails and snacks become the stars, often blending socializing and relaxation after a long day.",
      "origin": "Though happy hours have been around since the early 20th century, Happy Hour Day was popularized to officially honor the tradition of discounted drinks and good vibes that bring people together after work.",
      "category": "Social Drinking & Leisure",
      "emoji": "🍹",
      "funFact": "The term \"happy hour\" dates back to the 1920s U.S. Navy, where it referred to scheduled entertainment to boost morale during long sea missions."
    },
    {
      "name": "World Pneumonia Day",
      "description": "An important awareness day focusing on preventing, treating, and understanding pneumonia, the world's leading infectious killer of children under five.",
      "origin": "Established in 2009 by the Global Coalition Against Child Pneumonia to raise global awareness and increase efforts against this deadly disease.",
      "category": "Health Awareness",
      "emoji": "🫁",
      "funFact": "Pneumonia can be caused by viruses, bacteria, or fungi, and despite being preventable and treatable, it claims over 1 million lives worldwide annually."
    },
    {
      "name": "National Candle Day",
      "description": "A delightfully quirky day to honor scented (or unscented) candles that transform any space with their glow and aroma, perfect for cozy vibes and romantic settings.",
      "origin": "Started by candle enthusiasts to promote the simple joy and ambiance candles bring to everyday moments and special occasions alike.",
      "category": "Home & Lifestyle",
      "emoji": "🕯️",
      "funFact": "The largest candle ever made weighed over 60,000 pounds and stood more than 20 feet tall!"
    },
    {
      "name": "Young Readers Day",
      "description": "Celebrating the joy and importance of young children reading, fostering literacy, imagination, and learning from an early age.",
      "origin": "Created by literacy advocates to highlight the lifelong benefits of encouraging children to develop a love for reading.",
      "category": "Education & Literacy",
      "emoji": "📚",
      "funFact": "Research shows that children who read regularly at a young age perform better academically and enjoy lifelong creative thinking skills."
    }
  ]
}