{
  "date": "November 13",
  "holidays": [
    {
      "name": "World Kindness Day",
      "description": "A day dedicated to promoting kindness in all its forms, encouraging people around the globe to be nicer to one another and spread goodwill.",
      "origin": "Initiated by the World Kindness Movement in 1998 to highlight good deeds in the community, focusing on the positive power of kindness.",
      "category": "Awareness Day",
      "emoji": "🤝",
      "funFact": "Studies show that performing a single act of kindness can boost your happiness for up to 12 hours!"
    },
    {
      "name": "Pickle Day",
      "description": "A crunchy celebration of all things pickled — cucumbers, onions, even pickled plums if you're adventurous! This day is a sour-sweet homage to preserved veggies.",
      "origin": "While the exact origin is murky, Pickle Day has been embraced by pickle lovers and pickle-makers to honor this salty snack.",
      "category": "Food Holiday",
      "emoji": "🥒",
      "funFact": "Pickles were so prized in the past that seafarers considered them essential for preventing scurvy on long voyages."
    },
    {
      "name": "World Pneumonia Day",
      "description": "An awareness day focusing on pneumonia prevention, treatment, and the global fight against this serious lung infection.",
      "origin": "Established in 2009 by the Global Coalition against Child Pneumonia to boost public awareness and policy focus.",
      "category": "Health Awareness",
      "emoji": "🫁",
      "funFact": "Despite advances in medicine, pneumonia remains the leading infectious cause of death in children worldwide."
    },
    {
      "name": "National Blame Someone Else Day",
      "description": "A cheeky unofficial observance where it's totally acceptable to avoid responsibility by pinning your goofs on someone else! (Just this once.)",
      "origin": "Believed to have started as a humorous American holiday to lighten the mood about our mistakes.",
      "category": "Fun/Pop Culture",
      "emoji": "🤷",
      "funFact": "This day usually falls on the Friday before Thanksgiving, perfect timing for a little workplace mischief!"
    }
  ]
}