{
  "date": "November 14",
  "holidays": [
    {
      "name": "Pickle Day",
      "description": "A day to celebrate the humble pickle, that tangy, crunchy delight that jazzes up sandwiches, salads, and snack platters around the world.",
      "origin": "Pickle Day is an unofficial food holiday that likely emerged from pickle enthusiasts and makers who wanted to honor this salty treat.",
      "category": "Food",
      "emoji": "🥒",
      "funFact": "The world’s largest pickle weighed over 4 pounds and was grown by an enthusiastic gardener aiming for the pickle record!"
    },
    {
      "name": "World Diabetes Day",
      "description": "A global awareness day focusing on diabetes, its prevention, management, and the importance of holistic health.",
      "origin": "Established by the International Diabetes Federation in 1991 and marked on November 14 to honor Frederick Banting, who co-discovered insulin.",
      "category": "Awareness",
      "emoji": "💙",
      "funFact": "The blue circle symbolizing the day represents the unity of the global diabetes community."
    },
    {
      "name": "Operating Room Nurse Day",
      "description": "A day to recognize the critical role of nurses who work in operating rooms, providing skillful, behind-the-scenes care during surgeries.",
      "origin": "An unofficial appreciation day created by professional nursing organizations to honor OR nurses.",
      "category": "Professional Appreciation",
      "emoji": "🩺",
      "funFact": "OR nurses must memorize hundreds of surgical instruments and procedures – talk about having a sharp mind!"
    },
    {
      "name": "Children’s Day (India)",
      "description": "A day dedicated to celebrating children and promoting their rights and welfare across India.",
      "origin": "Observed on November 14 to commemorate the birthday of Jawaharlal Nehru, India’s first Prime Minister, who loved children.",
      "category": "Cultural",
      "emoji": "👶",
      "funFact": "Jawaharlal Nehru was affectionately known as 'Chacha Nehru' (Uncle Nehru) because of his affection for kids."
    }
  ]
}