{
  "date": "November 15",
  "holidays": [
    {
      "name": "America Recycles Day ♻️",
      "description": "A day dedicated to encouraging recycling and environmental responsibility across the United States.",
      "origin": "Established in 1997 by the National Recycling Coalition to increase awareness and participation in recycling programs.",
      "category": "Environment & Awareness",
      "emoji": "♻️",
      "funFact": "Every year, Americans recycle about 87 million tons of waste — that’s like taking about 70 million cars off the road for a year!"
    },
    {
      "name": "National Bundt Cake Day 🍰",
      "description": "A celebration of the iconic ring-shaped Bundt cake, honoring its delicious variety and nostalgic charm.",
      "origin": "Inspired by the popularity of Bundt pans introduced in the 1950s by Nordic Ware, with the day unofficially recognized by fans and bakeries.",
      "category": "Food & Drink",
      "emoji": "🍰",
      "funFact": "The Bundt cake pan became wildly popular after a Bundt cake called 'Tunnel of Fudge' took second place in the 1966 Pillsbury Bake-Off."
    },
    {
      "name": "Clean Out Your Refrigerator Day 🧊",
      "description": "A quirky reminder to ditch those expired leftovers and nasty smells lingering in your fridge for a fresh start.",
      "origin": "An informal observance aimed at promoting kitchen hygiene and food safety, gaining popularity on social media.",
      "category": "Health & Lifestyle",
      "emoji": "🧊",
      "funFact": "Cleaning your fridge regularly can actually help reduce food waste and save you money — plus, it might prevent a science experiment in your veggie drawer!"
    },
    {
      "name": "Throw Out Your Leftovers Day 🍽️",
      "description": "A no-guilt day to toss those mysterious Tupperware contents you’ve been avoiding forever.",
      "origin": "A humorous spin-off of food safety awareness days, encouraging people not to risk eating questionable leftovers.",
      "category": "Food & Safety",
      "emoji": "🍽️",
      "funFact": "Leftovers that have been in the fridge for more than 3-4 days can grow harmful bacteria — so sometimes, throwing them out is the safer choice!"
    }
  ]
}