{
  "date": "November 17",
  "holidays": [
    {
      "name": "International Students' Day",
      "description": "A day to honor student activism and commemorate their role in fighting for freedom and justice worldwide.",
      "origin": "Originated in 1941 to remember the 1939 Nazi storming of Czech universities and the execution and imprisonment of student leaders.",
      "category": "Awareness Day",
      "emoji": "🎓",
      "funFact": "In some countries, November 17 is marked by marches and demonstrations advocating for educational rights and social justice."
    },
    {
      "name": "Take a Hike Day",
      "description": "Encourages people to get outdoors and enjoy nature by going for a hike, no matter their skill level or location.",
      "origin": "Unofficial observance created to promote physical activity and mental well-being through hiking.",
      "category": "Outdoor/Wellness",
      "emoji": "🥾",
      "funFact": "Even if you live in an urban area, you can celebrate by exploring local parks or urban trails on Take a Hike Day!"
    },
    {
      "name": "Homemade Bread Day",
      "description": "A delicious day dedicated to baking your own bread from scratch and enjoying the warm, fresh-from-the-oven goodness.",
      "origin": "Unofficial food holiday started by baking enthusiasts, celebrating the timeless art of bread-making.",
      "category": "Food Holiday",
      "emoji": "🍞",
      "funFact": "The scent of baking bread can boost happiness and reduce stress – making Homemade Bread Day a day for both taste and mood!"
    },
    {
      "name": "National Eat a Cranberry Day",
      "description": "Celebrate the tart, vibrant cranberry by incorporating it into your meals or snacks today.",
      "origin": "Primarily recognized in the US due to cranberries' harvest season and Thanksgiving traditions.",
      "category": "Food Holiday",
      "emoji": "🍒",
      "funFact": "Cranberries are one of the only fruits native to North America and were used by Native Americans for food and medicinal purposes."
    }
  ]
}