{
  "date": "November 18",
  "holidays": [
    {
      "name": "Apple Cider Day",
      "description": "A celebration dedicated to the delicious and refreshing drink made from pressed apples. Perfect for cozy fall sipping!",
      "origin": "Apple cider has been a popular autumn beverage for centuries in North America and Europe, and this day celebrates its seasonal charm.",
      "category": "Food Day",
      "emoji": "🍎",
      "funFact": "Cider apples are different from eating apples — they're specially grown to produce a perfectly balanced cider."
    },
    {
      "name": "Anniversary of the Mona Lisa’s Theft (1911)",
      "description": "Commemorates the infamous day the Mona Lisa was stolen from the Louvre by Vincenzo Peruggia, sparking global intrigue.",
      "origin": "In 1911, the Italian handyman Peruggia stole the painting believing it should be returned to Italy, and it was recovered two years later.",
      "category": "Pop Culture/History",
      "emoji": "🖼️",
      "funFact": "The theft actually boosted the Mona Lisa's popularity, turning it into a worldwide icon."
    },
    {
      "name": "Use Your Common Sense Day",
      "description": "A quirky reminder to apply logic and practical thinking in everyday situations instead of rushing into decisions blindly.",
      "origin": "An informal observance encouraging everyone to pause and think critically before acting.",
      "category": "Awareness/Behavioral",
      "emoji": "🧠",
      "funFact": "This day humorously reminds us that common sense isn't so common after all!"
    },
    {
      "name": "Jukebox Day",
      "description": "Celebrates the musical charm and nostalgia of the classic jukebox, which pumped out tunes in diners and bars.",
      "origin": "The jukebox was at its peak mid-20th century; this day honors its influence on social music culture.",
      "category": "Pop Culture/Music",
      "emoji": "🎶",
      "funFact": "The first jukebox was invented in 1889 and could play multiple records on demand!"
    }
  ]
}