{
  "date": "November 21",
  "holidays": [
    {
      "name": "World Hello Day",
      "description": "A day dedicated to promoting peace through simple acts of communication — just say 'Hello' to at least 10 people!",
      "origin": "Started in 1973 as a response to conflict, World Hello Day encourages dialogue to solve problems instead of violence.",
      "category": "Awareness Day",
      "emoji": "👋",
      "funFact": "World Hello Day was created in response to the Yom Kippur War, promoting greetings instead of gunfire."
    },
    {
      "name": "False Confession Day",
      "description": "Celebrate the hilarity and mischief of admitting to outrageous or silly things that you definitely didn’t do!",
      "origin": "An unofficial day to poke fun at the concept of false confessions and encourage playful honesty.",
      "category": "Humor",
      "emoji": "😜",
      "funFact": "Though most false confessions in real life are serious, this day invites only harmless, ridiculous admissions (like 'I ate the last cookie')."
    },
    {
      "name": "Have a Party with Your Bear Day",
      "description": "Honor your teddy bear or favorite stuffed companion by throwing a mini party just for them!",
      "origin": "An informal day to celebrate childhood comfort objects and spread joy.",
      "category": "Fun/Pet/Stuffed Animals",
      "emoji": "🧸🎉",
      "funFact": "Teddy bears have been cherished companions since the early 1900s and can reduce stress just by hugging!"
    },
    {
      "name": "World Television Day",
      "description": "Recognizes the impact television has on decision-making by providing information, entertainment, and education worldwide.",
      "origin": "UN declared November 21 as World Television Day in 1996 to acknowledge TV’s role in communication.",
      "category": "Pop Culture/Awareness",
      "emoji": "📺",
      "funFact": "The first TV transmission was demonstrated in 1926, but it took decades before TVs were common in homes!"
    }
  ]
}