{
  "date": "November 22",
  "holidays": [
    {
      "name": "Go For a Ride Day",
      "description": "A day dedicated to the joy and freedom of getting out on the road or trail, whether by car, bike, or even horseback! It's all about spontaneous travel and exploring new horizons.",
      "origin": "Unknown origin, but celebrates the simple pleasure of a journey without a fixed plan.",
      "category": "Fun / Leisure",
      "emoji": "🚗",
      "funFact": "Some enthusiasts use this day to test drive unusual vehicles, from vintage cars to electric scooters!"
    },
    {
      "name": "National Cranberry Relish Day",
      "description": "Celebrate the tangy, zesty side of cranberry with this day devoted to cranberry relish—perfect for Thanksgiving tables and beyond.",
      "origin": "Created to honor cranberry relish as a unique and flavorful alternative to traditional cranberry sauce.",
      "category": "Food",
      "emoji": "🍒",
      "funFact": "Cranberry relish recipes date back to Native American traditions, using citrus and spices to brighten the tart berries."
    },
    {
      "name": "Day of the Dumbstruck",
      "description": "This quirky observance encourages people to react with playful astonishment to everyday surprises and odd situations—being 'dumbstruck' just for fun!",
      "origin": "An informal holiday that emerged online celebrating humorous and unexpected moments.",
      "category": "Humor / Social",
      "emoji": "😲",
      "funFact": "Participants often take selfies with wild, shocked expressions on this day and share them on social media."
    },
    {
      "name": "Hika Nation Day (South Korea)",
      "description": "A lesser-known cultural day in South Korea honoring the ‘Hika Nation,’ a mythical or local folklore group symbolizing unity and festivity.",
      "origin": "Rooted in regional Korean folklore and folk festivals, celebrating community and tradition.",
      "category": "Cultural",
      "emoji": "🎎",
      "funFact": "Festivities often include traditional dances and storytelling that have been passed down for generations."
    }
  ]
}