{
  "date": "November 23",
  "holidays": [
    {
      "name": "National Espresso Day",
      "description": "A day to honor the bold, concentrated coffee shot that energizes millions worldwide. Perfect excuse to indulge in an espresso or try making your own shot at home.",
      "origin": "Originated from Italian coffee culture celebrations and popularized globally by coffee enthusiasts.",
      "category": "Food & Drink",
      "emoji": "☕️",
      "funFact": "Espresso isn’t a type of coffee bean or roast — it’s a brewing method that uses pressure to make that small, strong cup!"
    },
    {
      "name": "Parade Day (Washington, D.C.)",
      "description": "The annual day commemorating the inauguration parades in Washington, D.C., celebrated with quirky mini-parades and community festivities.",
      "origin": "Inspired by the grand inaugural parades and adapted by locals as a fun, unofficial celebration day.",
      "category": "Cultural Celebration",
      "emoji": "🎉",
      "funFact": "The first presidential inaugural parade in D.C. happened in 1805 for Thomas Jefferson’s second term."
    },
    {
      "name": "Fibonacci Day (Unofficial)",
      "description": "A celebration of the famous Fibonacci sequence where each number is the sum of the two preceding ones, reflecting patterns found in nature.",
      "origin": "Coined by math enthusiasts to honor Italian mathematician Leonardo Fibonacci.",
      "category": "Educational/Math",
      "emoji": "➗",
      "funFact": "Sunflower seed patterns and pinecones often mirror Fibonacci numbers in their spirals!"
    },
    {
      "name": "National Die Crazy Day",
      "description": "A quirky day to embrace your inner gamer and enjoy board games, dice games, or even craft your own dice sets.",
      "origin": "Emerged from gaming communities as a fun way to celebrate dice’s role in games old and new.",
      "category": "Entertainment",
      "emoji": "🎲",
      "funFact": "Dice have been used for gaming and divination for over 5,000 years, making them truly timeless!"
    }
  ]
}