{
  "date": "November 27",
  "holidays": [
    {
      "name": "Make Your Own Head Day",
      "description": "A delightfully bizarre holiday encouraging people to craft their own 'head' using anything but their actual head — think paper, cardboard, or even veggies! It’s a playful way to explore creativity and humor.",
      "origin": "Originating from an art therapy movement celebrating self-expression through handmade masks and sculptures.",
      "category": "Creative Arts / Fun",
      "emoji": "🎭",
      "funFact": "Some people have made elaborate heads so detailed that they've been mistaken for actual sculptures in art galleries!"
    },
    {
      "name": "Native American Heritage Month (Continues)",
      "description": "While this is a month-long observance, November 27 often features special events honoring Native American history, culture, and contributions.",
      "origin": "Established officially in 1990 by Presidential Proclamation to raise awareness and honor Native cultures.",
      "category": "Cultural Awareness",
      "emoji": "🪶",
      "funFact": "November is chosen to align with the Thanksgiving period, a pivotal time for reflecting on Native American heritage and history."
    },
    {
      "name": "International Absinthe Day",
      "description": "A day to celebrate the famously mysterious and often misunderstood spirit known as absinthe, the 'Green Fairy,' with tastings and parties worldwide.",
      "origin": "Dedicated to absinthe lovers and connoisseurs to promote appreciation of this once-banned drink’s rich history.",
      "category": "Food & Drink",
      "emoji": "🍸",
      "funFact": "Absinthe was banned in many countries in the early 20th century due to myths about its psychoactive effects, but modern science debunked those claims!"
    },
    {
      "name": "Shopping Reminder Day",
      "description": "A cheeky holiday designed to poke fun at the holiday shopping frenzy, reminding people to stop and think before diving into consumer chaos.",
      "origin": "Coined by consumer rights advocates to encourage mindful purchasing before the Black Friday and Cyber Monday madness.",
      "category": "Humor / Social Commentary",
      "emoji": "🛍️",
      "funFact": "On this day, some stores offer quiet shopping hours or donate proceeds to charity to make the experience less stressful."
    },
    {
      "name": "Buy Nothing Day (Observed late November)",
      "description": "An anti-consumerism protest day encouraging people to refrain from buying anything for 24 hours to raise awareness about overconsumption.",
      "origin": "Started in Canada in 1992 and now observed internationally, usually on the day after Thanksgiving, but sometimes spills into nearby dates like November 27.",
      "category": "Activism / Awareness",
      "emoji": "🚫🛒",
      "funFact": "Buy Nothing Day has inspired dozens of 'free stores' where people exchange goods without money."
    }
  ]
}