{
  "date": "November 28",
  "holidays": [
    {
      "name": "Red Planet Day",
      "description": "Celebrate humanity's fascination with Mars, the Red Planet of our solar system. A day to admire space exploration, dream about colonizing Mars, and enjoy sci-fi stories.",
      "origin": "Commemorates the launch of Mariner 4, the first successful flyby mission to Mars by NASA, on November 28, 1964.",
      "category": "Space Exploration / Science",
      "emoji": "🪐",
      "funFact": "Mariner 4’s flyby gave Earth its first close-up pictures of Mars, revealing craters, and forever changing how we see the Red Planet."
    },
    {
      "name": "French Toast Day",
      "description": "A delicious day to honor the sweet, eggy, and golden breakfast classic—French toast! Enjoy it with syrup, fruit, or crazy toppings.",
      "origin": "Origin unclear, but French toast recipes date back to ancient Rome. The holiday was embraced informally by food lovers to appreciate this beloved comfort food every November 28.",
      "category": "Food / Culinary",
      "emoji": "🍞",
      "funFact": "French toast was originally made to use stale bread, turning it into a tasty treat—waste not, want not!"
    },
    {
      "name": "American Teddy Bear Day",
      "description": "Pay homage to the iconic teddy bear, a cuddly companion and symbol of childhood innocence and comfort.",
      "origin": "Named after US President Theodore “Teddy” Roosevelt, stemming from a 1902 story where he refused to shoot a tied bear cub, inspiring a toy maker to create the teddy bear.",
      "category": "Pop Culture / Toys",
      "emoji": "🧸",
      "funFact": "Over 30 million teddy bears are sold each year worldwide, proving these plush pals never go out of style."
    },
    {
      "name": "Give Thanks and Stuff Your Face Day",
      "description": "An unofficial, humorous holiday encouraging people to eat as much as they want without guilt—perfect timing before Thanksgiving!",
      "origin": "Modern internet culture created this tongue-in-cheek day to revel in gluttony and gratitude.",
      "category": "Humor / Food",
      "emoji": "🦃",
      "funFact": "This day is basically a warm-up for Thanksgiving feasts, giving everyone a ‘justification’ for extra helpings!"
    }
  ]
}