{
  "date": "December 1",
  "events": [
    {
      "year": 1955,
      "title": "Rosa Parks' Bus Boycott",
      "description": "Rosa Parks was arrested in Montgomery, Alabama, for refusing to give up her bus seat to a white person, sparking the Montgomery Bus Boycott, a pivotal event in the Civil Rights Movement.",
      "category": "Civil Rights",
      "significance": "This act of defiance became a symbol of the struggle against racial segregation and led to a successful Supreme Court ruling declaring bus segregation unconstitutional."
    },
    {
      "year": 1918,
      "title": "Poland Regains Independence",
      "description": "Poland officially regained independence after 123 years of partitions by Austria-Hungary, Germany, and Russia.",
      "category": "Political History",
      "significance": "This marked the rebirth of Poland as a sovereign nation-state following World War I, profoundly impacting European geopolitics."
    },
    {
      "year": 1988,
      "title": "Benazir Bhutto Becomes Prime Minister of Pakistan",
      "description": "Benazir Bhutto took office as the Prime Minister of Pakistan, becoming the first woman to head a democratic government in a Muslim-majority country.",
      "category": "Political Milestone",
      "significance": "Her election was a groundbreaking moment for gender and political progress in the Muslim world."
    },
    {
      "year": 1958,
      "title": "Guinea Declares Independence from France",
      "description": "Guinea became the first French African colony to gain independence, breaking away from colonial rule.",
      "category": "Decolonization",
      "significance": "This event inspired other African nations to pursue independence and marked a significant step in African decolonization."
    },
    {
      "year": 2014,
      "title": "Same-Sex Marriage Legalized in England and Wales",
      "description": "Same-sex marriage became legal in England and Wales following the implementation of the Marriage (Same Sex Couples) Act 2013.",
      "category": "Social Progress",
      "significance": "This legalization was a major milestone in the advancement of LGBTQ+ rights in the United Kingdom."
    }
  ]
}