{
  "date": "December 4",
  "events": [
    {
      "year": 771,
      "title": "Charlemagne Becomes Sole King of the Franks",
      "description": "After the death of his brother Carloman I, Charlemagne becomes the sole ruler of the Frankish Kingdom, laying foundations for the Carolingian Empire.",
      "category": "Political",
      "significance": "This event marks the beginning of Charlemagne's sole rulership, which greatly influenced the political landscape of medieval Europe."
    },
    {
      "year": 1791,
      "title": "The United States Bill of Rights Becomes Law",
      "description": "The first ten amendments to the United States Constitution, known as the Bill of Rights, are ratified and become law.",
      "category": "Legal/Political",
      "significance": "These amendments established fundamental liberties and protections for individuals, shaping American democracy."
    },
    {
      "year": 1918,
      "title": "Hungary Declares Independence from the Austro-Hungarian Empire",
      "description": "Following the collapse of the Austro-Hungarian Empire after World War I, the Hungarian Democratic Republic is proclaimed.",
      "category": "Political",
      "significance": "Marking a significant shift in Central European politics, this event ended centuries of Habsburg rule over Hungary."
    },
    {
      "year": 1945,
      "title": "United Nations Established",
      "description": "The United Nations officially comes into existence with 51 founding member countries.",
      "category": "International Relations",
      "significance": "Creating a platform for international diplomacy and conflict resolution after World War II, it remains a major global institution."
    },
    {
      "year": 1991,
      "title": "Fidel Castro Resigns as President of Cuba",
      "description": "Fidel Castro resigns as President due to health issues, ending an era of direct leadership since the Cuban Revolution.",
      "category": "Political",
      "significance": "This marked a significant transition in Cuban leadership and had implications for international relations during the post-Cold War period."
    }
  ]
}