{
  "date": "December 6",
  "events": [
    {
      "year": 1917,
      "title": "Halifax Explosion",
      "description": "A massive munitions explosion occurred in the harbor of Halifax, Nova Scotia, when the SS Mont-Blanc, a French cargo ship laden with wartime explosives, collided with the Norwegian vessel SS Imo. The explosion devastated the city, killing approximately 2,000 people and injuring thousands more.",
      "category": "Disaster",
      "significance": "It was one of the largest non-nuclear explosions in history and had a lasting impact on disaster response and urban reconstruction."
    },
    {
      "year": 1921,
      "title": "Treaty of Riga Signed",
      "description": "The Treaty of Riga was signed, ending the Polish-Soviet War and establishing the borders between Poland and Soviet Russia (later the USSR).",
      "category": "Politics",
      "significance": "This treaty shaped the geopolitical landscape of Eastern Europe in the interwar period."
    },
    {
      "year": 1865,
      "title": "Alabama Joins the Confederate States",
      "description": "Alabama officially joined the Confederate States of America during the American Civil War.",
      "category": "Politics",
      "significance": "This represented a significant moment in the secession movement leading to the Civil War."
    },
    {
      "year": 1884,
      "title": "Washington Monument Completed",
      "description": "The Washington Monument in Washington, D.C., was officially completed and opened to the public after nearly 40 years of construction.",
      "category": "Architecture",
      "significance": "It became an iconic symbol of the United States and its first president, George Washington."
    },
    {
      "year": 1992,
      "title": "The Babri Masjid Demolished",
      "description": "A large group of Hindu activists demolished the Babri Masjid mosque in Ayodhya, India, sparking widespread religious riots and political upheaval.",
      "category": "Religion/Politics",
      "significance": "The event intensified Hindu-Muslim tensions in India and had significant political ramifications."
    }
  ]
}