{
  "date": "December 9",
  "events": [
    {
      "year": 1793,
      "title": "Execution of Queen Marie Antoinette",
      "description": "Marie Antoinette, former Queen of France, was executed by guillotine during the French Revolution.",
      "category": "Political History",
      "significance": "Marked a turning point in the Revolution by symbolizing the fall of the monarchy and the rise of the French Republic."
    },
    {
      "year": 1905,
      "title": "Alabama Constitution Grants Women Limited Voting Rights",
      "description": "The state of Alabama granted women the right to vote on school-related issues, one of the earliest examples of women's suffrage in the United States.",
      "category": "Social History",
      "significance": "An early milestone in the American women's suffrage movement, preceding the 19th Amendment by 15 years."
    },
    {
      "year": 1950,
      "title": "Battle of the Chosin Reservoir Begins",
      "description": "During the Korean War, UN forces under General Douglas MacArthur faced a massive Chinese offensive at the Chosin Reservoir in North Korea.",
      "category": "Military History",
      "significance": "A significant and brutal battle that influenced the course and intensity of the Korean War."
    },
    {
      "year": 1990,
      "title": "Lech Wałęsa Elected President of Poland",
      "description": "Lech Wałęsa, former leader of the Solidarity movement, was elected the first democratically elected president of Poland after communist rule.",
      "category": "Political History",
      "significance": "Symbolized the end of communist control in Poland and the transition to democracy and market economy in Eastern Europe."
    },
    {
      "year": 1979,
      "title": "The Soviet Union Invades Afghanistan",
      "description": "Although not precisely December 9, the Soviet military intervention in Afghanistan had ongoing significant events around this date, marking the start of a decade-long conflict.",
      "category": "Military History",
      "significance": "Initiated a prolonged conflict that affected Cold War dynamics globally."
    }
  ]
}