{
  "date": "December 12",
  "events": [
    {
      "year": 1901,
      "title": "First Transatlantic Radio Signal Received",
      "description": "Guglielmo Marconi received the first transatlantic radio signal in St. John's, Newfoundland, marking a breakthrough in global wireless communication.",
      "category": "Technology",
      "significance": "This event demonstrated the potential of wireless communication across vast distances, laying the foundation for modern global communication systems."
    },
    {
      "year": 1911,
      "title": "Norway Claims Queen Maud Land in Antarctica",
      "description": "Norway formally claimed Queen Maud Land in Antarctica, expanding territorial claims on the southern continent.",
      "category": "Exploration",
      "significance": "This claim was part of early 20th-century territorial assertions during the age of Antarctic exploration, influencing future international treaties."
    },
    {
      "year": 1963,
      "title": "Kenya Gains Independence from the United Kingdom",
      "description": "Kenya officially became an independent nation after decades of colonial rule under the British Empire.",
      "category": "Political",
      "significance": "Kenya's independence marked a major step in the decolonization of Africa and inspired other nations seeking self-rule."
    },
    {
      "year": 1979,
      "title": "The Shah of Iran Leaves the Country",
      "description": "Mohammad Reza Pahlavi, the Shah of Iran, left Iran amid growing unrest, leading to the Islamic Revolution.",
      "category": "Political",
      "significance": "His departure signaled the collapse of the monarchy and the rise of the Islamic Republic, drastically changing Iran’s political landscape."
    },
    {
      "year": 2000,
      "title": "Chief Joseph Brings Charges Against US Government",
      "description": "Chief Joseph, leader of the Nez Perce, is posthumously honored as the U.S. government acknowledged historical injustices against Native Americans.",
      "category": "Cultural",
      "significance": "The recognition marked progress in acknowledging Native American rights and attempting reconciliation for historical wrongs."
    }
  ]
}