{
  "date": "December 14",
  "events": [
    {
      "year": 1542,
      "title": "Death of Mary, Queen of Scots",
      "description": "Mary, Queen of Scots was executed for her involvement in plots to assassinate Queen Elizabeth I of England.",
      "category": "Death",
      "significance": "Her death marked a significant moment in the Elizabethan era, intensifying the conflict between Scotland and England and influencing the succession of the English throne."
    },
    {
      "year": 1819,
      "title": "Alabama admitted to the United States",
      "description": "Alabama was admitted as the 22nd state of the United States.",
      "category": "Political Milestone",
      "significance": "This expanded the United States territory, intensifying regional conflicts over slavery and state rights ahead of the American Civil War."
    },
    {
      "year": 1911,
      "title": "South Pole claimed by Roald Amundsen",
      "description": "Norwegian explorer Roald Amundsen and his team became the first to reach the South Pole.",
      "category": "Exploration",
      "significance": "This achievement marked a major milestone in polar exploration and scientific discovery."
    },
    {
      "year": 1944,
      "title": "Venice Canal Bombing during World War II",
      "description": "Allied forces bombed Venice in an attempt to disrupt German supply lines, causing significant damage including to cultural landmarks.",
      "category": "War",
      "significance": "The bombing highlighted the widespread destruction of cultural heritage during wartime and the strategic importance of Venice."
    },
    {
      "year": 2012,
      "title": "Sandy Hook Elementary School shooting",
      "description": "A mass shooting occurred at Sandy Hook Elementary School in Newtown, Connecticut, resulting in the deaths of 26 people, including 20 children.",
      "category": "Tragedy",
      "significance": "This tragic event led to renewed debates on gun control and school safety in the United States."
    }
  ]
}