{
  "date": "December 15",
  "events": [
    {
      "year": 1791,
      "title": "Ratification of the United States Bill of Rights",
      "description": "The first ten amendments to the United States Constitution, known as the Bill of Rights, were ratified, guaranteeing fundamental rights and freedoms to American citizens.",
      "category": "Political",
      "significance": "Established core civil liberties and checks on government power that shape US law and society."
    },
    {
      "year": 1939,
      "title": "Battle of Nanchang begins",
      "description": "During the Second Sino-Japanese War, Chinese and Japanese forces fought the Battle of Nanchang, marking the first major Chinese offensive against the invading Japanese.",
      "category": "Military",
      "significance": "Demonstrated Chinese resistance and strategic counterattacks during the war."
    },
    {
      "year": 1961,
      "title": "UN General Assembly adopts Resolution 1721",
      "description": "The United Nations General Assembly passed a resolution addressing issues relating to the establishment and recognition of decolonization and self-determination.",
      "category": "International Relations",
      "significance": "Supported global movements for independence and self-determination during decolonization period."
    },
    {
      "year": 1970,
      "title": "The Jackson 5 release 'I Want You Back' single",
      "description": "The popular Motown group The Jackson 5 released their debut single, which became a number one hit and launched their successful career.",
      "category": "Music/Culture",
      "significance": "Signaled the rise of one of the most influential musical acts, impacting pop and soul music."
    },
    {
      "year": 2001,
      "title": "The Leaning Tower of Pisa reopened",
      "description": "After 11 years of restoration efforts to stabilize the structure, the Leaning Tower of Pisa was reopened to the public.",
      "category": "Cultural Heritage",
      "significance": "Preserved a famous architectural landmark and tourist attraction, symbolizing engineering achievement and cultural history."
    }
  ]
}