{
  "date": "December 17",
  "events": [
    {
      "year": 1903,
      "title": "Wright Brothers' First Powered Flight",
      "description": "Orville and Wilbur Wright made the first controlled, sustained flight of a powered, heavier-than-air aircraft at Kitty Hawk, North Carolina.",
      "category": "Aviation",
      "significance": "This event marked the beginning of modern aeronautics and the development of the aviation industry."
    },
    {
      "year": 1989,
      "title": "Fall of Romanian Dictator Nicolae Ceaușescu",
      "description": "Nicolae Ceaușescu and his wife Elena fled Bucharest as the Romanian Revolution took a decisive turn; they were later captured and executed on Christmas Day.",
      "category": "Political Revolution",
      "significance": "This was a pivotal moment in the fall of communism in Eastern Europe and the end of a brutal dictatorship."
    },
    {
      "year": 1777,
      "title": "Congress Adopts the Articles of Confederation",
      "description": "The Continental Congress adopted the Articles of Confederation, the first constitution of the United States, establishing a form of national government.",
      "category": "Political Milestone",
      "significance": "It laid the foundation for the governance of the newly independent United States before the current Constitution."
    },
    {
      "year": 1960,
      "title": "First Laser Invented by Theodore Maiman",
      "description": "The first working laser was demonstrated by physicist Theodore Maiman at Hughes Research Laboratories.",
      "category": "Scientific Achievement",
      "significance": "This invention revolutionized technology, medicine, and communications, leading to numerous practical applications."
    },
    {
      "year": 2010,
      "title": "South Korean Naval Ship Sinks",
      "description": "The South Korean navy ship ROKS Cheonan sank near the disputed border with North Korea, causing the death of 46 sailors.",
      "category": "Military Incident",
      "significance": "The sinking escalated tensions between North and South Korea and led to international investigations and condemnation."
    }
  ]
}