{
  "date": "December 22",
  "events": [
    {
      "year": 1807,
      "title": "United States Embargo Act Passed",
      "description": "The U.S. Congress enacted the Embargo Act, which prohibited American ships from trading in all foreign ports, aiming to pressure Britain and France during the Napoleonic Wars but causing economic hardship in the U.S.",
      "category": "Political/Legislative",
      "significance": "This act marked a major shift in U.S. foreign policy and had significant economic ramifications, leading eventually to the War of 1812."
    },
    {
      "year": 1894,
      "title": "First Sino-Japanese War Begins",
      "description": "Japan launched a surprise attack on the Chinese fleet at the Battle of Pungdo near the Korean Peninsula, marking the beginning of the First Sino-Japanese War.",
      "category": "Military",
      "significance": "This conflict demonstrated Japan's rising military power and shifted the balance of power in East Asia, leading to Japanese dominance in Korea and Taiwan."
    },
    {
      "year": 1956,
      "title": "Egypt Nationalizes the Suez Canal",
      "description": "Egyptian President Gamal Abdel Nasser announced the nationalization of the Suez Canal, which had been controlled by British and French interests.",
      "category": "Political/International Relations",
      "significance": "This action precipitated the Suez Crisis, a major Cold War confrontation and conflict involving Egypt, Israel, Britain, and France."
    },
    {
      "year": 1808,
      "title": "Birth of Clara Barton",
      "description": "Clara Barton, future nurse and founder of the American Red Cross, was born in Massachusetts, U.S.",
      "category": "Births/People",
      "significance": "Barton became a pioneering figure in nursing and humanitarian aid, significantly advancing emergency medical aid and disaster relief."
    },
    {
      "year": 1937,
      "title": "Birth of Frank Zappa",
      "description": "Frank Zappa, influential American musician and composer known for his eclectic music style and social commentary, was born.",
      "category": "Births/People",
      "significance": "Zappa had a lasting impact on music, especially in experimental rock and satire."
    }
  ]
}