{
  "date": "December 28",
  "events": [
    {
      "year": 1065,
      "title": "Consecration of Westminster Abbey",
      "description": "Westminster Abbey in London was consecrated, becoming a significant religious and cultural landmark.",
      "category": "Architecture/Religion",
      "significance": "Westminster Abbey has been the site of numerous royal ceremonies, including coronations and weddings, and remains a symbol of British heritage."
    },
    {
      "year": 1832,
      "title": "The UK Reform Act 1832 receives Royal Assent",
      "description": "The UK Reform Act 1832, also known as the Great Reform Act, was enacted, reforming the electoral system of England and Wales.",
      "category": "Politics",
      "significance": "This act was a key step in the democratic development of the UK, broadening the electorate and eliminating many 'rotten boroughs'."
    },
    {
      "year": 1895,
      "title": "First Commercial Movie Screening",
      "description": "The first commercial public screening of movies took place at the Grand Café in Paris by the Lumière brothers.",
      "category": "Technology/Entertainment",
      "significance": "This event marks the birth of the cinema industry, revolutionizing entertainment worldwide."
    },
    {
      "year": 1898,
      "title": "Spanish–American War ends with Treaty of Paris",
      "description": "The Treaty of Paris was signed, ending the Spanish–American War and transferring Puerto Rico, Guam, and the Philippines to the United States.",
      "category": "International Relations/War",
      "significance": "This treaty marked the emergence of the United States as a global colonial power."
    },
    {
      "year": 1972,
      "title": "Nixon's 'Silent Majority' Speech",
      "description": "President Richard Nixon delivered a televised speech appealing to the 'silent majority' to support his policies in Vietnam.",
      "category": "Politics",
      "significance": "This speech was significant in shaping public opinion on the Vietnam War during a turbulent period in US history."
    }
  ]
}