{
  "date": "December 29",
  "events": [
    {
      "year": 1170,
      "title": "Assassination of Thomas Becket",
      "description": "Thomas Becket, Archbishop of Canterbury, was murdered inside Canterbury Cathedral by knights loyal to King Henry II of England.",
      "category": "Political",
      "significance": "This event caused a major conflict between the church and the monarchy, leading to Becket's martyrdom and sainthood."
    },
    {
      "year": 1845,
      "title": "Texas Admitted to the United States",
      "description": "Texas was admitted as the 28th state of the United States, following its independence from Mexico.",
      "category": "Political",
      "significance": "This admission intensified disputes that contributed to the Mexican-American War and shaped U.S. territorial expansion."
    },
    {
      "year": 1890,
      "title": "Death of Sitting Bull",
      "description": "Native American leader Sitting Bull was killed by Indian police during an attempt to arrest him, fearing he would join the Ghost Dance movement.",
      "category": "Social/Political",
      "significance": "His death marked a turning point in the U.S. government's efforts to suppress Native American resistance."
    },
    {
      "year": 1937,
      "title": "First Successful Flight of the Douglas DC-4",
      "description": "The prototype of the Douglas DC-4, a four-engine propeller-driven airliner, completed its first flight.",
      "category": "Technological",
      "significance": "The DC-4 became a highly successful aircraft in both commercial aviation and military transport during and after World War II."
    },
    {
      "year": 1972,
      "title": "Apollo 17 Returns to Earth",
      "description": "The last manned mission of NASA's Apollo program, Apollo 17, splashed down safely in the Pacific Ocean.",
      "category": "Scientific/Space Exploration",
      "significance": "Apollo 17 marked the final mission of the Apollo lunar program, ending an era of human exploration of the Moon."
    }
  ]
}