{
  "date": "October 3",
  "events": [
    {
      "year": 1990,
      "title": "German Reunification",
      "description": "East Germany and West Germany were officially reunited into a single German state after decades of division since World War II.",
      "category": "Political",
      "significance": "Marked the end of the Cold War division in Germany and was a pivotal moment in European history, symbolizing the victory of democracy and unity."
    },
    {
      "year": 1863,
      "title": "Formation of the International Red Cross",
      "description": "The International Committee of the Red Cross was officially formed to provide humanitarian aid in war zones and disaster areas worldwide.",
      "category": "Humanitarian",
      "significance": "Led to the development of international humanitarian law and the Geneva Conventions, shaping how wars are conducted with regard to civilians and prisoners."
    },
    {
      "year": 1967,
      "title": "The Canada Border Services Agency Established",
      "description": "The official establishment of border services in Canada, marking the control and regulation of goods and people entering or leaving the country.",
      "category": "Political/Economic",
      "significance": "Improved national security and trade regulation for Canada, fostering economic development and border integrity."
    },
    {
      "year": 1993,
      "title": "Debut of the Mosaic Web Browser",
      "description": "The release of the first widely-used graphical web browser, Mosaic, revolutionized how people accessed and navigated the internet.",
      "category": "Technological",
      "significance": "Catalyzed the growth and popularization of the World Wide Web, laying the foundation for the modern internet era."
    },
    {
      "year": 1932,
      "title": "Birth of Julie Andrews",
      "description": "Julie Andrews, acclaimed British actress and singer, known for iconic roles in films such as 'Mary Poppins' and 'The Sound of Music,' was born.",
      "category": "Cultural",
      "significance": "Her contributions to film and musical theatre have had lasting influence in entertainment and popular culture worldwide."
    }
  ]
}