{
  "date": "October 11",
  "events": [
    {
      "year": 1492,
      "title": "Christopher Columbus Lands in the Americas",
      "description": "Christopher Columbus and his crew land on an island in the Bahamas during his first voyage across the Atlantic, marking the beginning of sustained European exploration and colonization of the Americas.",
      "category": "Exploration",
      "significance": "This event led to widespread contact between Europe and the Americas, profoundly influencing global history by initiating cultural exchange, colonization, and the eventual rise of European empires in the New World."
    },
    {
      "year": 1968,
      "title": "Tommie Smith and John Carlos Raise Black Power Salute at the Olympics",
      "description": "At the Mexico City Olympics, American athletes Tommie Smith and John Carlos raise their fists in a Black Power salute during the medal ceremony for the 200 meters, drawing global attention to civil rights issues in the United States.",
      "category": "Civil Rights",
      "significance": "This iconic protest highlighted racial inequality and injustice, becoming a defining moment in the civil rights movement and in the intersection of sports and social activism."
    },
    {
      "year": 1984,
      "title": "Mother Teresa Awarded the Nobel Peace Prize",
      "description": "Mother Teresa is awarded the Nobel Peace Prize for her humanitarian work with the poor and sick in Calcutta (Kolkata), India.",
      "category": "Humanitarian",
      "significance": "The award recognized her life's work helping marginalized populations, inspiring global efforts toward compassion and charity."
    },
    {
      "year": 1970,
      "title": "Fiji Gains Independence from the United Kingdom",
      "description": "Fiji officially gains independence as a sovereign nation from British colonial rule.",
      "category": "Political Milestone",
      "significance": "This marked the end of colonial rule and the beginning of Fiji's self-governance and development as an independent nation."
    }
  ]
}