{
  "date": "October 25",
  "events": [
    {
      "year": 1415,
      "title": "Battle of Agincourt",
      "description": "King Henry V of England led his outnumbered forces to a decisive victory against the French during the Hundred Years' War.",
      "category": "Military",
      "significance": "This battle enhanced English prestige and Henry V's reputation, influencing the course of the Hundred Years' War."
    },
    {
      "year": 1854,
      "title": "Charge of the Light Brigade",
      "description": "A disastrous British cavalry charge against Russian forces during the Battle of Balaclava in the Crimean War.",
      "category": "Military",
      "significance": "The event became emblematic of bravery and the futility of war, immortalized in Alfred Lord Tennyson's poem."
    },
    {
      "year": 1917,
      "title": "October Revolution in Russia begins",
      "description": "The Bolsheviks led by Vladimir Lenin launched an armed insurrection against the Provisional Government, marking the start of communist rule in Russia.",
      "category": "Political",
      "significance": "This event led to the establishment of the Soviet Union, profoundly impacting global politics in the 20th century."
    },
    {
      "year": 1944,
      "title": "Liberation of the Philippines' capital Manila",
      "description": "Filipino and American forces recaptured Manila from Japanese troops during World War II.",
      "category": "Military",
      "significance": "The liberation was a crucial step towards ending Japanese occupation and restoring Philippine sovereignty."
    },
    {
      "year": 1971,
      "title": "United Nations expels Taiwan (Republic of China)",
      "description": "The UN General Assembly passed Resolution 2758, recognizing the People's Republic of China as the only legitimate representative of China in the United Nations.",
      "category": "Political",
      "significance": "This shifted international recognition and had significant diplomatic implications during the Cold War era."
    }
  ]
}