{
  "date": "October 26",
  "events": [
    {
      "year": 1863,
      "title": "Battle of Bristoe Station",
      "description": "During the American Civil War, Union forces under Major General Gouverneur K. Warren repelled Confederate attacks led by General A.P. Hill, marking a tactical Union victory in Northern Virginia.",
      "category": "Military",
      "significance": "This battle halted the Confederate advance toward Washington, D.C., strengthening Union control in the region."
    },
    {
      "year": 1881,
      "title": "Gunfight at the O.K. Corral",
      "description": "A famous 30-second shootout erupted near Tombstone, Arizona Territory, involving lawmen Wyatt Earp, Doc Holliday, and the Clanton-McLaury gang.",
      "category": "Crime/Western History",
      "significance": "The gunfight became an iconic symbol of the American Wild West law enforcement and outlaw conflicts."
    },
    {
      "year": 1905,
      "title": "First Russian Revolution Begins",
      "description": "Bloody Sunday protests escalated in Saint Petersburg, marking the start of widespread unrest in Russia against Tsarist autocracy.",
      "category": "Political",
      "significance": "These events presaged the 1905 Russian Revolution, which led to limited reforms and set the stage for future upheavals."
    },
    {
      "year": 1955,
      "title": "Change in U.S. Supreme Court Chief Justice",
      "description": "Earl Warren was appointed as Chief Justice of the United States Supreme Court.",
      "category": "Judiciary",
      "significance": "Under Warren's leadership, the court would deliver landmark decisions advancing civil rights and liberties."
    },
    {
      "year": 1977,
      "title": "First Woman to Command a U.S. Naval Ship",
      "description": "Lt. Commander Beverly Kelley took command of the USS Opportune (ARS-41), the first woman to do so in the U.S. Navy.",
      "category": "Military/Social Progress",
      "significance": "This milestone marked significant progress in gender equality within the United States armed forces."
    }
  ]
}