{
  "date": "October 31",
  "events": [
    {
      "year": 1517,
      "title": "Martin Luther's Ninety-Five Theses",
      "description": "Martin Luther nailed his Ninety-Five Theses to the door of the Wittenberg Castle church, challenging the Catholic Church's practices and sparking the Protestant Reformation.",
      "category": "Religious/Reformation",
      "significance": "This act is widely regarded as the beginning of the Protestant Reformation, leading to significant religious, cultural, and political changes in Europe."
    },
    {
      "year": 1864,
      "title": "The Sand Creek Massacre",
      "description": "A tragic massacre occurred in Colorado Territory where U.S. troops attacked and destroyed a village of Cheyenne and Arapaho people, killing many, including women and children.",
      "category": "Military/Native American History",
      "significance": "The event intensified conflicts between Native American tribes and the U.S. government, highlighting the brutal realities of American westward expansion."
    },
    {
      "year": 1922,
      "title": "Howard Carter Unseals Tutankhamun's Tomb",
      "description": "British archaeologist Howard Carter and his team unsealed the burial chamber of the Egyptian Pharaoh Tutankhamun in the Valley of the Kings.",
      "category": "Archaeology",
      "significance": "This discovery was one of the most significant archaeological findings, providing unprecedented insight into ancient Egyptian culture and burial practices."
    },
    {
      "year": 1956,
      "title": "Sudan Gains Independence",
      "description": "Sudan officially gained independence from joint British-Egyptian rule, becoming a sovereign nation.",
      "category": "Political/Independence",
      "significance": "Sudan's independence marked a major step in the decolonization of Africa and the reshaping of post-colonial nations."
    },
    {
      "year": 1991,
      "title": "The First Gulf War Ends",
      "description": "Iraq formally accepted United Nations resolutions, leading to the end of the Gulf War after a decisive coalition victory.",
      "category": "Military/International Relations",
      "significance": "The end of the Gulf War reshaped Middle Eastern geopolitics and demonstrated the effectiveness of multinational coalitions under the UN umbrella."
    }
  ]
}