{
  "date": "January 2",
  "plants": [
    {
      "name": "Camellia japonica",
      "commonName": "Camellia",
      "description": "An evergreen shrub valued for its large, showy flowers that bloom in winter, often used as ornamental plants in gardens and parks.",
      "bloomingSeason": "December to March",
      "location": "Temperate regions of East Asia, cultivated worldwide in mild climates",
      "colors": [
        "red",
        "pink",
        "white"
      ],
      "emoji": "🌺",
      "funFact": "Camellias are among the few plants that bloom during the cold winter months, providing important nectar for pollinators in scarce conditions."
    },
    {
      "name": "Cistus (Rockrose)",
      "commonName": "Rockrose",
      "description": "A genus of drought-tolerant shrubs with papery flowers that open in the cooler months, commonly found in Mediterranean climates.",
      "bloomingSeason": "Late autumn to early spring",
      "location": "Mediterranean Basin",
      "colors": [
        "pink",
        "white"
      ],
      "emoji": "🌸",
      "funFact": "Rockroses produce sticky resins historically used in varnishes and perfumes."
    },
    {
      "name": "Helleborus niger",
      "commonName": "Christmas Rose",
      "description": "A perennial evergreen plant with white flowers often blooming in the depths of winter, traditionally associated with Christmas time.",
      "bloomingSeason": "December to February",
      "location": "Mountainous regions of Europe, cultivated in temperate gardens",
      "colors": [
        "white"
      ],
      "emoji": "🌼",
      "funFact": "Despite its common name, the Christmas Rose is not a true rose; it has been used medicinally in traditional European herbal medicine."
    },
    {
      "name": "Acacia dealbata",
      "commonName": "Silver Wattle",
      "description": "A fast-growing tree known for its bright yellow, fragrant flower clusters that bloom in late winter to early spring.",
      "bloomingSeason": "January to March",
      "location": "Australia, also widely cultivated in Mediterranean climates",
      "colors": [
        "yellow"
      ],
      "emoji": "🌼",
      "funFact": "Silver Wattle flowers are often used in floral arrangements during winter due to their cheerful color and fragrance."
    }
  ]
}