{
  "date": "January 10",
  "plants": [
    {
      "name": "Camellia japonica",
      "commonName": "Japanese Camellia",
      "description": "An evergreen shrub known for its large, showy flowers that bloom in late winter to early spring. The flowers can be single or double and come in white, pink, red, or variegated colors.",
      "bloomingSeason": "November to March",
      "location": "Temperate gardens worldwide, native to Japan, Korea, and China",
      "colors": [
        "pink",
        "red",
        "white"
      ],
      "emoji": "🌺",
      "funFact": "Camellia japonica is highly prized in East Asia for its ornamental flowers and is also the species from which tea (Camellia sinensis) was first derived."
    },
    {
      "name": "Mimosa pudica",
      "commonName": "Sensitive Plant",
      "description": "A tropical plant famous for its leaves that fold inward when touched or shaken, a defense mechanism. It produces small, fluffy pink or purple flowers resembling pom-poms.",
      "bloomingSeason": "Year-round in tropical climates, including January",
      "location": "Native to South America but widely naturalized in tropical regions worldwide",
      "colors": [
        "pink",
        "purple"
      ],
      "emoji": "🌸",
      "funFact": "Mimosa pudica is often used in studies of plant neurobiology due to its rapid leaf movements in response to stimuli."
    },
    {
      "name": "Helleborus niger",
      "commonName": "Christmas Rose",
      "description": "A perennial plant that blooms in late winter, around Christmas and into January. It produces large, white to pinkish flowers that add color to winter gardens.",
      "bloomingSeason": "December to February",
      "location": "European mountainous regions",
      "colors": [
        "white",
        "pink"
      ],
      "emoji": "❄️",
      "funFact": "Despite its common name, the Christmas Rose is not a true rose but belongs to the buttercup family (Ranunculaceae)."
    },
    {
      "name": "Eucalyptus globulus",
      "commonName": "Tasmanian Blue Gum",
      "description": "A tall evergreen tree known for its aromatic leaves and clusters of white flowers that bloom unpredictably throughout the year, including winter months in Australia.",
      "bloomingSeason": "Varies, often including January in Australia",
      "location": "Native to Tasmania and southeastern Australia",
      "colors": [
        "white"
      ],
      "emoji": "🌿",
      "funFact": "Eucalyptus oil extracted from its leaves is widely used for medicinal purposes and as a natural insect repellent."
    }
  ]
}