{
  "date": "January 12",
  "plants": [
    {
      "name": "Camellia japonica",
      "commonName": "Japanese Camellia",
      "description": "A popular ornamental evergreen shrub native to eastern and southern Asia, known for its large, showy flowers that often bloom in winter to early spring, providing color in colder months.",
      "bloomingSeason": "November to March",
      "location": "East Asia (Japan, China, Korea); widely cultivated in temperate regions worldwide",
      "colors": [
        "Red",
        "Pink",
        "White"
      ],
      "emoji": "🌺",
      "funFact": "Camellia japonica flowers were historically used to make tea before Camellia sinensis became popular."
    },
    {
      "name": "Crocus sativus",
      "commonName": "Saffron Crocus",
      "description": "A small perennial flowering plant famed for its crimson stigmas which are harvested as saffron spice. It blooms in late autumn to early winter and is cultivated in Mediterranean climates.",
      "bloomingSeason": "October to January",
      "location": "Mediterranean, Iran, Spain, India (Kashmir)",
      "colors": [
        "Purple",
        "Lilac"
      ],
      "emoji": "🌸",
      "funFact": "Saffron crocus stigmas are the most expensive spice by weight due to labor-intensive harvesting."
    },
    {
      "name": "Helleborus niger",
      "commonName": "Christmas Rose",
      "description": "A herbaceous perennial known for blooming in winter, often around Christmas and early January. Its waxy white flowers appear on leafless stems, brightening shady gardens.",
      "bloomingSeason": "December to February",
      "location": "Central and Southern Europe",
      "colors": [
        "White",
        "Pink"
      ],
      "emoji": "❄️",
      "funFact": "Despite its common name, the Christmas Rose is not related to true roses and is toxic if ingested."
    },
    {
      "name": "Banksia serrata",
      "commonName": "Old Man Banksia",
      "description": "An Australian native tree with large cylindrical flower spikes that appear mostly in winter and spring, attracting birds and mammals with nectar-rich flowers.",
      "bloomingSeason": "May to January (peak bloom in Jan in some areas)",
      "location": "Eastern Australia",
      "colors": [
        "Yellow",
        "Orange"
      ],
      "emoji": "🌻",
      "funFact": "Banksia flowers are made up of hundreds of tiny flowers packed together, creating the characteristic flower spikes."
    }
  ]
}