{
  "date": "January 19",
  "plants": [
    {
      "name": "Camellia japonica",
      "commonName": "Japanese Camellia",
      "description": "An evergreen shrub prized for its large, rose-like flowers that bloom in winter, Camellia japonica is widely cultivated in temperate regions. Flowers have waxy petals and appear in shades of red, pink, or white. It thrives in acid soils with good drainage.",
      "bloomingSeason": "November to March",
      "location": "East Asia (native), gardens in temperate zones worldwide",
      "colors": [
        "red",
        "pink",
        "white"
      ],
      "emoji": "🌺",
      "funFact": "Camellia japonica flowers inspired the name of the beverage 'camellia sinensis', the tea plant, although they are different species."
    },
    {
      "name": "Hamamelis virginiana",
      "commonName": "Witch Hazel",
      "description": "A deciduous shrub or small tree notable for its fragrant, slender ribbon-like yellow flowers that bloom in late fall through winter, often after leaves have fallen. It is a native species to eastern North America and used medicinally for its astringent properties.",
      "bloomingSeason": "October to January",
      "location": "Eastern North America",
      "colors": [
        "yellow"
      ],
      "emoji": "🌼",
      "funFact": "Witch Hazel extracts are commonly used in skincare for minimizing skin irritation and inflammation."
    },
    {
      "name": "Prunus mume",
      "commonName": "Japanese Apricot / Chinese Plum",
      "description": "A deciduous tree known for its early blooming fragrant flowers in late winter and early spring. The flowers are usually pink or white and often bloom before the leaves emerge. It is culturally significant in East Asia, symbolizing perseverance and hope.",
      "bloomingSeason": "January to March",
      "location": "China, Japan, Korea",
      "colors": [
        "pink",
        "white"
      ],
      "emoji": "🌸",
      "funFact": "Prunus mume blossoms often appear on the lunar new year and are associated with renewal and the coming spring."
    },
    {
      "name": "Clivia miniata",
      "commonName": "Kaffir Lily",
      "description": "An evergreen perennial from South Africa, Clivia miniata blooms indoors and outdoors in mild climates during winter and early spring. It produces clusters of trumpet-shaped, bright orange flowers on tall stalks above strap-like leaves.",
      "bloomingSeason": "December to February",
      "location": "South Africa; cultivated globally as a houseplant",
      "colors": [
        "orange"
      ],
      "emoji": "🧡",
      "funFact": "Clivia miniata was named after Lady Charlotte Clive who received the plant in the 19th century."
    }
  ]
}