{
  "date": "January 26",
  "plants": [
    {
      "name": "Crocus sativus",
      "commonName": "Saffron Crocus",
      "description": "A small, early spring-blooming perennial known for its delicate purple flowers with vivid orange stigmas that are harvested as the spice saffron. It often blooms in late winter to early spring, especially in Mediterranean climates.",
      "bloomingSeason": "January to March",
      "location": "Mediterranean region, parts of Iran, Spain, and India (Kashmir)",
      "colors": [
        "purple",
        "orange"
      ],
      "emoji": "🌸",
      "funFact": "Saffron crocus stigmas are the source of the world's most expensive spice by weight."
    },
    {
      "name": "Camellia japonica",
      "commonName": "Japanese Camellia",
      "description": "An evergreen shrub or small tree with glossy leaves and large, showy flowers ranging in color from white to deep pink and red. Camellias bloom from late autumn to early spring, bringing color to winter gardens especially in temperate climates.",
      "bloomingSeason": "November to March",
      "location": "East Asia (native), cultivated widely in temperate regions worldwide",
      "colors": [
        "white",
        "pink",
        "red"
      ],
      "emoji": "🌺",
      "funFact": "Camellia japonica flowers were highly prized in ancient Japan and often featured in art and poetry."
    },
    {
      "name": "Acacia dealbata",
      "commonName": "Silver Wattle",
      "description": "An Australian native tree recognizable by its bright yellow fluffy flower balls that bloom profusely in winter. It is widely cultivated and naturalized in Mediterranean and subtropical climates.",
      "bloomingSeason": "January to March",
      "location": "Australia (native), Mediterranean climates (cultivated)",
      "colors": [
        "yellow"
      ],
      "emoji": "🌼",
      "funFact": "The flowers have a strong fragrance and are important for early season pollinators."
    },
    {
      "name": "Anemone coronaria",
      "commonName": "Poppy Anemone",
      "description": "A tuberous perennial that produces vibrant, poppy-like flowers in late winter and early spring. It is native to the Mediterranean region, often blooming in wild habitats and gardens.",
      "bloomingSeason": "January to April",
      "location": "Mediterranean Basin",
      "colors": [
        "red",
        "white",
        "purple",
        "blue"
      ],
      "emoji": "🌺",
      "funFact": "Anemone coronaria is a symbolic flower in parts of the Mediterranean and features prominently in folklore."
    }
  ]
}