{
  "date": "January 27",
  "plants": [
    {
      "name": "Camellia japonica",
      "commonName": "Japanese Camellia",
      "description": "A popular evergreen shrub with glossy leaves and large, showy flowers that bloom in mid-winter to early spring. It thrives in temperate climates and is commonly cultivated in gardens for its ornamental value.",
      "bloomingSeason": "December to March",
      "location": "Japan, China, southeastern United States, temperate gardens worldwide",
      "colors": [
        "red",
        "pink",
        "white"
      ],
      "emoji": "🌺",
      "funFact": "Camellia japonica flowers are edible and sometimes used in teas, especially the related Camellia sinensis species which is the source of tea leaves."
    },
    {
      "name": "Erica carnea",
      "commonName": "Winter Heath",
      "description": "A low-growing evergreen shrub that blooms in late winter to early spring, producing bell-shaped flowers. It is well-suited to alpine and subalpine regions and ornamental rockeries.",
      "bloomingSeason": "December to April",
      "location": "Central and southern Europe mountainous regions",
      "colors": [
        "pink",
        "purple"
      ],
      "emoji": "🌸",
      "funFact": "Winter heath can survive harsh winter conditions and often requires snow cover for protection."
    },
    {
      "name": "Helleborus niger",
      "commonName": "Christmas Rose",
      "description": "A herbaceous perennial that blooms in mid-winter with large white flowers that sometimes have a pinkish tint. It grows naturally in the mountainous regions of central and southern Europe.",
      "bloomingSeason": "December to February",
      "location": "Alps and other mountainous areas of Europe",
      "colors": [
        "white",
        "pink"
      ],
      "emoji": "❄️🌹",
      "funFact": "Despite its common name, Christmas Rose is not a true rose but a member of the buttercup family (Ranunculaceae). Its flowers can bloom through snow."
    },
    {
      "name": "Banksia integrifolia",
      "commonName": "Coast Banksia",
      "description": "A coastal tree native to eastern Australia that produces cylindrical golden flower spikes. It blooms sporadically throughout the year, often including summer and winter months.",
      "bloomingSeason": "Year-round, with peak flowering in summer and winter",
      "location": "Coastal eastern Australia",
      "colors": [
        "yellow",
        "orange"
      ],
      "emoji": "🌼",
      "funFact": "Banksia integrifolia is important for local wildlife, providing nectar for birds and mammals during times when few other flowers are available."
    }
  ]
}