{
  "date": "January 31",
  "plants": [
    {
      "name": "Witch Hazel",
      "commonName": "Witch Hazel",
      "description": "A deciduous shrub known for its fragrant, spidery yellow flowers that often bloom in late winter before the leaves appear. It thrives in temperate regions and is often found in woodland gardens.",
      "bloomingSeason": "January to March",
      "location": "Eastern North America, Japan, China",
      "colors": [
        "Yellow"
      ],
      "emoji": "🌼",
      "funFact": "Witch Hazel flowers release their pollen explosively in a rapid motion to aid pollination."
    },
    {
      "name": "Camellia japonica",
      "commonName": "Camellia",
      "description": "An evergreen shrub widely appreciated for its large, rose-like flowers which bloom in the winter and early spring. Commonly found in gardens across East Asia and cultivated globally.",
      "bloomingSeason": "November to March",
      "location": "East Asia, cultivated worldwide",
      "colors": [
        "Pink",
        "Red",
        "White"
      ],
      "emoji": "🌺",
      "funFact": "Camellia oil, extracted from the seeds, is used in cooking and cosmetics in Asia."
    },
    {
      "name": "Grevillea robusta",
      "commonName": "Silky Oak",
      "description": "A fast-growing, frost-tender tree native to eastern Australia with bright orange to yellow spider-like flowers. It blooms during the southern hemisphere summer and early autumn, continuing into January.",
      "bloomingSeason": "September to January",
      "location": "Eastern Australia",
      "colors": [
        "Orange",
        "Yellow"
      ],
      "emoji": "🌿",
      "funFact": "Despite its common name, Silky Oak is not a true oak but is valued for its decorative timber."
    },
    {
      "name": "Almond Tree",
      "commonName": "Almond Blossom",
      "description": "This deciduous tree produces delicate pale pink to white flowers that appear in late winter to early spring, heralding the coming growing season. It is widely cultivated for its nuts.",
      "bloomingSeason": "January to March",
      "location": "Mediterranean Basin, California, Middle East",
      "colors": [
        "Pink",
        "White"
      ],
      "emoji": "🌸",
      "funFact": "Almond blossoms are one of the earliest flowering trees in Mediterranean climates, often blooming even before leaves emerge."
    }
  ]
}