{
  "date": "February 5",
  "events": [
    {
      "year": 1917,
      "title": "United States Breaks Diplomatic Ties with Germany",
      "description": "The United States government severed diplomatic relations with Germany during World War I, following Germany's resumption of unrestricted submarine warfare.",
      "category": "Diplomacy/War",
      "significance": "This marked a turning point that led the US to enter World War I on the side of the Allies."
    },
    {
      "year": 1958,
      "title": "Launch of Explorer 1, First U.S. Satellite",
      "description": "The United States successfully launched its first satellite, Explorer 1, into orbit, marking its entry into the space race.",
      "category": "Science/Technology",
      "significance": "It was the first American response to the Soviet Union's Sputnik, signifying a milestone in space exploration and Cold War competition."
    },
    {
      "year": 1971,
      "title": "Apollo 14 Lunar Landing",
      "description": "Astronauts Alan Shepard and Edgar Mitchell landed on the moon during the Apollo 14 mission, conducting scientific exploration on the lunar surface.",
      "category": "Space Exploration",
      "significance": "This mission helped advance human knowledge of the moon and proved the capabilities for sustained manned lunar missions."
    },
    {
      "year": 1937,
      "title": "Hans Asperger Publishes Autism Study",
      "description": "Austrian pediatrician Hans Asperger published a study describing a group of children with unique social and behavioral traits, later known as Asperger's syndrome.",
      "category": "Medicine/Psychology",
      "significance": "This work contributed to the understanding and diagnosis of autism spectrum disorders."
    },
    {
      "year": 1950,
      "title": "India's Constitution Comes into Effect",
      "description": "India officially adopted its Constitution, becoming a sovereign democratic republic.",
      "category": "Politics/Law",
      "significance": "Marked the establishment of India as an independent republic and the beginning of its democratic governance."
    }
  ]
}