{
  "date": "February 6",
  "events": [
    {
      "year": 1952,
      "title": "Accession of Queen Elizabeth II",
      "description": "Queen Elizabeth II ascended to the throne of the United Kingdom and other Commonwealth realms following the death of her father, King George VI.",
      "category": "Monarchy",
      "significance": "Marked the beginning of the longest reign of any British monarch, symbolizing stability and continuity in the UK and Commonwealth."
    },
    {
      "year": 1958,
      "title": "Munich Air Disaster",
      "description": "A plane carrying the Manchester United football team, along with supporters and journalists, crashed during takeoff in Munich, resulting in 23 deaths including 8 players.",
      "category": "Aviation Disaster",
      "significance": "A tragic event in sports history that deeply affected the football community and led to rebuilding of the team."
    },
    {
      "year": 1778,
      "title": "Captain James Cook Claims Hawaii for Britain",
      "description": "During his third voyage, Captain Cook and his crew made the first European contact with the Hawaiian Islands, initially naming them the Sandwich Islands.",
      "category": "Exploration",
      "significance": "Marked the introduction of Hawaii to Europe, which later influenced geopolitical dynamics and colonization in the Pacific."
    },
    {
      "year": 1840,
      "title": "Treaty of Waitangi Signed",
      "description": "Representatives of the British Crown and various Māori chiefs signed the Treaty of Waitangi in New Zealand, establishing British law while recognizing Māori rights.",
      "category": "Treaty/Colonial history",
      "significance": "Considered the founding document of New Zealand, shaping its legal and political framework and indigenous relations."
    },
    {
      "year": 1918,
      "title": "Grigori Rasputin Assassinated",
      "description": "Russian mystic and advisor to the Romanov family, Grigori Rasputin, was murdered by nobles who believed he was damaging the reputation of the monarchy.",
      "category": "Political History",
      "significance": "His assassination symbolized the growing unrest in Russia leading up to the revolution and the fall of the Romanov dynasty."
    }
  ]
}