{
  "date": "February 8",
  "events": [
    {
      "year": 1587,
      "title": "Execution of Mary, Queen of Scots",
      "description": "Mary, Queen of Scots was executed at Fotheringhay Castle for her involvement in plots to assassinate Queen Elizabeth I of England.",
      "category": "Political/Monarchical",
      "significance": "This event marked the end of Mary’s claim to the English throne and intensified the conflict between England and Catholic Europe."
    },
    {
      "year": 1904,
      "title": "Russo-Japanese War Begins",
      "description": "Japan launched a surprise naval attack on the Russian fleet at Port Arthur, starting the Russo-Japanese War.",
      "category": "Military/War",
      "significance": "This war shifted the balance of power in East Asia, marking the first time an Asian power defeated a European one in modern history."
    },
    {
      "year": 1910,
      "title": "First International Women's Day Celebrated",
      "description": "The first International Women's Day was observed on February 8 in some countries to promote women's rights and suffrage.",
      "category": "Social/Political",
      "significance": "It helped catalyze the global movement for women's rights and gender equality."
    },
    {
      "year": 1971,
      "title": "Apollo 14 Returns to Earth",
      "description": "NASA's Apollo 14 mission, the third manned mission to the Moon, safely returned to Earth after successful lunar exploration.",
      "category": "Science/Space Exploration",
      "significance": "This mission contributed valuable scientific data and advancements in human spaceflight."
    },
    {
      "year": 2013,
      "title": "Ryutaro Hashimoto, Former Prime Minister of Japan, Dies",
      "description": "Ryutaro Hashimoto, influential Japanese politician and two-time Prime Minister known for economic reforms, passed away.",
      "category": "Political/Leadership",
      "significance": "His death marked the loss of a significant figure in Japan's post-war economic and political development."
    }
  ]
}