{
  "date": "February 9",
  "events": [
    {
      "year": 1689,
      "title": "William and Mary Proclaimed Co-Rulers of England",
      "description": "Following the Glorious Revolution, William III and Mary II were declared joint sovereigns of England, Scotland, and Ireland.",
      "category": "Political",
      "significance": "This event marked the beginning of constitutional monarchy in England and the solidification of parliamentary power over the monarchy."
    },
    {
      "year": 1861,
      "title": "The Confederate States of America Formed",
      "description": "Delegates from southern states met in Montgomery, Alabama, to form the Confederate States of America, with Jefferson Davis elected as president.",
      "category": "Political",
      "significance": "This was a key moment leading up to the American Civil War, signaling the formal secession of southern states from the Union."
    },
    {
      "year": 1943,
      "title": "Battle of Guadalcanal Ends",
      "description": "The United States declared victory after capturing the Solomon Islands from Japanese forces in World War II.",
      "category": "Military",
      "significance": "A decisive victory for the Allies, it marked a turning point in the Pacific theater during WWII."
    },
    {
      "year": 1964,
      "title": "The Beatles Appear on The Ed Sullivan Show",
      "description": "The Beatles made their first live American TV appearance on The Ed Sullivan Show, watched by millions.",
      "category": "Cultural",
      "significance": "This appearance launched Beatlemania in the United States and had a profound impact on popular culture."
    },
    {
      "year": 1996,
      "title": "Alfred McAlpine Announces Sale of Civil Engineering Division",
      "description": "One of the major UK construction companies began restructuring to focus on housebuilding after announcing the sale of its civil engineering division.",
      "category": "Economic",
      "significance": "The move reflected broader economic changes in the construction industry during the 1990s."
    }
  ]
}