{
  "date": "February 14",
  "events": [
    {
      "year": 1929,
      "title": "Saint Valentine's Day Massacre",
      "description": "Seven members of Chicago's North Side Gang were murdered during the Saint Valentine's Day Massacre, an event linked to the gang warfare between Al Capone and Bugs Moran.",
      "category": "Crime/Conflict",
      "significance": "Marked a turning point in Chicago gang violence, symbolizing the brutality of Prohibition-era organized crime."
    },
    {
      "year": 1789,
      "title": "George Washington becomes First U.S. President by known popular vote",
      "description": "George Washington was elected as the first President of the United States under the new Constitution, receiving the greatest number of electoral votes.",
      "category": "Politics",
      "significance": "Initiated the presidency of the United States and set precedents for future democratic elections."
    },
    {
      "year": 1876,
      "title": "Alexander Graham Bell applies for Telephone Patent",
      "description": "Alexander Graham Bell filed a patent application for his invention of the telephone, a significant advance in communication technology.",
      "category": "Science/Technology",
      "significance": "Key development leading to the modern telecommunications industry."
    },
    {
      "year": 4004,
      "title": "Traditional date of the creation of the world according to James Ussher",
      "description": "According to 17th-century Archbishop James Ussher's calculation, the biblical creation of the world is dated to this day (though not a historical event, it was influential historically).",
      "category": "Religion/Mythology",
      "significance": "Reflects historical attempts to date biblical events and influences religious chronologies."
    },
    {
      "year": 269,
      "title": "Martyrdom of Saint Valentine",
      "description": "Saint Valentine was said to be martyred on this day, leading to the association of February 14 with love and romantic celebration.",
      "category": "Religion",
      "significance": "Basis for the modern celebration of Valentine's Day, influencing cultural and social customs worldwide."
    }
  ]
}