{
  "date": "February 21",
  "events": [
    {
      "year": 1848,
      "title": "Publication of the Communist Manifesto",
      "description": "Karl Marx and Friedrich Engels publish the Communist Manifesto, outlining the principles of communism and socialism.",
      "category": "Political",
      "significance": "This document became a foundational text for socialist and communist movements worldwide, influencing political ideologies and revolutions."
    },
    {
      "year": 1965,
      "title": "Assassination of Malcolm X",
      "description": "African-American civil rights leader Malcolm X was assassinated while preparing to address the Organization of Afro-American Unity in New York City.",
      "category": "Social/Civil Rights",
      "significance": "Malcolm X's death marked a significant moment in the civil rights movement, highlighting tensions and the struggle for racial equality in the United States."
    },
    {
      "year": 1947,
      "title": "Christian Dior's New Look Unveiled",
      "description": "Christian Dior presented his first fashion collection in Paris, introducing the 'New Look' which revolutionized women's fashion after World War II.",
      "category": "Cultural",
      "significance": "The 'New Look' influenced fashion globally, emphasizing femininity and luxury during the post-war recovery period."
    },
    {
      "year": 1916,
      "title": "Battle of Verdun Begins",
      "description": "One of the longest and most brutal battles of World War I, the Battle of Verdun between French and German forces, started in France.",
      "category": "Military",
      "significance": "The battle symbolized French determination and endurance, becoming a turning point in the war's Western Front."
    },
    {
      "year": 1972,
      "title": "Start of the U.S.-China Ping Pong Diplomacy",
      "description": "The U.S. table tennis team was invited to visit China, marking the beginning of improved U.S.-China relations during the Cold War.",
      "category": "Diplomatic",
      "significance": "Ping Pong Diplomacy paved the way for President Nixon's visit to China and a significant thaw in Sino-American relations."
    }
  ]
}