{
  "date": "February 24",
  "events": [
    {
      "year": 1525,
      "title": "Battle of Pavia",
      "description": "The Battle of Pavia took place during the Italian Wars, where Imperial forces led by Charles V defeated the French army, capturing King Francis I of France.",
      "category": "Military",
      "significance": "This battle marked a decisive shift in power in Italy and solidified Habsburg dominance in Europe."
    },
    {
      "year": 1582,
      "title": "Pope Gregory XIII Announces the Gregorian Calendar",
      "description": "Pope Gregory XIII issued a papal bull that introduced the Gregorian calendar, reforming the Julian calendar to correct for inaccuracies in the calculation of leap years and the calendar year length.",
      "category": "Cultural/Religious",
      "significance": "The Gregorian calendar became the internationally accepted civil calendar and remains in use today."
    },
    {
      "year": 1868,
      "title": "The Meiji Restoration Begins",
      "description": "Emperor Meiji was restored to power in Japan, ending the Tokugawa shogunate.",
      "category": "Political",
      "significance": "This event marked the beginning of Japan's rapid modernization and westernization."
    },
    {
      "year": 1917,
      "title": "February Revolution Begins in Russia",
      "description": "Strikes and protests in Petrograd erupted, marking the beginning of the February Revolution which eventually led to the abdication of Tsar Nicholas II.",
      "category": "Political",
      "significance": "This revolution led to the fall of the Russian monarchy and paved the way for the rise of the Soviet Union."
    },
    {
      "year": 1986,
      "title": "People Power Revolution in the Philippines",
      "description": "Ferdinand Marcos fled the Philippines after 20 years in power, ending his dictatorship and restoring democracy under Corazon Aquino.",
      "category": "Political",
      "significance": "The revolution became a model for peaceful demonstrations effecting political change worldwide."
    }
  ]
}