{
  "date": "February 25",
  "events": [
    {
      "year": 1570,
      "title": "Pope Pius V Excommunicates Queen Elizabeth I",
      "description": "Pope Pius V issued the papal bull 'Regnans in Excelsis,' excommunicating Queen Elizabeth I of England and releasing her subjects from allegiance to her.",
      "category": "Religion/Politics",
      "significance": "This event intensified the religious conflict between Catholics and Protestants in England, contributing to ongoing political and religious tensions."
    },
    {
      "year": 1836,
      "title": "Samuel Colt Receives Patent for Revolver",
      "description": "Samuel Colt was granted a patent for his invention of the revolver, a firearm with a rotating cylinder holding multiple bullets.",
      "category": "Technology/Innovation",
      "significance": "The revolver revolutionized firearms technology and had a lasting impact on military and law enforcement worldwide."
    },
    {
      "year": 1948,
      "title": "Communist Coup in Czechoslovakia",
      "description": "The Communist Party of Czechoslovakia, supported by the Soviet Union, seized full control of the government in a coup d'état.",
      "category": "Politics/Cold War",
      "significance": "This event marked the beginning of four decades of communist rule in Czechoslovakia and a significant Soviet expansion in Eastern Europe."
    },
    {
      "year": 1964,
      "title": "Cassius Clay Wins World Heavyweight Title",
      "description": "Cassius Clay (later Muhammad Ali) defeated Sonny Liston to become the world heavyweight boxing champion.",
      "category": "Sports",
      "significance": "This victory marked the rise of one of boxing's most iconic and influential figures, who later became a prominent social and political activist."
    },
    {
      "year": 1991,
      "title": "Croatia Declares Independence from Yugoslavia",
      "description": "Croatia formally declared its independence from the Socialist Federal Republic of Yugoslavia.",
      "category": "Politics/International Relations",
      "significance": "This declaration was a key event in the breakup of Yugoslavia and led to the Croatian War of Independence."
    }
  ]
}