{
  "date": "February 28",
  "events": [
    {
      "year": 1784,
      "title": "Maryland Ratifies the United States Constitution",
      "description": "Maryland becomes the seventh state to ratify the U.S. Constitution, helping to pave the way for the creation of the United States government under this new national framework.",
      "category": "Political",
      "significance": "This ratification was crucial in the formation of the United States federal government and the successful adoption of the U.S. Constitution."
    },
    {
      "year": 1939,
      "title": "Spanish Civil War Ends with Madrid's Fall",
      "description": "The city of Madrid falls to Francisco Franco's Nationalist forces, effectively ending the Spanish Civil War after nearly three years of conflict.",
      "category": "Military",
      "significance": "The conclusion of the Spanish Civil War established Franco's dictatorship, which lasted until his death in 1975, shaping Spain's political landscape for decades."
    },
    {
      "year": 1993,
      "title": "The Intel Pentium Microprocessor Debuts",
      "description": "Intel announces the first Pentium microprocessor, marking a significant improvement in computer processing power and performance for personal computers.",
      "category": "Technological",
      "significance": "The Pentium processor was instrumental in advancing computer technology, influencing the development of PC hardware and software industries."
    },
    {
      "year": 2004,
      "title": "Saint Petersburg Subway Bombing",
      "description": "A terrorist bombing targets the Saint Petersburg metro system in Russia, resulting in multiple casualties and injuries.",
      "category": "Terrorism",
      "significance": "This event highlighted ongoing security challenges related to terrorism in Russia and prompted increased measures in public safety and counterterrorism."
    },
    {
      "year": 2017,
      "title": "New Horizons Spacecraft's Close Approach to Pluto",
      "description": "NASA's New Horizons spacecraft performs its closest flyby of Pluto, gathering unprecedented data and images of the dwarf planet.",
      "category": "Space Exploration",
      "significance": "This milestone expanded human knowledge of the outer solar system and Pluto, providing insights into planetary science and the nature of distant celestial bodies."
    }
  ]
}