{
  "date": "June 3",
  "holidays": [
    {
      "name": "Repeat Day",
      "description": "A peculiar day encouraging people to do things twice—all over again! Whether it's repeating a favorite song, a funny joke, or even a small act of kindness, it's all about the joy of repeating.",
      "origin": "Originating from a quirky social media trend in the early 2000s, Repeat Day celebrates the playful side of human nature and the charm of déjà vu moments.",
      "category": "Fun/Pop Culture",
      "emoji": "🔁",
      "funFact": "Some people celebrate by eating their favorite meal twice—once for real and once mentally!"
    },
    {
      "name": "World Bicycle Day",
      "description": "A day to recognize the uniqueness, longevity, and versatility of the bicycle, and to promote cycling for health and environmental benefits.",
      "origin": "Declared by the United Nations in 2018 to promote safe, accessible, and sustainable cycling worldwide.",
      "category": "Awareness/Environment",
      "emoji": "🚴‍♂️",
      "funFact": "Did you know the first bicycle is over 200 years old and was called the 'Draisine' or 'running machine'?"
    },
    {
      "name": "Egg Drop Day",
      "description": "Celebrate the physics and comedy of egg dropping! People participate in contests of dropping raw eggs from heights with homemade protectors to keep them unbroken.",
      "origin": "Often celebrated in schools and science clubs to teach basic principles of gravity and engineering.",
      "category": "Food/Science Fun",
      "emoji": "🥚",
      "funFact": "The largest egg drop competition had over 1,000 participants trying to save their eggs from cracking."
    },
    {
      "name": "Drive-In Movie Day",
      "description": "A nostalgic celebration of the drive-in theatre experience—popcorn, cars, and big screens under the stars!",
      "origin": "Commemorates the height of drive-in movie popularity in the mid-20th century, reminding us to enjoy classic cinema in a fun setting.",
      "category": "Pop Culture/Entertainment",
      "emoji": "🎥🚗",
      "funFact": "The first-ever drive-in movie theater opened in New Jersey in 1933."
    }
  ]
}