{
  "date": "June 7",
  "holidays": [
    {
      "name": "Global Running Day",
      "description": "A day to celebrate the joy of running and encourage people around the world to get moving, whether you're a seasoned marathoner or a casual jogger.",
      "origin": "Initiated by the New York Road Runners in 2009 to promote fitness and community through running.",
      "category": "Fitness / Health",
      "emoji": "🏃‍♂️",
      "funFact": "On Global Running Day, people participate in runs from tiny backyard sprints to massive urban marathons, illustrating how universal running truly is."
    },
    {
      "name": "VCR Day",
      "description": "A day dedicated to celebrating the trusty Video Cassette Recorder, the iconic technology that changed the way people watched movies at home.",
      "origin": "Established by the Museum of Obsolete Media to honor the VCR’s impact since its popularization in the late 1970s.",
      "category": "Technology Nostalgia",
      "emoji": "📼",
      "funFact": "At its peak, VCRs were in nearly 90% of American homes, but now they're largely obsolete, making this day a trip down memory lane."
    },
    {
      "name": "National Chocolate Ice Cream Day",
      "description": "A delicious day to indulge in one of the most popular and beloved ice cream flavors—chocolate!",
      "origin": "Unofficial food holiday celebrated in the United States to honor chocolate ice cream's creamy goodness.",
      "category": "Food / Dessert",
      "emoji": "🍫🍨",
      "funFact": "Chocolate ice cream ranks consistently among the top three flavors in the world alongside vanilla and strawberry."
    },
    {
      "name": "Apple Strudel Day",
      "description": "A quirky celebration of the classic flaky and sweet apple-filled pastry that originated in Austria but is enjoyed worldwide.",
      "origin": "An unofficial day created by pastry enthusiasts to honor the beloved dessert on this date.",
      "category": "Food / Cultural",
      "emoji": "🍎🥧",
      "funFact": "The layers of dough in a traditional apple strudel are so thin they can almost read a newspaper through them!"
    }
  ]
}