{
  "date": "June 14",
  "holidays": [
    {
      "name": "Flag Day (USA)",
      "description": "A day to commemorate the adoption of the American flag in 1777. It’s a time to salute Old Glory with parades, flag-raising ceremonies, and patriotic pride — but also a bit quirky because few know it’s an official observance, not a federal holiday!",
      "origin": "In 1777, the Second Continental Congress passed the Flag Resolution establishing the flag of the United States, and Flag Day celebrates this historic event.",
      "category": "Patriotic holiday",
      "emoji": "🇺🇸",
      "funFact": "Flag Day was first officially celebrated in 1885 at a school in Wisconsin by a teacher who wanted to instill patriotism in her students."
    },
    {
      "name": "World Blood Donor Day",
      "description": "A day to raise awareness about the importance of blood donation and to thank voluntary donors around the world. It’s a life-saving pop culture of generosity, with superhero vibes as donors are the real-life lifesavers!",
      "origin": "Established by the World Health Organization in 2004 to improve voluntary blood donation worldwide.",
      "category": "Health awareness",
      "emoji": "🩸",
      "funFact": "The day honors Karl Landsteiner, whose discovery of blood groups made transfusion possible — he was born on June 14!"
    },
    {
      "name": "Flag Day for the City of Prince Edward Island (Canada)",
      "description": "A local celebration honoring the flag of Prince Edward Island, showcasing Canadian regional pride on this quirky coincidental Flag Day.",
      "origin": "June 14 marks the official adoption of the PEI flag in 1964.",
      "category": "Regional observance",
      "emoji": "🇨🇦",
      "funFact": "The PEI flag features three lions and oak leaves, symbolizing the English heritage and the island’s oak forests."
    },
    {
      "name": "National Bourbon Day (USA)",
      "description": "A spirited celebration of America’s native whisky, bourbon! Perfect for cocktail lovers, history buffs, and anyone who enjoys a smoky, caramel-y sip.",
      "origin": "Bourbon’s roots trace back to the late 18th century in Kentucky — this day is a modern creation to honor the iconic American liquor.",
      "category": "Food and drink holiday",
      "emoji": "🥃",
      "funFact": "To be called bourbon, the whisky must be made in the USA with at least 51% corn, aged in new charred oak barrels!"
    },
    {
      "name": "Go Fishing Day",
      "description": "A day to grab your rod and reel (or just daydream about it) and connect with nature via fishing. Whether you’re an angler or a casual catcher, it’s a quirky excuse to enjoy the outdoors.",
      "origin": "A likely informal holiday encouraging fishing enthusiasts to head to the water, coinciding with early summer and longer daylight hours.",
      "category": "Outdoor recreation",
      "emoji": "🎣",
      "funFact": "June is prime fishing season for many species in the Northern Hemisphere, making this day perfect for a catch!"
    }
  ]
}