{
  "date": "June 17",
  "holidays": [
    {
      "name": "Eat Your Vegetables Day",
      "description": "A tasty reminder to eat more veggies and embrace those greens! This day encourages everyone to add more vegetables to their plates, celebrating the health benefits and delicious flavors of veggies.",
      "origin": "Started as a health awareness initiative to combat poor eating habits and promote well-being through a veggie-rich diet.",
      "category": "Food & Health",
      "emoji": "🥦",
      "funFact": "Despite the love for junk food, many people find creative ways to make vegetables fun—like veggie noodles, cauliflower pizza crust, or hidden veggies in smoothies!"
    },
    {
      "name": "World Juggling Day",
      "description": "A fun tribute to jugglers around the globe. People showcase juggling skills and teach others this entertaining and coordination-boosting art form.",
      "origin": "Created by juggling enthusiasts to celebrate and spread the joy of juggling, promoting physical activity and performance art.",
      "category": "Arts & Entertainment",
      "emoji": "🤹",
      "funFact": "The first World Juggling Day was celebrated in 2004, and now thousands participate worldwide, from beginners tossing tennis balls to pros with flaming torches!"
    },
    {
      "name": "National Eat Your Peas Day",
      "description": "A specific celebration dedicated to that tiny green legume we all love or love to hate! It’s a great day to cook, eat, or just appreciate peas in all their forms.",
      "origin": "Started as a fun food observance to encourage consumption of peas as a nutritious and tasty vegetable.",
      "category": "Food",
      "emoji": "🍽️",
      "funFact": "Peas have been cultivated for over 5,000 years and were a favorite of ancient civilizations, including the Egyptians and Romans!"
    },
    {
      "name": "Russian Independence Day (Finland)",
      "description": "Though not widely known, June 17 marks Russia's independence day according to some historical calendars, linked to earlier events in Finland and the surrounding region’s complex history.",
      "origin": "Tied to historical declarations and regional independence movements in the early 20th century.",
      "category": "Historical/Political",
      "emoji": "🎉",
      "funFact": "Finland celebrates its own Independence Day on December 6, but June 17 holds significance in related historical contexts for Russian-Finnish relations."
    }
  ]
}