{
  "date": "June 19",
  "holidays": [
    {
      "name": "Juneteenth",
      "description": "Celebrates the emancipation of the last remaining enslaved African Americans in the United States on June 19, 1865.",
      "origin": "Derived from the combination of 'June' and 'nineteenth,' marking when Union soldiers arrived in Galveston, Texas, to announce freedom.",
      "category": "Historical / Cultural",
      "emoji": "🎉",
      "funFact": "Juneteenth is the oldest nationally celebrated commemoration of the ending of slavery in the U.S. and was declared a federal holiday in 2021."
    },
    {
      "name": "National Garfield the Cat Day",
      "description": "A day to celebrate everyone's favorite lasagna-loving, Monday-hating orange cat created by Jim Davis.",
      "origin": "Commemorates the premiere of the Garfield comic strip which started in 1978.",
      "category": "Pop Culture / Comic Strip",
      "emoji": "🐱🍝",
      "funFact": "Garfield holds the Guinness World Record for being the most widely syndicated comic strip in the world."
    },
    {
      "name": "International Day for the Elimination of Sexual Violence in Conflict",
      "description": "Raised global awareness about the need to end sexual violence during armed conflicts.",
      "origin": "Established by the United Nations in 2015 to commemorate the 2012 murder of peace activist and Nobel laureate Bangura.",
      "category": "Awareness / Human Rights",
      "emoji": "🕊️",
      "funFact": "This day honors courage and dedication of survivors and advocates working towards peace and justice in conflict zones."
    },
    {
      "name": "National Martini Day",
      "description": "A spirited celebration of the classic cocktail traditionally made with gin and vermouth and garnished with an olive or lemon twist.",
      "origin": "Origin debated, but the martini became popular in the early 20th century, and this day honors its timeless sophistication.",
      "category": "Food & Drink / Cocktail",
      "emoji": "🍸",
      "funFact": "The perfect martini has inspired endless debates—from shaken or stirred to gin or vodka—bonding fans worldwide."
    }
  ]
}