{
  "date": "June 23",
  "holidays": [
    {
      "name": "International Widow's Day",
      "description": "A day to recognize and support widows worldwide, raising awareness about the challenges they face and advocating for their rights and dignity.",
      "origin": "Established by the United Nations in 2011 to address the issues of widows, including poverty and social stigma, which affect millions globally.",
      "category": "Awareness Day",
      "emoji": "👰‍♀️",
      "funFact": "Widows often face discrimination and poverty, yet many cultures historically neglected their rights, making this day crucial for global empathy and action."
    },
    {
      "name": "National Pink Day (USA)",
      "description": "A cheerful day dedicated to celebrating the color pink in all its shades and forms, embracing its fun, vibrant, and sometimes rebellious connotations.",
      "origin": "An unofficial and playful observance created by color enthusiasts in the USA, popularized via social media challenges and fashion statements.",
      "category": "Color/Fun Day",
      "emoji": "🎀",
      "funFact": "Pink was once a color associated with masculinity in the early 1900s before evolving into the feminine symbol it often represents today!"
    },
    {
      "name": "Go Skateboarding Day",
      "description": "An annual event encouraging people of all ages to hop on their skateboards and showcase their skills, creativity, and love for skating culture.",
      "origin": "Started by the International Association of Skateboard Companies in 2004 as a way to promote skateboarding and bring communities together.",
      "category": "Sports/Culture",
      "emoji": "🛹",
      "funFact": "Some cities organize huge skate jams and competitions; in 2010, a Guinness World Record was set with over 8000 skateboarders rolling together!"
    },
    {
      "name": "Upsy Daisy Day",
      "description": "A quirky day to perk up your spirits, encourage positivity, and brighten someone's day — much like the cheerful 'upsy daisy' saying said to toddlers.",
      "origin": "Unofficial fun holiday from the UK that embraces optimism and the power of a smile through playful antics and kind gestures.",
      "category": "Feel-Good/Quirky",
      "emoji": "🌼",
      "funFact": "The phrase 'upsy daisy' likely originated from a gentle way to help children or animals stand up, now inspiring adult fun and silliness too!"
    }
  ]
}