{
  "date": "June 24",
  "holidays": [
    {
      "name": "International Fairy Day",
      "description": "A magical day dedicated to celebrating fairies and the enchanting world of folklore and fantasy.",
      "origin": "Rooted in European folklore, this day invites people to honor the mythical creatures known as fairies, believed to bring luck and mischief.",
      "category": "Folklore & Fantasy",
      "emoji": "🧚‍♀️",
      "funFact": "In many cultures, fairies are considered nature spirits who can be either helpful or mischievous, depending on their mood!"
    },
    {
      "name": "World UFO Day",
      "description": "A day for UFO enthusiasts to gather, share sightings, and ponder the mysteries of extraterrestrial life.",
      "origin": "Established by UFO researchers to commemorate the first widely publicized UFO sighting on June 24, 1947, by pilot Kenneth Arnold.",
      "category": "Pop Culture & Awareness",
      "emoji": "🛸",
      "funFact": "The term 'flying saucer' was coined after Arnold's sighting when he described UFOs moving like 'saucers skipping on water.'"
    },
    {
      "name": "National Pralines Day (USA)",
      "description": "A sweet holiday dedicated to enjoying pralines, the sugary, nutty confections beloved in the Southern United States.",
      "origin": "Celebrates the classic New Orleans treat made from sugar, cream, butter, and pecans, with French origins dating back to the 17th century.",
      "category": "Food Holiday",
      "emoji": "🍬",
      "funFact": "Legend has it that pralines were named after the French diplomat Marshal du Plessis-Praslin, whose chef created the original recipe!"
    },
    {
      "name": "Feast of St. John the Baptist",
      "description": "A traditional Christian feast day commemorating the birth of John the Baptist, featuring bonfires and festivities in many countries.",
      "origin": "Christian liturgical calendar marks June 24 as the birth of St. John the Baptist, with roots going back to medieval times.",
      "category": "Religious & Cultural",
      "emoji": "🔥",
      "funFact": "In some cultures, jumping over bonfires on this night is believed to bring good luck and health for the coming year!"
    }
  ]
}