{
  "date": "June 25",
  "holidays": [
    {
      "name": "National Catfish Day",
      "description": "A day to celebrate the delicious and bony freshwater fish known as catfish. Whether fried, grilled, or smoked, catfish is a Southern U.S. favorite and enjoyed by fish lovers everywhere!",
      "origin": "Established in the U.S. in 1987 to promote the aquaculture industry, especially catfish farming.",
      "category": "Food Holiday",
      "emoji": "🐟",
      "funFact": "Catfish have no scales and their 'whiskers' called barbels help them sense food in muddy waters."
    },
    {
      "name": "Log Cabin Day",
      "description": "This day celebrates the humble log cabin, a symbol of pioneer spirit and early American frontier life, reminding us of simpler times and rugged self-sufficiency.",
      "origin": "Commemorates the construction of the first log cabins by early European settlers in America during the 1600s.",
      "category": "Historical / Cultural",
      "emoji": "🏠",
      "funFact": "Abraham Lincoln was famously born in a one-room log cabin, symbolizing humble beginnings."
    },
    {
      "name": "Be Nasty Day",
      "description": "A tongue-in-cheek holiday encouraging people to be cheeky, bold, and a little mischievous (all in good fun, of course). It's a day for playful rudeness and shaking off politeness!",
      "origin": "Origin unknown but popularized by internet memes and social media to encourage sass and humor.",
      "category": "Humor / Pop Culture",
      "emoji": "😈",
      "funFact": "The sassiest tweets are often posted on Be Nasty Day, making it a viral social media celebration."
    },
    {
      "name": "Seward's Day (Alaska)",
      "description": "This state holiday commemorates the 1867 signing of the treaty where the U.S. purchased Alaska from Russia, a.k.a 'Seward's Folly' because many thought buying Alaska was a mistake!",
      "origin": "Named after U.S. Secretary of State William H. Seward who negotiated the purchase of Alaska.",
      "category": "Historical",
      "emoji": "❄️",
      "funFact": "At the time, people mocked the purchase but Alaska turned out to be rich in natural resources like oil and gold!"
    }
  ]
}