{
  "date": "June 27",
  "holidays": [
    {
      "name": "National Sunglasses Day",
      "description": "A day dedicated to celebrating the cool and practical accessory that helps us avoid squinting at the sun and look stylish.",
      "origin": "Originating in the United States, this unofficial holiday promotes eye safety and fashionable eyewear during summer months.",
      "category": "Fashion / Awareness",
      "emoji": "🕶️",
      "funFact": "Sunglasses were originally invented in China over 2,000 years ago, primarily to protect eyes from glare rather than for style!"
    },
    {
      "name": "International PTSD Awareness Day",
      "description": "An awareness day focused on educating people about Post-Traumatic Stress Disorder and supporting those affected by it.",
      "origin": "Established by mental health organizations to bring global attention to PTSD’s impact across military and civilian populations.",
      "category": "Health / Awareness",
      "emoji": "🧠",
      "funFact": "PTSD can affect anyone who experiences trauma, not just soldiers; it wasn’t officially recognized as a disorder until 1980."
    },
    {
      "name": "National Camera Day",
      "description": "Celebrate photography, cameras, and capturing precious moments frozen in time on this day dedicated to the art and science of photography.",
      "origin": "A modern, unofficial holiday aimed at encouraging photography enthusiasts to share our world through pictures.",
      "category": "Pop Culture / Hobby",
      "emoji": "📷",
      "funFact": "The first photograph took 8 hours to expose and was created in 1826 by Joseph Nicéphore Niépce!"
    },
    {
      "name": "National Fried Foods Day",
      "description": "A delicious celebration honoring all foods cooked by frying — from fries to doughnuts and everything crispy and golden.",
      "origin": "An unofficial food holiday that gives fried food lovers the perfect excuse to indulge guilt-free.",
      "category": "Food",
      "emoji": "🍟",
      "funFact": "Frying food dates back over 5,000 years to ancient civilizations who used hot oil to cook various ingredients."
    }
  ]
}