{
  "date": "June 28",
  "holidays": [
    {
      "name": "National Tau Day",
      "description": "Celebrate the mathematical constant tau (τ), approximately 6.28, which is the ratio of a circle's circumference to its radius. It's a nerdy alternative to Pi Day!",
      "origin": "Created by mathematicians and enthusiasts who believe tau (τ) better represents the properties of circles than pi (π).",
      "category": "Math/Science",
      "emoji": "🧮",
      "funFact": "Tau equals 2 times pi, so June 28 (6/28) neatly corresponds to 6.28, making this day perfect for circle lovers!"
    },
    {
      "name": "Hug holiday - International Body Piercing Day",
      "description": "A day to appreciate the art and culture of body piercing, celebrating self-expression and adornment through piercings worldwide.",
      "origin": "Started by body piercing enthusiasts and professionals to raise awareness about the body modification community.",
      "category": "Culture/Body Art",
      "emoji": "🦋",
      "funFact": "Body piercing dates back thousands of years, with evidence from ancient civilizations including the Egyptians, Romans, and Mayans."
    },
    {
      "name": "Cucumber Day",
      "description": "A quirky food holiday celebrating the humble cucumber, beloved for its refreshing crunch and versatility in dishes and beauty treatments.",
      "origin": "Origin details unknown, but embraced mostly by foodies and gardeners to honor this cooling vegetable.",
      "category": "Food",
      "emoji": "🥒",
      "funFact": "Cucumbers are actually fruits and can be up to 95% water — perfect for a summer snack or spa treatment!"
    },
    {
      "name": "Tau Day",
      "description": "Dedicated to tau, the circle constant equal to 2π. Advocates argue tau simplifies many formulas in math and physics compared to pi.",
      "origin": "Tau Day was popularized on the internet by math educator Michael Hartl and tau enthusiasts to challenge the traditional Pi Day.",
      "category": "Mathematics",
      "emoji": "🔢",
      "funFact": "Some fans call tau 'the true circle constant,' and organize annual celebrations featuring tau-themed pies and jokes."
    }
  ]
}