{
  "date": "June 29",
  "holidays": [
    {
      "name": "National Waffle Iron Day",
      "description": "A crispy, golden celebration dedicated to the waffle iron—a magical kitchen gadget that turns batter into irresistibly patterned waffles!",
      "origin": "This day honors the day Cornelius Swartwout received a patent for the waffle iron back in 1869 in the United States, but the celebration today is mostly about enjoying waffles.",
      "category": "Food Holiday",
      "emoji": "🧇",
      "funFact": "The first waffle irons had wooden handles so you could safely hold them over an open fire—talk about old-school cooking!"
    },
    {
      "name": "Camera Day",
      "description": "A day for photography buffs and shutterbugs to celebrate the invention of the camera and capture the moment, literally!",
      "origin": "June 29 commemorates the day the earliest known photograph was taken by Joseph Nicéphore Niépce in 1826, heralding the age of photography.",
      "category": "Pop Culture",
      "emoji": "📷",
      "funFact": "Niépce’s first photo took about 8 hours exposure time — by today’s standards, that's one epic Instagram waiting period!"
    },
    {
      "name": "Sunglasses Day",
      "description": "Put on your coolest shades and block the sun with style! Sunglasses Day encourages everyone to protect their eyes and look fabulous doing it.",
      "origin": "Sunglasses have been invented and evolved over centuries, but this day celebrates the iconic accessory’s role in fashion and eye safety, especially as summer hits full stride.",
      "category": "Fashion & Safety",
      "emoji": "🕶️",
      "funFact": "The first sunglasses were made in 12th-century China and had smoke-colored quartz lenses to reduce glare—not exactly trendy, but effective!"
    },
    {
      "name": "National Camera Day",
      "description": "Dedicated to appreciating the art, science, and history behind cameras of all kinds, from vintage to digital.",
      "origin": "This unofficial holiday celebrates the camera’s rich legacy and its role in capturing memories worldwide.",
      "category": "Awareness/Technology",
      "emoji": "📸",
      "funFact": "The famous Polaroid instant camera was introduced in 1948 and could produce a photo in about 60 seconds — the original instant gratification!"
    }
  ]
}