{
  "date": "June 30",
  "holidays": [
    {
      "name": "Meteor Watch Day",
      "description": "A day dedicated to looking up and appreciating the stunning meteor showers that light up the night sky. Perfect for stargazers and night owls who want to gaze at shooting stars and make wishes!",
      "origin": "Inspired by annual mid-year meteor showers and established by astronomy enthusiasts to encourage sky-watching and science education.",
      "category": "Science & Nature",
      "emoji": "🌠",
      "funFact": "The famous Perseid Meteor Shower peaks in August, but June’s meteor showers also provide a celestial show to enjoy!"
    },
    {
      "name": "Asteroid Day",
      "description": "A global awareness day focused on asteroids and the potential threat they pose to Earth, as well as their scientific and economic importance.",
      "origin": "Started in 2015 to coincide with the anniversary of the Tunguska event in 1908, which was a massive asteroid airburst in Siberia.",
      "category": "Awareness",
      "emoji": "☄️",
      "funFact": "Asteroid Day helps fund asteroid research and encourages citizen science participation to track near-Earth objects."
    },
    {
      "name": "International Day of Parliamentarism",
      "description": "Celebrates parliaments and their role in democracy, promoting dialogue and cooperation between parliamentarians worldwide.",
      "origin": "Established in 2018 by the Inter-Parliamentary Union to strengthen democracy across the globe.",
      "category": "Political & Social",
      "emoji": "🏛️",
      "funFact": "This day is particularly important because it raises awareness about the role of parliaments in ensuring democracy and human rights."
    },
    {
      "name": "Take Your Dog To Work Day (observed on last Friday of June, sometimes falls on June 30)",
      "description": "A fun day where employees are encouraged to bring their canine companions to the workplace to boost morale and celebrate man’s best friend!",
      "origin": "Started in 1999 by Pet Sitters International to highlight the benefits of pet ownership and promote pet adoption.",
      "category": "Animal & Pet",
      "emoji": "🐕",
      "funFact": "Studies show that dogs in the office can reduce stress and increase productivity among workers!"
    },
    {
      "name": "Hogwarts Birthday (Harry Potter fans' unofficial celebration)",
      "description": "Celebrating the fictional birthday of Harry Potter and Hogwarts School of Witchcraft and Wizardry, a day for fans to dress up, re-read books, and revel in magic.",
      "origin": "From the Harry Potter series by J.K. Rowling, with Harry’s birthday being July 31; however, Hogwarts sometimes celebrated mid-year events around this date in fan communities.",
      "category": "Pop Culture",
      "emoji": "🧙‍♂️",
      "funFact": "Harry Potter day has unofficial events all around the world, including themed parties and trivia quizzes."
    }
  ]
}