{
  "date": "July 5",
  "plants": [
    {
      "name": "Rosa spp.",
      "commonName": "Roses",
      "description": "Roses are iconic flowering shrubs known for their fragrant, showy blooms. In temperate regions, many rose varieties bloom profusely in early to midsummer, including July. They are widely cultivated but also found in wild forms.",
      "bloomingSeason": "Late spring to mid summer (May to July)",
      "location": "Temperate regions worldwide",
      "colors": [
        "red",
        "pink",
        "white",
        "yellow",
        "orange"
      ],
      "emoji": "🌹",
      "funFact": "Roses have been used for over 5,000 years for their beauty, fragrance, and symbolic meanings in cultures around the world."
    },
    {
      "name": "Nelumbo nucifera",
      "commonName": "Sacred Lotus",
      "description": "The sacred lotus is an aquatic perennial plant famous for its large, fragrant flowers that rise above the water surface. It typically blooms in summer months under warm climates.",
      "bloomingSeason": "June to August",
      "location": "Asia (India, China, Japan), tropical and subtropical wetlands",
      "colors": [
        "pink",
        "white"
      ],
      "emoji": "🌸",
      "funFact": "The lotus flower folds its petals at night and reopens them at dawn, symbolizing rebirth and purity in many Asian cultures."
    },
    {
      "name": "Alcea rosea",
      "commonName": "Hollyhock",
      "description": "Hollyhocks are tall biennial or short-lived perennials prized for their tall spikes lined with multiple blossoms. They bloom heavily in midsummer and are common in cottage gardens and wild along roadsides.",
      "bloomingSeason": "June to August",
      "location": "Native to Asia and Europe; cultivated worldwide in temperate zones",
      "colors": [
        "pink",
        "red",
        "white",
        "yellow",
        "purple"
      ],
      "emoji": "🌺",
      "funFact": "Hollyhocks can grow up to 8 feet tall and attract many pollinators like bees and butterflies."
    },
    {
      "name": "Protea cynaroides",
      "commonName": "King Protea",
      "description": "Native to South Africa, the King Protea is famous for its large, striking flower heads resembling artichokes. It blooms primarily in the Southern Hemisphere’s winter and early spring, which corresponds to July in that climate.",
      "bloomingSeason": "June to September",
      "location": "South Africa, fynbos biome",
      "colors": [
        "pink",
        "white",
        "red"
      ],
      "emoji": "🌼",
      "funFact": "The king protea is South Africa’s national flower, and its name derives from the Greek god Proteus, known for changing shape, reflecting the protea’s diverse forms."
    }
  ]
}