{
  "date": "July 8",
  "plants": [
    {
      "name": "Lilium candidum",
      "commonName": "Madonna Lily",
      "description": "A tall, striking perennial lily with large, fragrant white flowers resembling trumpets. It is often cultivated in gardens for its elegant blooms and is native to the Mediterranean region.",
      "bloomingSeason": "June to July",
      "location": "Mediterranean Basin, cultivated worldwide",
      "colors": [
        "white"
      ],
      "emoji": "🌸",
      "funFact": "Madonna Lily flowers have been symbolic in various cultures, often associated with purity and the Virgin Mary."
    },
    {
      "name": "Rhododendron ferrugineum",
      "commonName": "Alpenrose",
      "description": "A hardy evergreen shrub found in alpine regions, producing clusters of bright pink to red bell-shaped flowers. It thrives in acidic soils and is commonly found in the European Alps.",
      "bloomingSeason": "June to July",
      "location": "Alps, Europe",
      "colors": [
        "pink",
        "red"
      ],
      "emoji": "🌺",
      "funFact": "The Alpenrose contains toxic compounds and was traditionally used in small doses for medicinal purposes."
    },
    {
      "name": "Nelumbo nucifera",
      "commonName": "Sacred Lotus",
      "description": "A large aquatic plant with distinctive round leaves and showy flowers that bloom above the water surface. It is revered in many Asian cultures and features pink or white blossoms.",
      "bloomingSeason": "June to August",
      "location": "Asia, cultivated in water gardens worldwide",
      "colors": [
        "pink",
        "white"
      ],
      "emoji": "🌼",
      "funFact": "Sacred Lotus seeds have been known to remain viable for over 1,000 years, making them one of the longest-living seeds on record."
    },
    {
      "name": "Erythronium americanum",
      "commonName": "Yellow Trout Lily",
      "description": "A woodland wildflower with drooping yellow flowers and mottled leaves resembling trout patterns. It is native to eastern North America and blooms early to mid-summer in some areas.",
      "bloomingSeason": "April to July (varies regionally)",
      "location": "Eastern North America",
      "colors": [
        "yellow"
      ],
      "emoji": "🌻",
      "funFact": "The mottled leaves are thought to camouflage the plant among fallen leaves, protecting it from herbivores."
    }
  ]
}