{
  "date": "July 9",
  "plants": [
    {
      "name": "Rosa spp.",
      "commonName": "Rose",
      "description": "Roses are a diverse group of flowering plants known for their beautiful, fragrant blooms and a wide variety of colors. Many species and cultivars bloom repeatedly from late spring through summer into early fall.",
      "bloomingSeason": "Late spring to early fall (May to September)",
      "location": "Temperate regions worldwide, including North America, Europe, and Asia",
      "colors": [
        "red",
        "pink",
        "white",
        "yellow",
        "orange",
        "purple"
      ],
      "emoji": "🌹",
      "funFact": "The ancient Romans used rose petals for their fragrance and medicinal properties, and the rose has been a symbol of love and beauty for centuries."
    },
    {
      "name": "Lupinus polyphyllus",
      "commonName": "Large-leaved Lupine",
      "description": "A flowering plant species known for its tall, dense spikes of pea-like flowers and palmate leaves. It thrives in meadows and open forests and is a favorite in gardens for attracting pollinators.",
      "bloomingSeason": "Late spring to mid-summer (June to July)",
      "location": "Native to western North America but cultivated extensively in temperate regions worldwide",
      "colors": [
        "blue",
        "purple",
        "pink",
        "white"
      ],
      "emoji": "🌸",
      "funFact": "Lupines enrich the soil by fixing nitrogen thanks to bacteria in their root nodules, improving soil fertility naturally."
    },
    {
      "name": "Nelumbo nucifera",
      "commonName": "Sacred Lotus",
      "description": "An aquatic plant with large, showy flowers that emerge above the water surface. It is revered in many cultures for its spiritual significance and stunning beauty.",
      "bloomingSeason": "Summer (June to August)",
      "location": "Wetlands of Asia, cultivated in tropical and subtropical gardens globally",
      "colors": [
        "pink",
        "white"
      ],
      "emoji": "🌺",
      "funFact": "The lotus flower's leaves are highly water-repellent, a phenomenon known as the 'lotus effect', inspiring self-cleaning technologies."
    },
    {
      "name": "Erythrina crista-galli",
      "commonName": "Cockspur Coral Tree",
      "description": "A striking flowering tree with brilliant red, spiny flowers that attract hummingbirds and pollinators. It is often used as an ornamental tree in warm temperate and subtropical regions.",
      "bloomingSeason": "Late spring to summer (October to February in Southern Hemisphere)",
      "location": "Native to South America (Argentina, Uruguay, Paraguay), cultivated in subtropical climates",
      "colors": [
        "red"
      ],
      "emoji": "🌺",
      "funFact": "The Cockspur Coral Tree is the national flower of Argentina, symbolizing strength and resilience."
    }
  ]
}