{
  "date": "July 14",
  "plants": [
    {
      "name": "Rudbeckia hirta",
      "commonName": "Black-eyed Susan",
      "description": "A North American native wildflower featuring bright yellow petals surrounding a dark brown central cone. It thrives in prairies and open woodlands and is widely used in gardens for its cheerful summer blooms.",
      "bloomingSeason": "June to September",
      "location": "North America (United States, Canada)",
      "colors": [
        "Yellow",
        "Brown"
      ],
      "emoji": "🌻",
      "funFact": "Black-eyed Susans attract pollinators like bees and butterflies, making them excellent for supporting local ecosystems."
    },
    {
      "name": "Lupinus polyphyllus",
      "commonName": "Large-leaved Lupine",
      "description": "This tall, erect perennial has dense spikes of pea-like flowers ranging from purple to pink, white, or blue. Native to western North America, it is popular in garden borders and thrives in cooler summer climates.",
      "bloomingSeason": "June to August",
      "location": "Western North America; cultivated globally in temperate zones",
      "colors": [
        "Purple",
        "Pink",
        "Blue",
        "White"
      ],
      "emoji": "🌸",
      "funFact": "Lupines fix nitrogen in the soil, improving soil quality and benefiting neighboring plants."
    },
    {
      "name": "Hibiscus rosa-sinensis",
      "commonName": "Chinese Hibiscus",
      "description": "A tropical shrub recognized for its large, bright, trumpet-shaped flowers often seen in vibrant red, pink, or yellow. Commonly cultivated in warm climates and indoors in cooler regions.",
      "bloomingSeason": "Year-round in tropical climates, including July",
      "location": "Tropical Asia, widely cultivated in tropical and subtropical regions",
      "colors": [
        "Red",
        "Pink",
        "Yellow",
        "White"
      ],
      "emoji": "🌺",
      "funFact": "Hibiscus flowers open in the morning and usually wither by evening, lasting just one day."
    },
    {
      "name": "Erythronium americanum",
      "commonName": "Yellow Trout Lily",
      "description": "A spring ephemeral native to eastern North America, this plant blooms early spring, but in southern parts of its range can sometimes bloom into early summer. It has nodding yellow flowers with brownish spots and mottled leaves resembling trout skin.",
      "bloomingSeason": "March to July, depending on region",
      "location": "Eastern North America",
      "colors": [
        "Yellow",
        "Brown spots"
      ],
      "emoji": "🌼",
      "funFact": "The mottled leaves help camouflage the plant on the forest floor, providing protection from herbivores."
    }
  ]
}