{
  "date": "November 11",
  "events": [
    {
      "year": 1918,
      "title": "Armistice Day Ends World War I",
      "description": "An armistice agreement was signed between the Allies and Germany, ending hostilities on the Western Front and effectively concluding World War I.",
      "category": "Military/Political",
      "significance": "Marked the end of one of the deadliest conflicts in history and led to significant geopolitical changes worldwide."
    },
    {
      "year": 1921,
      "title": "Unveiling of the Tomb of the Unknown Soldier in Arlington",
      "description": "The United States unveiled the Tomb of the Unknown Soldier at Arlington National Cemetery to honor unidentified American soldiers who died in World War I.",
      "category": "Cultural/Memorial",
      "significance": "Symbolizes respect and remembrance for all unidentified and missing soldiers, becoming a central part of Veteran and Memorial Day observances."
    },
    {
      "year": 1975,
      "title": "Angola Achieves Independence from Portugal",
      "description": "After a protracted liberation war, Angola officially gained its independence from Portuguese colonial rule.",
      "category": "Political/Colonial Independence",
      "significance": "Marked the end of Portuguese colonialism in Angola and initiated a new era of self-governance and conflict in the region."
    },
    {
      "year": 1986,
      "title": "Mike Tyson Becomes the Youngest Heavyweight Boxing Champion",
      "description": "At age 20, Mike Tyson won the WBC heavyweight title, becoming the youngest boxer ever to win a heavyweight championship.",
      "category": "Sports",
      "significance": "Signaled the rise of one of boxing's most dominant and controversial figures."
    },
    {
      "year": 2001,
      "title": "China Joins the World Trade Organization (WTO)",
      "description": "China became a formal member of the WTO, integrating its economy more fully into the global trade system.",
      "category": "Economic/Trade",
      "significance": "Marked a major milestone in globalization, significantly impacting international trade and economics."
    }
  ]
}