{
  "date": "November 17",
  "events": [
    {
      "year": 1558,
      "title": "Elizabeth I becomes Queen of England",
      "description": "Elizabeth I ascended to the English throne following the death of her half-sister Mary I, beginning a reign known as the Elizabethan era.",
      "category": "Monarchy/Political",
      "significance": "Her reign saw the flourishing of English drama, the defeat of the Spanish Armada, and the establishment of Protestantism in England."
    },
    {
      "year": 1869,
      "title": "Opening of the Suez Canal",
      "description": "The Suez Canal officially opened, connecting the Mediterranean Sea and the Red Sea, drastically reducing travel time between Europe and Asia.",
      "category": "Engineering/Trade",
      "significance": "It revolutionized global trade routes and maritime travel."
    },
    {
      "year": 1973,
      "title": "Military coup in Chile",
      "description": "General Augusto Pinochet led a military coup overthrowing President Salvador Allende, establishing a military dictatorship.",
      "category": "Political/Military",
      "significance": "The coup led to widespread political repression and had long-lasting impacts on Chile's society and politics."
    },
    {
      "year": 1989,
      "title": "Velvet Revolution begins in Czechoslovakia",
      "description": "Students and dissidents gathered in Prague to protest communist rule, sparking the Velvet Revolution.",
      "category": "Political/Democracy",
      "significance": "This non-violent revolution led to the end of communist rule in Czechoslovakia and the establishment of a democratic government."
    },
    {
      "year": 1993,
      "title": "Franklin D. Roosevelt Memorial dedicated",
      "description": "The Franklin Delano Roosevelt Memorial was dedicated in Washington, D.C., to honor the U.S. president who led the country through the Great Depression and World War II.",
      "category": "Cultural/Memorial",
      "significance": "The memorial recognizes Roosevelt’s impact on American history and governance."
    }
  ]
}