{
  "date": "November 19",
  "events": [
    {
      "year": 1863,
      "title": "Gettysburg Address Delivered",
      "description": "President Abraham Lincoln delivered the Gettysburg Address at the dedication of the Soldiers' National Cemetery in Gettysburg, Pennsylvania, during the American Civil War.",
      "category": "History - Politics",
      "significance": "The speech redefined the purpose of the war, emphasizing liberty, equality, and national unity, becoming one of the most famous speeches in American history."
    },
    {
      "year": 1493,
      "title": "Christopher Columbus Returns to Spain",
      "description": "Christopher Columbus returned to Spain from his first voyage to the Americas, bringing news of his discoveries in the New World.",
      "category": "Exploration",
      "significance": "Marked the beginning of widespread European exploration and colonization of the Americas."
    },
    {
      "year": 1950,
      "title": "Start of the Battle of Heartbreak Ridge",
      "description": "During the Korean War, United Nations forces began the Battle of Heartbreak Ridge against North Korean and Chinese troops.",
      "category": "Military",
      "significance": "A brutal battle that lasted over a month, symbolizing the intense and costly nature of the Korean conflict."
    },
    {
      "year": 1926,
      "title": "Harry Houdini Dies",
      "description": "Famous magician and escape artist Harry Houdini died from peritonitis caused by a ruptured appendix.",
      "category": "Culture",
      "significance": "Houdini was a pioneering figure in magic and illusion, influencing entertainment and pop culture."
    },
    {
      "year": 1847,
      "title": "Thomas Edison Born",
      "description": "Inventor Thomas Edison was born in Milan, Ohio, USA.",
      "category": "Science and Innovation",
      "significance": "Edison became one of the most prolific inventors in history, credited with innovations like the electric light bulb and phonograph."
    }
  ]
}