{
  "date": "November 21",
  "events": [
    {
      "year": 1620,
      "title": "Pilgrims Land at Plymouth Rock",
      "description": "English Pilgrims aboard the Mayflower land at Plymouth Rock, establishing one of the earliest successful English settlements in North America.",
      "category": "Exploration/Colonization",
      "significance": "Marked the beginning of permanent European settlement in New England and played a key role in American colonial history."
    },
    {
      "year": 1877,
      "title": "Thomas Edison Demonstrates the Phonograph",
      "description": "Thomas Edison publicly demonstrates the phonograph for the first time, showcasing his invention that could record and reproduce sound.",
      "category": "Innovation/Technology",
      "significance": "The phonograph revolutionized the music industry and laid the foundation for modern sound recording technology."
    },
    {
      "year": 1969,
      "title": "First Automatic Landing of a Commercial Jet",
      "description": "The Boeing 737, operated by United Airlines, makes the first automatic landing of a commercial jet during a test flight in Denver.",
      "category": "Aviation/Technology",
      "significance": "This milestone represented significant progress in aviation technology, enhancing flight safety and precision."
    },
    {
      "year": 1995,
      "title": "The Dayton Agreement Initialed",
      "description": "The leaders of Bosnia, Croatia, and Serbia initial the Dayton Agreement, an accord intended to end the Bosnian War.",
      "category": "Politics/Peace",
      "significance": "This agreement laid the foundation for peace in the Balkans after years of conflict and ethnic violence."
    },
    {
      "year": 2004,
      "title": "The Last Old Manila Railway Steam Locomotive Retired",
      "description": "The Philippines retires its last old steam locomotive from Manila Railway, marking the end of an era in Filipino railway history.",
      "category": "Transportation/History",
      "significance": "Signified modernization of Filipino rail systems and end of steam locomotive use in daily transport."
    }
  ]
}