{
  "date": "November 23",
  "events": [
    {
      "year": 1499,
      "title": "Battle of Dornach",
      "description": "The Swiss Confederation decisively defeated the army of the Duke of Milan, ending the Swabian War.",
      "category": "Military",
      "significance": "This victory secured Swiss independence from the Holy Roman Empire and marked the end of the Swabian War."
    },
    {
      "year": 1889,
      "title": "First jukebox is installed",
      "description": "The first jukebox was installed at the Palais Royale Saloon in San Francisco, California, operated by coin mechanism.",
      "category": "Technology/Entertainment",
      "significance": "The invention popularized the playing of recorded music in public venues and was an early step in the development of the music industry."
    },
    {
      "year": 1963,
      "title": "Launching of the first geostationary communication satellite (Syncom 2)",
      "description": "NASA launched Syncom 2, the first geostationary communication satellite, into orbit.",
      "category": "Science/Technology",
      "significance": "This marked a major milestone in communications technology, enabling reliable global satellite communication."
    },
    {
      "year": 1971,
      "title": "People's Republic of China admitted to the United Nations",
      "description": "The United Nations General Assembly voted to recognize the People's Republic of China as the legitimate representative of China, replacing the Republic of China (Taiwan).",
      "category": "Politics/International Relations",
      "significance": "This represented a significant shift in diplomatic recognition and geopolitical dynamics during the Cold War era."
    },
    {
      "year": 1996,
      "title": "The Mars Global Surveyor spacecraft launched",
      "description": "NASA launched Mars Global Surveyor to study the surface and atmosphere of Mars.",
      "category": "Science/Exploration",
      "significance": "The mission greatly improved knowledge of the Martian environment and geography, contributing valuable data for future missions."
    }
  ]
}