{
  "date": "November 30",
  "events": [
    {
      "year": 1874,
      "title": "First Impressionist Exhibition Opens in Paris",
      "description": "The first independent exhibition by the Impressionists opened in Paris, showcasing works by artists including Monet, Degas, and Renoir.",
      "category": "Art and Culture",
      "significance": "This exhibition marked a major shift in art history, challenging traditional styles and leading to the recognition of Impressionism as a major art movement."
    },
    {
      "year": 1939,
      "title": "Soviet Union Invades Finland Starting the Winter War",
      "description": "The Soviet Union launched an invasion of Finland, initiating the Winter War, after Finland refused demands for territorial concessions.",
      "category": "Military and War",
      "significance": "The Winter War exposed the vulnerabilities of the Soviet military and gained international sympathy for Finland."
    },
    {
      "year": 1954,
      "title": "The U.S. Senate Votes to Censure Senator Joseph McCarthy",
      "description": "The United States Senate formally censured Senator Joseph McCarthy for conduct unbecoming a senator related to his anti-communist investigations.",
      "category": "Politics",
      "significance": "This event marked the decline of McCarthy's influence and a turning point against the Red Scare in the United States."
    },
    {
      "year": 1995,
      "title": "Toy Story Released in Theaters",
      "description": "Pixar's 'Toy Story,' the first fully computer-animated feature film, was released.",
      "category": "Film and Technology",
      "significance": "Toy Story revolutionized animation and established CGI as a dominant technology in filmmaking."
    },
    {
      "year": 2008,
      "title": "The Mumbai Terror Attacks End",
      "description": "The 2008 Mumbai terror attacks, which lasted for four days, officially ended on November 30, with security forces regaining control of the city.",
      "category": "Terrorism and Security",
      "significance": "These attacks resulted in significant loss of life and led to global discussions on counter-terrorism measures."
    }
  ]
}