{
  "date": "May 3",
  "events": [
    {
      "year": 1494,
      "title": "Christopher Columbus lands in Jamaica",
      "description": "During his second voyage to the New World, Christopher Columbus and his crew arrived at the island of Jamaica, which became a Spanish colony.",
      "category": "Exploration",
      "significance": "This event marked further Spanish exploration and expansion into the Caribbean, influencing subsequent colonization efforts."
    },
    {
      "year": 1791,
      "title": "Polish Constitution of May 3rd adopted",
      "description": "The Polish–Lithuanian Commonwealth adopted the Constitution of May 3, 1791, Europe's first and the world's second modern codified constitution.",
      "category": "Political",
      "significance": "It was a pioneering legal document aimed at reforming and strengthening the Commonwealth, influencing democratic movements in Europe."
    },
    {
      "year": 1937,
      "title": "German airship Hindenburg disaster",
      "description": "The LZ 129 Hindenburg, a German passenger airship, caught fire and was destroyed during its attempt to dock at the Lakehurst Naval Air Station in New Jersey, USA.",
      "category": "Transportation Disaster",
      "significance": "The disaster marked the end of the airship era and was a significant event in aviation history due to the loss of life and media coverage."
    },
    {
      "year": 1947,
      "title": "House Un-American Activities Committee begins investigation of Hollywood",
      "description": "The HUAC began investigating alleged communist influence in the film industry, leading to blacklisting and censorship in Hollywood.",
      "category": "Political/Cultural",
      "significance": "This was a key moment in the Red Scare and Cold War-era politics shaping American culture and politics."
    },
    {
      "year": 1979,
      "title": "Margaret Thatcher becomes UK Prime Minister",
      "description": "Margaret Thatcher was sworn in as the Prime Minister of the United Kingdom, becoming the first woman to hold the position.",
      "category": "Political",
      "significance": "Her leadership marked a significant political shift in the UK with the introduction of conservative economic and social policies."
    }
  ]
}