{
  "date": "May 7",
  "events": [
    {
      "year": 1945,
      "title": "Germany's Surrender in World War II",
      "description": "Germany formally surrenders unconditionally to the Allies, marking the end of World War II in Europe.",
      "category": "War and Conflict",
      "significance": "This event marks Victory in Europe (V-E) Day and the end of over six years of devastating war in Europe."
    },
    {
      "year": 1915,
      "title": "Sinking of the RMS Lusitania",
      "description": "The British ocean liner RMS Lusitania is sunk by a German U-boat, killing 1,198 passengers and crew.",
      "category": "Maritime Disaster / War",
      "significance": "The sinking contributed to shifting public opinion in the United States against Germany during World War I."
    },
    {
      "year": 1824,
      "title": "Beethoven's Ninth Symphony Premiere",
      "description": "Ludwig van Beethoven's Ninth Symphony is performed for the first time in Vienna.",
      "category": "Culture / Music",
      "significance": "This symphony is considered one of the greatest compositions in Western music history, notable for its choral finale \"Ode to Joy.\""
    },
    {
      "year": 1992,
      "title": "Belgrade Protests Begin",
      "description": "Massive protests erupt in Belgrade, Yugoslavia, against Slobodan Milošević's regime following disputed elections.",
      "category": "Political Events",
      "significance": "The protests marked significant political unrest during the breakup of Yugoslavia and led to substantial political change."
    },
    {
      "year": 1919,
      "title": "First Transatlantic Flight Attempt by Vickers Vimy",
      "description": "British aviators Alcock and Brown complete the first nonstop transatlantic flight from Newfoundland to Ireland (actual date of arrival is May 15, but departure May 7).",
      "category": "Aviation / Exploration",
      "significance": "This pioneering flight demonstrated the potential for transatlantic air travel and was a major milestone in aviation history."
    }
  ]
}