{
  "date": "May 17",
  "events": [
    {
      "year": 1954,
      "title": "Brown v. Board of Education Ruling",
      "description": "The U.S. Supreme Court delivered a unanimous decision declaring that racial segregation in public schools was unconstitutional.",
      "category": "Legal/Civil Rights",
      "significance": "This landmark ruling helped to dismantle racial segregation in the United States and was a major victory for the Civil Rights Movement."
    },
    {
      "year": 1792,
      "title": "Signing of the Buttonwood Agreement",
      "description": "Twenty-four stockbrokers signed the Buttonwood Agreement in New York City, establishing the New York Stock Exchange (NYSE).",
      "category": "Economic/Financial",
      "significance": "This agreement marked the beginnings of one of the largest and most influential stock exchanges in the world, significantly impacting global finance."
    },
    {
      "year": 1928,
      "title": "Mickey Mouse Debuts",
      "description": "Walt Disney's iconic character Mickey Mouse made his first appearance in the cartoon 'Plane Crazy'.",
      "category": "Cultural/Entertainment",
      "significance": "Mickey Mouse became a global cultural icon and symbol of the Walt Disney Company, influencing entertainment worldwide."
    },
    {
      "year": 1940,
      "title": "Winston Churchill Becomes British Prime Minister",
      "description": "Winston Churchill was appointed Prime Minister of the United Kingdom during World War II after Neville Chamberlain's resignation.",
      "category": "Political/War",
      "significance": "Churchill's leadership was crucial in rallying Britain during WWII and shaping the Allied victory."
    },
    {
      "year": 1957,
      "title": "Integration of Little Rock Central High School Begins",
      "description": "Under federal troop protection, nine African American students, known as the Little Rock Nine, attempted to integrate Central High School in Arkansas.",
      "category": "Civil Rights/Education",
      "significance": "This event was a pivotal moment in the Civil Rights Movement, highlighting the struggle for desegregation in American schools."
    }
  ]
}