{
  "date": "May 19",
  "events": [
    {
      "year": 1536,
      "title": "Anne Boleyn Executed",
      "description": "Anne Boleyn, the Queen of England and second wife of King Henry VIII, was executed on charges of treason, adultery, and incest.",
      "category": "Politics/Monarchy",
      "significance": "Her execution marked a pivotal moment in the English Reformation and drastically impacted the monarchy and religious landscape of England."
    },
    {
      "year": 1848,
      "title": "Irish Potato Famine Refugees Arrive in Canada",
      "description": "The first significant group of Irish refugees from the Great Famine began arriving in Canada seeking relief from starvation and economic collapse.",
      "category": "Migration/Disaster",
      "significance": "This event led to a major demographic shift in Canada and highlighted the widespread human impacts of the famine."
    },
    {
      "year": 1962,
      "title": "Mariner 1 Launch Failure",
      "description": "NASA's Mariner 1 spacecraft, designed to fly by Venus, was destroyed shortly after launch due to a guidance system failure.",
      "category": "Science/Technology",
      "significance": "This failure emphasized the challenges of early space exploration and led to improvements in spacecraft guidance systems."
    },
    {
      "year": 1919,
      "title": "Mustafa Kemal Atatürk Lands at Samsun",
      "description": "Mustafa Kemal Atatürk landed at Samsun, marking the beginning of the Turkish War of Independence.",
      "category": "Politics/War",
      "significance": "This event is considered the start of the formation of modern Turkey and Atatürk is celebrated as the founder of the Turkish Republic."
    },
    {
      "year": 1990,
      "title": "Hubble Space Telescope Launched",
      "description": "The Hubble Space Telescope, a major space-based observatory, was launched into orbit by the Space Shuttle Discovery.",
      "category": "Science/Technology",
      "significance": "The Hubble has vastly expanded our understanding of the universe through its detailed observations and has become one of the most important tools in modern astronomy."
    }
  ]
}