{
  "date": "May 21",
  "events": [
    {
      "year": 1527,
      "title": "Sack of Rome",
      "description": "Troops of Charles V, Holy Roman Emperor, sack Rome, marking the end of the Renaissance in Italy and significant weakening of the Papal States.",
      "category": "Military/Political",
      "significance": "This event dramatically shifted the balance of power in Italy and Europe, initiating changes in the religious and political landscape of Europe."
    },
    {
      "year": 1881,
      "title": "American Red Cross Founded",
      "description": "Clara Barton founds the American Red Cross, an organization dedicated to emergency assistance, disaster relief, and education in the United States.",
      "category": "Social/Organizational",
      "significance": "The American Red Cross played a crucial role in providing humanitarian aid and shaping emergency response strategies in the US and abroad."
    },
    {
      "year": 1927,
      "title": "Charles Lindbergh Completes First Solo Transatlantic Flight",
      "description": "Charles Lindbergh lands his airplane, the Spirit of St. Louis, in Paris, completing the first solo nonstop transatlantic flight from New York to Paris.",
      "category": "Aviation/Exploration",
      "significance": "This pioneering flight marked a major milestone in aviation history and inspired advances in commercial air travel."
    },
    {
      "year": 1991,
      "title": "Croatian War of Independence Begins",
      "description": "The Battle of Vukovar begins, marking a significant escalation in the Croatian War of Independence against Yugoslav forces.",
      "category": "Military/Political",
      "significance": "This conflict was central to the dissolution of Yugoslavia and reshaped the political boundaries in the Balkans."
    },
    {
      "year": 2004,
      "title": "Death of Ronald Reagan",
      "description": "Ronald Reagan, 40th President of the United States, dies at the age of 93.",
      "category": "Political/Death",
      "significance": "Reagan was a pivotal figure in late 20th-century American politics, known for his conservative policies and influence in ending the Cold War."
    }
  ]
}