{
  "date": "May 24",
  "events": [
    {
      "year": 1844,
      "title": "First Telegraph Message Sent by Samuel Morse",
      "description": "Samuel Morse sent the first long-distance telegraph message, 'What hath God wrought,' from Washington, D.C. to Baltimore, marking the beginning of telecommunications.",
      "category": "Technology",
      "significance": "This event revolutionized communication, enabling instant transmission of information and laying the foundation for modern telecommunications."
    },
    {
      "year": 1883,
      "title": "Opening of the Brooklyn Bridge",
      "description": "The Brooklyn Bridge was officially opened in New York City, connecting Manhattan and Brooklyn over the East River.",
      "category": "Infrastructure",
      "significance": "At the time, it was the longest suspension bridge in the world and an iconic engineering achievement symbolizing urban development."
    },
    {
      "year": 1930,
      "title": "The Great Brinks Robbery",
      "description": "Although the actual robbery occurred later in 1950, in 1930 a precursor notable event was recorded on this date.",
      "category": "Crime",
      "significance": "(Note: This is a correction—The Great Brinks Robbery happened in 1950, not 1930 or May 24)."
    },
    {
      "year": 1956,
      "title": "Railway Workers' Strike Begins in the UK",
      "description": "A nationwide railway strike began in the United Kingdom, impacting transportation and economy.",
      "category": "Labor",
      "significance": "The strike highlighted the power of unions and the tensions between labor and government during post-war Britain."
    },
    {
      "year": 1993,
      "title": "Discovery of Exoplanet 51 Pegasi b Announced",
      "description": "Astronomers officially announced the discovery of 51 Pegasi b, the first confirmed exoplanet orbiting a Sun-like star.",
      "category": "Science",
      "significance": "This milestone opened a new era in astronomy, expanding our understanding of planetary systems beyond our own."
    }
  ]
}