{
  "date": "May 25",
  "events": [
    {
      "year": 1787,
      "title": "Start of the U.S. Constitutional Convention",
      "description": "Delegates gathered at Independence Hall in Philadelphia to draft the United States Constitution.",
      "category": "Political",
      "significance": "The convention led to the creation of the U.S. Constitution, which remains the foundation of American government and law."
    },
    {
      "year": 1935,
      "title": "First Controlled Flight of the Messerschmitt Me 262",
      "description": "The Messerschmitt Me 262, the world's first operational jet-powered fighter aircraft, had its first successful test flight.",
      "category": "Technological",
      "significance": "This development marked a significant advancement in military aviation technology during World War II."
    },
    {
      "year": 1977,
      "title": "Premiere of Star Wars",
      "description": "The original Star Wars film (later retitled Star Wars Episode IV: A New Hope) premiered in theaters.",
      "category": "Cultural",
      "significance": "The film revolutionized cinema with its special effects and storytelling, launching a massive franchise and influencing popular culture worldwide."
    },
    {
      "year": 1961,
      "title": "John F. Kennedy Announces the Goal to Land a Man on the Moon",
      "description": "President Kennedy delivered a speech to Congress setting the ambitious goal of sending an American safely to the Moon before the end of the decade.",
      "category": "Political/Technological",
      "significance": "This commitment initiated the Apollo program and marked a critical point in the Space Race during the Cold War."
    },
    {
      "year": 2008,
      "title": "Large Protests Against the Government in Georgia Begin",
      "description": "Mass demonstrations started in Tbilisi against President Mikheil Saakashvili, accusing his administration of authoritarian practices.",
      "category": "Political",
      "significance": "These protests highlighted political tensions and demanded democratic reforms in the post-Soviet nation."
    }
  ]
}