{
  "date": "May 26",
  "events": [
    {
      "year": 1896,
      "title": "First modern Olympic Games announced",
      "description": "The International Olympic Committee announced that the first modern Olympic Games would be held in Athens, Greece, reviving the ancient tradition.",
      "category": "Sports",
      "significance": "This event marked the beginning of the modern Olympic movement, promoting international sports competition and unity."
    },
    {
      "year": 1897,
      "title": "Birth of T.S. Eliot",
      "description": "Thomas Stearns Eliot, an influential American-English poet, essayist, publisher, playwright, and literary critic, was born.",
      "category": "Birth",
      "significance": "Eliot became one of the 20th century's major poets, notably for works like 'The Waste Land' and 'The Love Song of J. Alfred Prufrock'."
    },
    {
      "year": 1940,
      "title": "British Expeditionary Force evacuates from Dunkirk",
      "description": "The evacuation of allied soldiers from the beaches of Dunkirk, France, was completed, rescuing over 338,000 troops during World War II.",
      "category": "Military",
      "significance": "This evacuation was a pivotal moment in WWII, preserving the core of Britain's fighting forces against Nazi Germany."
    },
    {
      "year": 1950,
      "title": "Schuman Declaration proposed the European Coal and Steel Community",
      "description": "French foreign minister Robert Schuman proposed the creation of the European Coal and Steel Community, laying groundwork for European integration.",
      "category": "Political",
      "significance": "This declaration is considered a foundational step towards the creation of the European Union, fostering peace and cooperation in Europe."
    },
    {
      "year": 1998,
      "title": "India conducts nuclear tests",
      "description": "India carried out a series of nuclear tests at Pokhran, asserting itself as a nuclear weapons state.",
      "category": "Military/Political",
      "significance": "These tests altered the strategic balance in South Asia and had significant implications for global non-proliferation efforts."
    }
  ]
}