{
  "date": "May 29",
  "events": [
    {
      "year": 1453,
      "title": "Fall of Constantinople",
      "description": "Ottoman forces led by Sultan Mehmed II captured Constantinople, marking the end of the Byzantine Empire.",
      "category": "Military/Political",
      "significance": "This event represents a major turning point in world history, effectively ending the Middle Ages and marking the rise of the Ottoman Empire as a dominant power."
    },
    {
      "year": 1660,
      "title": "The Restoration of the English Monarchy",
      "description": "King Charles II was restored to the throne of England, marking the end of the Commonwealth period.",
      "category": "Political",
      "significance": "The Restoration restored the monarchy after the English Civil War and Interregnum, profoundly influencing the British political system and monarchy."
    },
    {
      "year": 1913,
      "title": "The Armory Show Opens in New York",
      "description": "The International Exhibition of Modern Art, known as the Armory Show, opened in New York City, introducing Americans to European avant-garde art.",
      "category": "Cultural",
      "significance": "This event significantly influenced modern art in America, exposing the public to new styles such as Cubism and Fauvism."
    },
    {
      "year": 1953,
      "title": "Everest Conquered for the First Time",
      "description": "Sir Edmund Hillary and Tenzing Norgay became the first climbers confirmed to reach the summit of Mount Everest.",
      "category": "Exploration",
      "significance": "This feat was a major milestone in human exploration and mountaineering, symbolizing human endurance and determination."
    },
    {
      "year": 2004,
      "title": "The Republic of Montenegro Declares Independence",
      "description": "Montenegro officially declared its independence from the State Union of Serbia and Montenegro, becoming a sovereign nation.",
      "category": "Political",
      "significance": "This peaceful breakup marked the final dissolution of the former Yugoslavia's successor state, altering the political landscape of the Balkans."
    }
  ]
}