{
  "date": "May 30",
  "events": [
    {
      "year": 1431,
      "title": "Execution of Joan of Arc",
      "description": "Joan of Arc, a French heroine and Roman Catholic saint, was burned at the stake in Rouen, France, after being convicted of heresy.",
      "category": "Historical Events",
      "significance": "Her death made her a martyr and symbol of French unity and nationalism, leading to her eventual sainthood."
    },
    {
      "year": 1806,
      "title": "Death of Vice President Aaron Burr",
      "description": "Aaron Burr, the third Vice President of the United States, passed away on this day.",
      "category": "Births and Deaths",
      "significance": "Burr was a controversial figure in American history, known for his duel with Alexander Hamilton and his complex political legacy."
    },
    {
      "year": 1911,
      "title": "First Indianapolis 500 race held",
      "description": "The inaugural Indianapolis 500, a major automobile race, was held in Speedway, Indiana.",
      "category": "Sports and Culture",
      "significance": "The race became one of the most prestigious motor racing events in the world and a significant part of American motorsport history."
    },
    {
      "year": 1937,
      "title": "Golden Gate Bridge opens",
      "description": "The Golden Gate Bridge in San Francisco, California, was officially opened to vehicular traffic.",
      "category": "Engineering and Infrastructure",
      "significance": "At the time, it was the longest and tallest suspension bridge in the world and remains an iconic symbol of American engineering."
    },
    {
      "year": 1967,
      "title": "The first successful human heart transplant",
      "description": "Dr. Christiaan Barnard performed the world's first successful human heart transplant in Cape Town, South Africa.",
      "category": "Medical Milestones",
      "significance": "This groundbreaking surgery opened new avenues in medical science and transplant surgery."
    }
  ]
}