{
  "date": "May 31",
  "events": [
    {
      "year": 1859,
      "title": "First Use of a Transcontinental Telegraph",
      "description": "The first transcontinental telegraph line was completed, allowing rapid communication across the United States from coast to coast.",
      "category": "Technology/Communication",
      "significance": "This event marked the end of the Pony Express and revolutionized communication, enabling instant transmission of messages across vast distances."
    },
    {
      "year": 1889,
      "title": "Opening of the Eiffel Tower",
      "description": "The Eiffel Tower officially opened to the public during the 1889 Exposition Universelle in Paris, France.",
      "category": "Architecture/Culture",
      "significance": "A symbol of modern engineering and French ingenuity, the Eiffel Tower became an iconic landmark and a cultural symbol of France."
    },
    {
      "year": 1911,
      "title": "Triangle Shirtwaist Factory Fire",
      "description": "A devastating fire at the Triangle Shirtwaist Factory in New York City killed 146 garment workers, mostly young immigrant women.",
      "category": "Labor Rights/Disaster",
      "significance": "The tragedy led to significant reforms in workplace safety and labor laws, improving conditions for industrial workers."
    },
    {
      "year": 1961,
      "title": "South Africa Withdraws from the Commonwealth",
      "description": "Following a whites-only referendum, South Africa declared itself a republic and withdrew from the British Commonwealth.",
      "category": "Politics/Inherent Apartheid",
      "significance": "This marked South Africa's increasing international isolation due to its policy of apartheid, affecting global relations."
    },
    {
      "year": 2009,
      "title": "Death of Michael Jackson",
      "description": "Michael Jackson, the 'King of Pop,' died unexpectedly at age 50 in Los Angeles, California.",
      "category": "Culture/Music",
      "significance": "His death marked the end of an era in pop music and led to global mourning and renewed interest in his musical legacy."
    }
  ]
}