{
  "date": "August 4",
  "events": [
    {
      "year": 1914,
      "title": "Britain Declares War on Germany",
      "description": "Following Germany's invasion of Belgium, the United Kingdom declares war on Germany, marking its entry into World War I.",
      "category": "War and Conflict",
      "significance": "This declaration expanded World War I and brought significant global involvement into the conflict."
    },
    {
      "year": 1776,
      "title": "George Washington Orders the Evacuation of British Troops from Boston",
      "description": "During the American Revolutionary War, George Washington orders British forces to evacuate Boston after the Siege of Boston proves successful for the Americans.",
      "category": "American Revolution",
      "significance": "The evacuation marked an important early victory for the American forces and boosted morale."
    },
    {
      "year": 1964,
      "title": "The Gulf of Tonkin Resolution is Passed",
      "description": "The U.S. Congress passes the Gulf of Tonkin Resolution, allowing the President to increase U.S. military involvement in Vietnam without a formal declaration of war.",
      "category": "U.S. Politics and War",
      "significance": "This resolution significantly escalated the Vietnam War and impacted U.S. foreign policy."
    },
    {
      "year": 1879,
      "title": "Thomas Edison Invents the Practical Incandescent Light Bulb",
      "description": "Thomas Edison tests a filament that lasts over 40 hours, making the incandescent light bulb practical for widespread use.",
      "category": "Science and Technology",
      "significance": "This invention revolutionized indoor lighting and had a profound impact on society and industry."
    },
    {
      "year": 1911,
      "title": "Harambe, Oldest Known Gorilla, Born in Captivity",
      "description": "Harambe, a Western lowland gorilla, is born in captivity, later becoming famous worldwide.",
      "category": "Wildlife and Conservation",
      "significance": "Harambe's story raised global awareness about gorilla conservation and animal rights."
    }
  ]
}