{
  "date": "August 5",
  "events": [
    {
      "year": 1305,
      "title": "Execution of William Wallace",
      "description": "Scottish knight William Wallace was executed in London after being captured by the English. Wallace was a central figure in the First War of Scottish Independence.",
      "category": "Political/Military",
      "significance": "Wallace became a symbol of Scottish resistance and nationalism, inspiring future generations and contributing to Scotland's fight for independence."
    },
    {
      "year": 1821,
      "title": "Missouri becomes the 24th U.S. state",
      "description": "Missouri was admitted to the United States as the 24th state as part of the Missouri Compromise, which allowed Missouri to enter as a slave state and Maine as a free state to maintain the balance.",
      "category": "Political",
      "significance": "The Missouri Compromise was a critical early event in the sectional tensions leading up to the American Civil War."
    },
    {
      "year": 1962,
      "title": "Marilyn Monroe performs 'Happy Birthday' to President John F. Kennedy",
      "description": "Marilyn Monroe famously sang 'Happy Birthday, Mr. President' to John F. Kennedy at Madison Square Garden during his birthday celebration.",
      "category": "Cultural",
      "significance": "The performance is remembered as an iconic moment blending pop culture and politics during a charged era in American history."
    },
    {
      "year": 1972,
      "title": "United States and Soviet Union sign the SALT I treaty",
      "description": "The U.S. and USSR signed the Strategic Arms Limitation Talks (SALT I) agreement to limit nuclear weapons, marking a key moment during the Cold War détente.",
      "category": "Political/International Relations",
      "significance": "SALT I represented a significant step towards arms control and reducing the risk of nuclear conflict between superpowers."
    },
    {
      "year": 1991,
      "title": "Slovenia and Croatia declare independence from Yugoslavia",
      "description": "Both republics declared independence, triggering the breakup of Yugoslavia and leading to the Yugoslav Wars.",
      "category": "Political",
      "significance": "This event marked the beginning of the end of the Socialist Federal Republic of Yugoslavia and a major shift in the political landscape of the Balkans."
    }
  ]
}