{
  "date": "August 8",
  "events": [
    {
      "year": 1945,
      "title": "Soviet Union Declares War on Japan",
      "description": "The Soviet Union declared war on Japan, launching a massive invasion of Japanese-held territories in Manchuria during World War II.",
      "category": "Military/Political",
      "significance": "This action was significant as it hastened the Japanese surrender and the end of World War II in the Pacific."
    },
    {
      "year": 1963,
      "title": "Buddhist Monk Thích Quảng Đức Self-Immolation",
      "description": "Thích Quảng Đức, a Vietnamese Mahayana Buddhist monk, self-immolated at a busy Saigon intersection to protest the persecution of Buddhists by the South Vietnamese government.",
      "category": "Social/Religious Protest",
      "significance": "The event drew global attention to religious oppression in Vietnam and intensified opposition to the regime."
    },
    {
      "year": 1794,
      "title": "Battle of Kunersdorf",
      "description": "During the Seven Years' War, a coalition of Russian and Austrian forces decisively defeated the Prussian army led by Frederick the Great at Kunersdorf, Prussia (now Poland).",
      "category": "Military",
      "significance": "The defeat was one of Frederick the Great's worst and nearly ended Prussia's role as a major European power."
    },
    {
      "year": 1969,
      "title": "Apollo 11 Astronauts Quarantine Begins",
      "description": "Apollo 11 astronauts Neil Armstrong, Buzz Aldrin, and Michael Collins began a 21-day quarantine to prevent any potential contamination from lunar pathogens after their historic moon landing.",
      "category": "Space Exploration",
      "significance": "This was a crucial public health measure reflecting the new challenges of space exploration."
    },
    {
      "year": 1974,
      "title": "Resignation Announcement of U.S. President Richard Nixon",
      "description": "Richard Nixon announced his resignation from the presidency amid the Watergate scandal, effective August 9.",
      "category": "Political",
      "significance": "His resignation marked the first and only resignation of a U.S. president and had lasting implications for American politics and trust in government."
    }
  ]
}