{
  "date": "August 10",
  "events": [
    {
      "year": 1792,
      "title": "Storming of the Tuileries Palace",
      "description": "French revolutionaries stormed the Tuileries Palace in Paris, leading to the suspension of King Louis XVI and marking a turning point in the French Revolution.",
      "category": "Political Revolution",
      "significance": "Marked the radicalization of the French Revolution and the eventual abolition of the monarchy."
    },
    {
      "year": 1809,
      "title": "Battle of Wagram Ends",
      "description": "The Battle of Wagram between Napoleon's French army and Austrian forces ended with a decisive French victory during the Napoleonic Wars.",
      "category": "Military",
      "significance": "Secured Napoleon's dominance in Europe and led to the Treaty of Schönbrunn."
    },
    {
      "year": 1821,
      "title": "Ecuador's Declaration of Independence",
      "description": "Ecuador declared its independence from Spain, a significant step in the South American wars of independence.",
      "category": "Political Independence",
      "significance": "Began the process of nation-building for Ecuador as part of broader Latin American independence movements."
    },
    {
      "year": 1985,
      "title": "Mexico City Earthquake",
      "description": "A devastating earthquake struck Mexico City, causing widespread destruction and killing thousands of people.",
      "category": "Natural Disaster",
      "significance": "Led to major changes in earthquake preparedness and urban planning in Mexico."
    },
    {
      "year": 2010,
      "title": "Poland and Lithuania Celebrate the 600th Anniversary of the Battle of Grunwald",
      "description": "Commemorations marked the 600th anniversary of the Battle of Grunwald, where Polish-Lithuanian forces defeated the Teutonic Knights.",
      "category": "Historical Commemoration",
      "significance": "Celebrated a key historical victory symbolizing unity and strength in Polish and Lithuanian history."
    }
  ]
}