{
  "date": "August 11",
  "events": [
    {
      "year": 3114,
      "title": "Mesoamerican Long Count Calendar Epoch",
      "description": "The starting point (epoch) of the Mesoamerican Long Count calendar, used by the Maya civilization, traditionally correlates to August 11, 3114 BC in the Gregorian calendar.",
      "category": "Cultural/Calendar",
      "significance": "Marks the beginning of the Mesoamerican Long Count calendar, fundamental for understanding Mesoamerican chronology."
    },
    {
      "year": 1492,
      "title": "Christopher Columbus sets sail from Palos de la Frontera",
      "description": "Christopher Columbus departs Spain with three ships (the Niña, the Pinta, and the Santa María) on his first voyage to the New World.",
      "category": "Exploration",
      "significance": "Initiated the European exploration and eventual colonization of the Americas."
    },
    {
      "year": 1776,
      "title": "British troops evacuate Boston",
      "description": "British forces withdraw from Boston, ending the Siege of Boston during the American Revolutionary War.",
      "category": "Military/War",
      "significance": "A major strategic victory for the American colonies, boosting morale early in the war."
    },
    {
      "year": 1929,
      "title": "First Academy Awards ceremony held",
      "description": "The first-ever Academy Awards (Oscars) ceremony takes place in Hollywood, California, honoring outstanding achievements in filmmaking.",
      "category": "Culture/Entertainment",
      "significance": "Inaugurated what has become the most prestigious annual awards event in the film industry."
    },
    {
      "year": 1942,
      "title": "Jewish ghettos established by Nazis in Eastern Europe",
      "description": "The Nazi regime begins systematically establishing Jewish ghettos in Eastern Europe as part of the Holocaust.",
      "category": "World War II/Holocaust",
      "significance": "Marked a tragic escalation in the persecution of Jews during World War II."
    }
  ]
}