{
  "date": "August 17",
  "events": [
    {
      "year": 1945,
      "title": "Indonesia Proclaims Independence",
      "description": "Indonesian nationalist leaders Sukarno and Mohammad Hatta declared Indonesia's independence from Dutch colonial rule.",
      "category": "Political",
      "significance": "This event marked the beginning of Indonesia's struggle for full sovereignty, leading to the eventual recognition of its independence."
    },
    {
      "year": 1943,
      "title": "Beginning of the Battle of Kursk",
      "description": "The Battle of Kursk began during World War II, involving a massive German offensive against Soviet forces in the Eastern Front.",
      "category": "Military",
      "significance": "Known as the largest tank battle in history, the Soviet victory marked a decisive turning point in favor of the Allies on the Eastern Front."
    },
    {
      "year": 1960,
      "title": "Congo Gains Independence from Belgium",
      "description": "The Republic of the Congo (Léopoldville) officially gained independence after years of Belgian colonial rule.",
      "category": "Political",
      "significance": "This was a major milestone in the decolonization of Africa, sparking political changes across the continent."
    },
    {
      "year": 1987,
      "title": "Fiji Constitution Suspended Following Military Coup",
      "description": "The military government suspended the constitution and dissolved parliament in Fiji following a coup d'état.",
      "category": "Political",
      "significance": "This event reshaped Fiji's political landscape and raised questions about democracy and military power in the Pacific region."
    },
    {
      "year": 1962,
      "title": "First U.S. Navy SEALs Established",
      "description": "The United States Navy officially established the Navy SEALs (Sea, Air, and Land teams) as special operations forces.",
      "category": "Military",
      "significance": "The creation of the SEALs marked a significant development in U.S. military capabilities and special operations."
    }
  ]
}