{
  "date": "August 21",
  "events": [
    {
      "year": 1911,
      "title": "Hiram Bingham Rediscovered Machu Picchu",
      "description": "American historian and explorer Hiram Bingham III brought international attention to the ancient Incan city of Machu Picchu in Peru, which had been largely unknown to the outside world.",
      "category": "Exploration/Archaeology",
      "significance": "The discovery highlighted the cultural and historical importance of the Incan civilization and led to increased archaeological research and tourism in the Andes."
    },
    {
      "year": 1944,
      "title": "Liberation of Paris During World War II",
      "description": "Paris was liberated from German occupation by the French 2nd Armored Division and the U.S. 4th Infantry Division, aided by the French Resistance.",
      "category": "World War II/Military",
      "significance": "A major turning point in World War II, the liberation restored French sovereignty and symbolized the collapse of Nazi control in Western Europe."
    },
    {
      "year": 1959,
      "title": "Hawaii Becomes 50th U.S. State",
      "description": "Hawaii was officially admitted as the 50th state of the United States, expanding the nation's territory into the Pacific Ocean.",
      "category": "Political History",
      "significance": "Statehood marked an important expansion of American political and cultural influence, integrating a unique and diverse region into the U.S. federation."
    },
    {
      "year": 1986,
      "title": "People Power Revolution Ends Marcos Regime in the Philippines",
      "description": "Following a series of protests and political pressure, Ferdinand Marcos fled the Philippines, ending his 20-year dictatorship and restoring democracy under Corazon Aquino.",
      "category": "Political History/Revolution",
      "significance": "This peaceful revolution inspired similar democratic movements worldwide and restored democratic governance in the Philippines."
    }
  ]
}