{
  "date": "August 24",
  "events": [
    {
      "year": 410,
      "title": "Sack of Rome by the Visigoths",
      "description": "The Visigoths led by King Alaric I sacked Rome, marking the first time in 800 years that the city had been captured by a foreign enemy, signaling the decline of the Western Roman Empire.",
      "category": "Military/Political",
      "significance": "This event symbolized the weakening of Roman power and the transition to the Middle Ages in Europe."
    },
    {
      "year": 79,
      "title": "Eruption of Mount Vesuvius",
      "description": "Mount Vesuvius erupted catastrophically, burying the Roman cities of Pompeii and Herculaneum under volcanic ash and preserving them for centuries.",
      "category": "Natural Disaster",
      "significance": "The eruption provides critical archaeological insights into Roman life and has influenced volcanology and disaster preparedness."
    },
    {
      "year": 1814,
      "title": "Burning of Washington during the War of 1812",
      "description": "British forces invaded Washington, D.C., setting fire to the White House, the Capitol, and other public buildings during the War of 1812.",
      "category": "Military/Political",
      "significance": "This event was a major blow to American morale but galvanized national resolve during the young nation's conflict with Britain."
    },
    {
      "year": 1932,
      "title": "Audi brand founded",
      "description": "August Horch founded the Audi brand, which would go on to become one of the leading luxury automobile manufacturers in the world.",
      "category": "Business/Industry",
      "significance": "This marked the beginning of a brand that would be influential in automotive engineering and design."
    },
    {
      "year": 1949,
      "title": "North Atlantic Treaty signed",
      "description": "The North Atlantic Treaty was signed in Washington, D.C., establishing NATO as a military alliance among Western nations.",
      "category": "Political/Military",
      "significance": "NATO was a key organization in the Cold War, providing collective security against Soviet expansion."
    }
  ]
}