{
  "date": "August 28",
  "events": [
    {
      "year": 1963,
      "title": "Martin Luther King Jr.'s \"I Have a Dream\" Speech",
      "description": "During the March on Washington for Jobs and Freedom, Martin Luther King Jr. delivered his landmark \"I Have a Dream\" speech on the steps of the Lincoln Memorial in Washington, D.C., advocating for racial equality and civil rights.",
      "category": "Civil Rights",
      "significance": "This speech became a defining moment in the American Civil Rights Movement and continues to inspire social justice efforts worldwide."
    },
    {
      "year": 1845,
      "title": "The Knickerbocker Storm Hits New York City",
      "description": "One of the worst snowstorms to hit New York City occurred on this day, dropping significant amounts of snow within 24 hours and causing widespread disruption.",
      "category": "Natural Disaster",
      "significance": "The storm was notable for its intensity and impact on urban life in the mid-19th century, illustrating early challenges of urban disaster management."
    },
    {
      "year": 1859,
      "title": "North Carolina Voters Reject Secession",
      "description": "In a referendum, North Carolina voters decided against secession from the Union, reflecting divided public opinion in the state amidst rising tensions before the American Civil War.",
      "category": "Political",
      "significance": "This event highlighted the complex loyalties in border states and set the stage for eventual secession and participation in the Confederacy."
    },
    {
      "year": 1928,
      "title": "Alexander Fleming Discovers Penicillin",
      "description": "Alexander Fleming discovered penicillin, the first true antibiotic, when he noticed that a mold had killed bacteria in a petri dish, leading to the development of life-saving antibiotics.",
      "category": "Scientific Discovery",
      "significance": "This discovery revolutionized medicine by introducing effective treatment for bacterial infections, dramatically reducing mortality from infectious diseases."
    }
  ]
}