{
  "date": "August 5",
  "plants": [
    {
      "name": "Hibiscus rosa-sinensis",
      "commonName": "Chinese Hibiscus",
      "description": "A tropical evergreen shrub known for its large, colorful, trumpet-shaped flowers. It thrives in warm climates and blooms nearly year-round in tropical zones, with peak blooming in summer months.",
      "bloomingSeason": "June to September (peak bloom in summer)",
      "location": "Tropical and subtropical regions worldwide, including Hawaii, Southeast Asia, and Pacific Islands",
      "colors": [
        "red",
        "pink",
        "yellow",
        "orange",
        "white"
      ],
      "emoji": "🌺",
      "funFact": "Hibiscus flowers are often used to make herbal teas believed to have health benefits, like lowering blood pressure."
    },
    {
      "name": "Echinacea purpurea",
      "commonName": "Purple Coneflower",
      "description": "A hardy perennial wildflower native to North America, characterized by daisy-like purple petals and a prominent spiky orange center cone. Known for attracting pollinators such as bees and butterflies.",
      "bloomingSeason": "June to August",
      "location": "Prairies and open woodlands of eastern and central United States",
      "colors": [
        "purple",
        "pink"
      ],
      "emoji": "🌸",
      "funFact": "Echinacea is widely used in herbal remedies believed to boost the immune system."
    },
    {
      "name": "Banksia grandis",
      "commonName": "Bull Banksia",
      "description": "A large shrub or small tree native to southwestern Australia, notable for its massive cylindrical golden flower spikes that are rich in nectar, attracting birds and mammals.",
      "bloomingSeason": "July to October",
      "location": "Southwest Australia",
      "colors": [
        "golden yellow"
      ],
      "emoji": "🌼",
      "funFact": "Banksia flowers contain hundreds of tiny individual flowers densely packed into a cone-shaped inflorescence."
    },
    {
      "name": "Alstroemeria aurea",
      "commonName": "Peruvian Lily",
      "description": "A vibrant perennial native to South America, producing clusters of lily-like blossoms with unique markings. Popular in bouquets and gardens for its long-lasting flowers.",
      "bloomingSeason": "Summer to early autumn (December to April in Southern Hemisphere, corresponds to August in Northern Hemisphere cultivation)",
      "location": "Native to Chile and Argentina; cultivated worldwide",
      "colors": [
        "yellow",
        "orange",
        "red"
      ],
      "emoji": "🌷",
      "funFact": "Alstroemeria blooms can last up to two weeks when cut, making them excellent for floral arrangements."
    }
  ]
}