{
  "date": "August 7",
  "plants": [
    {
      "name": "Helianthus annuus",
      "commonName": "Common Sunflower",
      "description": "A tall annual plant known for its large, bright yellow flower heads that track the sun's movement through the day. Sunflowers thrive in temperate climates and are widely cultivated for their seeds and oil.",
      "bloomingSeason": "July to September",
      "location": "North America, Europe, cultivated worldwide",
      "colors": [
        "Yellow",
        "Brown"
      ],
      "emoji": "🌻",
      "funFact": "Sunflowers can grow up to 3 meters (10 feet) tall and their flower heads exhibit heliotropism, turning to face the sun to maximize photosynthesis."
    },
    {
      "name": "Nelumbo nucifera",
      "commonName": "Sacred Lotus",
      "description": "An aquatic perennial plant with large, fragrant pink or white flowers that rise above the water surface. The lotus is significant culturally and spiritually in many Asian traditions.",
      "bloomingSeason": "June to August",
      "location": "Asia, especially India and China",
      "colors": [
        "Pink",
        "White"
      ],
      "emoji": "🌸",
      "funFact": "All parts of the lotus plant are edible and it can regulate its flower temperature, maintaining heat like warm-blooded animals."
    },
    {
      "name": "Alstroemeria aurea",
      "commonName": "Peruvian Lily",
      "description": "A vibrant perennial flower with trumpet-shaped blooms in shades of orange, yellow, and red, native to South America. Often cultivated as a garden plant or cut flower.",
      "bloomingSeason": "July to September",
      "location": "Chile, Argentina, cultivated worldwide",
      "colors": [
        "Orange",
        "Yellow",
        "Red"
      ],
      "emoji": "🌺",
      "funFact": "Alstroemerias have a unique twisting stem mechanism; their leaves appear to be upside down due to a twist in the petiole."
    },
    {
      "name": "Echinacea purpurea",
      "commonName": "Purple Coneflower",
      "description": "A robust wildflower native to North America, known for its distinctive purple petals surrounding a spiny central cone. Popular in gardens and naturalized areas.",
      "bloomingSeason": "June to August",
      "location": "Central and Eastern United States",
      "colors": [
        "Purple",
        "Pink"
      ],
      "emoji": "🌼",
      "funFact": "Purple coneflowers are important medicinal plants used to boost the immune system and have been traditionally used by Native Americans."
    }
  ]
}