{
  "date": "August 9",
  "plants": [
    {
      "name": "Hibiscus rosa-sinensis",
      "commonName": "Chinese Hibiscus",
      "description": "An evergreen tropical shrub renowned for its large, brightly colored flowers. These blooms often have a prominent stamen and come in a variety of colors including red, pink, orange, and yellow. Hibiscus rosa-sinensis thrives in warm climates and is commonly cultivated in gardens and landscapes in tropical and subtropical regions.",
      "bloomingSeason": "Year-round in tropical climates, peak bloom from late spring through summer",
      "location": "Tropical and subtropical regions worldwide, including parts of Asia, the Pacific Islands, and the southern United States",
      "colors": [
        "Red",
        "Pink",
        "Orange",
        "Yellow"
      ],
      "emoji": "🌺",
      "funFact": "Hibiscus flowers are used in herbal teas and traditional medicine, and their vivid colors can attract pollinators like hummingbirds and butterflies."
    },
    {
      "name": "Helianthus annuus",
      "commonName": "Common Sunflower",
      "description": "A tall annual plant notable for its large flower head with bright yellow petals and a dark brown center. Sunflowers are heliotropic and their blooms can reach impressive sizes. They are widely cultivated for ornamental purposes, seeds, and oil production.",
      "bloomingSeason": "Mid-summer to early autumn (July to September)",
      "location": "Native to North America but cultivated worldwide, especially in temperate regions",
      "colors": [
        "Yellow"
      ],
      "emoji": "🌻",
      "funFact": "Sunflowers can grow to heights over 3 meters. Their seeds are a favorite snack for birds and humans and are rich in healthy oils."
    },
    {
      "name": "Delphinium elatum",
      "commonName": "Delphinium",
      "description": "A tall perennial flower with spikes of hooded blossoms, typically in shades of blue, purple, pink, and white. Delphiniums prefer cooler summers and are popular in garden borders and cottage gardens.",
      "bloomingSeason": "Summer, usually June to August",
      "location": "Native to the Northern Hemisphere, commonly grown in temperate gardens across Europe, Asia, and North America",
      "colors": [
        "Blue",
        "Purple",
        "Pink",
        "White"
      ],
      "emoji": "💐",
      "funFact": "Delphiniums contain alkaloids making them toxic if ingested, but they are beloved for attracting bees and butterflies."
    },
    {
      "name": "Rhododendron arboreum",
      "commonName": "Tree Rhododendron",
      "description": "An evergreen tree or large shrub producing large clusters of brilliant red, pink, or white trumpet-shaped flowers. It is the national flower of Nepal and grows predominantly in mountainous areas.",
      "bloomingSeason": "Late spring to early summer, but high-altitude varieties may bloom into early August",
      "location": "Himalayan region, including Nepal, Bhutan, and northeastern India",
      "colors": [
        "Red",
        "Pink",
        "White"
      ],
      "emoji": "🌸",
      "funFact": "The flowers of Rhododendron arboreum are edible and sometimes used to make a refreshing juice or jam in Himalayan cuisines."
    }
  ]
}