{
  "date": "August 18",
  "plants": [
    {
      "name": "Helianthus annuus",
      "commonName": "Sunflower",
      "description": "A tall annual plant with large, bright yellow flower heads that track the sun's movement during the day. Sunflowers are widely cultivated for their seeds and oil and are iconic in late summer landscapes.",
      "bloomingSeason": "July to September",
      "location": "Temperate regions worldwide, native to North America",
      "colors": [
        "Yellow"
      ],
      "emoji": "🌻",
      "funFact": "Sunflower heads are made up of hundreds of tiny flowers called florets, which mature into seeds."
    },
    {
      "name": "Hydrangea macrophylla",
      "commonName": "Bigleaf Hydrangea",
      "description": "Deciduous shrub known for large, globe-shaped flower clusters that can change color based on soil pH, blooming profusely in summer.",
      "bloomingSeason": "June to August",
      "location": "East Asia, commonly cultivated worldwide in temperate gardens",
      "colors": [
        "Blue",
        "Pink",
        "White"
      ],
      "emoji": "💐",
      "funFact": "The blue or pink color of Hydrangea flowers depends on soil acidity—acidic soils produce blue flowers, alkaline soils pink."
    },
    {
      "name": "Protea cynaroides",
      "commonName": "King Protea",
      "description": "An evergreen shrub with massive, striking flower heads resembling large artichokes, native to South Africa and a symbol of the country’s unique flora.",
      "bloomingSeason": "June to September",
      "location": "South Africa (fynbos biome)",
      "colors": [
        "Pink",
        "White",
        "Red"
      ],
      "emoji": "🌺",
      "funFact": "The protea flower is named after the Greek god Proteus, who could change his form, reflecting the flower's diverse shapes."
    },
    {
      "name": "Epilobium angustifolium",
      "commonName": "Fireweed",
      "description": "A perennial herb with tall spikes of bright pink-purple flowers, often one of the first plants to colonize burned forests in northern temperate and boreal regions.",
      "bloomingSeason": "June to September",
      "location": "Northern Hemisphere, including North America and Europe",
      "colors": [
        "Pink",
        "Purple"
      ],
      "emoji": "🌸",
      "funFact": "Fireweed spreads rapidly after fires, helping to stabilize and enrich soil for other plants to grow."
    }
  ]
}