{
  "date": "August 23",
  "plants": [
    {
      "name": "Helianthus annuus",
      "commonName": "Common Sunflower",
      "description": "A tall annual plant with large, bright yellow flower heads that track the sun's movement. Sunflowers are widely cultivated for their seeds and oil and are also popular in gardens for their cheerful appearance.",
      "bloomingSeason": "July to September",
      "location": "Native to North America; cultivated worldwide, especially in temperate regions",
      "colors": [
        "yellow",
        "brown"
      ],
      "emoji": "🌻",
      "funFact": "Sunflowers exhibit heliotropism when young, turning their heads to follow the sun across the sky."
    },
    {
      "name": "Hibiscus rosa-sinensis",
      "commonName": "Chinese Hibiscus",
      "description": "A tropical shrub known for its large, showy, trumpet-shaped flowers that come in a variety of vivid colors. Often grown ornamentally in warm climates and greenhouses.",
      "bloomingSeason": "Year-round in tropical climates; peaks in summer",
      "location": "Native to East Asia; cultivated in tropical and subtropical regions globally",
      "colors": [
        "red",
        "pink",
        "yellow",
        "white",
        "orange"
      ],
      "emoji": "🌺",
      "funFact": "Hibiscus flowers usually last only a day but bloom continuously throughout their season."
    },
    {
      "name": "Gentiana scabra",
      "commonName": "Japanese Gentian",
      "description": "A perennial wildflower with striking trumpet-shaped blue to purple flowers. Known for its intense flower color and medicinal properties in East Asia.",
      "bloomingSeason": "August to October",
      "location": "Native to East Asia, especially Japan and China",
      "colors": [
        "blue",
        "purple"
      ],
      "emoji": "💙",
      "funFact": "Gentians are often indicators of healthy alpine or mountainous ecosystems due to their specialized growth requirements."
    },
    {
      "name": "Coreopsis tinctoria",
      "commonName": "Plains Coreopsis",
      "description": "An annual wildflower featuring daisy-like yellow and crimson flowers. Popular in wildflower meadows and used for natural dye production.",
      "bloomingSeason": "June to September",
      "location": "Native to central and western North America",
      "colors": [
        "yellow",
        "red"
      ],
      "emoji": "🌼",
      "funFact": "The species name 'tinctoria' refers to its historical use as a source of dye."
    }
  ]
}