{
  "date": "April 3",
  "events": [
    {
      "year": 1860,
      "title": "First successful U.S. Pony Express run completed",
      "description": "The Pony Express completed its first successful run, delivering mail from Missouri to California in about 10 days, significantly reducing communication time across the continent.",
      "category": "Communication/Transportation",
      "significance": "Marked a milestone in rapid communication in the U.S. before the telegraph became widespread."
    },
    {
      "year": 1882,
      "title": "The first ball dropped in Times Square",
      "description": "The inaugural New Year's Eve ball drop took place in New York City's Times Square to celebrate the new year.",
      "category": "Cultural Tradition",
      "significance": "Became an iconic annual event symbolizing the arrival of the New Year."
    },
    {
      "year": 1948,
      "title": "President Harry S. Truman signs the Marshall Plan into law",
      "description": "The U.S. initiated the European Recovery Program (Marshall Plan) to aid Western Europe's economic recovery after World War II.",
      "category": "Politics/Economics",
      "significance": "Helped rebuild war-torn Europe and curb the spread of communism during the Cold War."
    },
    {
      "year": 1973,
      "title": "Skylab is launched by NASA",
      "description": "The United States launched Skylab, its first space station, to study the effects of long-duration spaceflight and conduct scientific experiments.",
      "category": "Science/Technology",
      "significance": "Advanced human space exploration and scientific research in orbit."
    },
    {
      "year": 1996,
      "title": "Dolly the sheep, the first cloned mammal, is introduced to the public",
      "description": "Scientists revealed the birth of Dolly, demonstrating that mammals can be cloned from adult cells.",
      "category": "Science/Technology",
      "significance": "Opened new possibilities and ethical debates in genetics and biotechnology."
    }
  ]
}