{
  "date": "April 7",
  "events": [
    {
      "year": 1862,
      "title": "Battle of Shiloh Begins",
      "description": "The Battle of Shiloh, one of the major early engagements of the American Civil War, started in southwestern Tennessee.",
      "category": "Military",
      "significance": "Marked one of the bloodiest battles in the Civil War, demonstrating the war's increasing brutality and high casualties."
    },
    {
      "year": 1948,
      "title": "Founding of the World Health Organization (WHO)",
      "description": "The World Health Organization officially came into existence as a specialized agency of the United Nations focused on international public health.",
      "category": "Global Health",
      "significance": "Established a global authority on health issues, leading international efforts in disease control and health promotion."
    },
    {
      "year": 1927,
      "title": "First Official Television Broadcast",
      "description": "BBC made the world's first official public television broadcast, demonstrating early television technology in London.",
      "category": "Technology",
      "significance": "Marked a major milestone in broadcast media, paving the way for modern television communication."
    },
    {
      "year": 1969,
      "title": "The Internet's 'Birthday' - ARPANET First Message",
      "description": "The first message was sent over the ARPANET, the precursor to the modern internet, between UCLA and Stanford Research Institute.",
      "category": "Technology",
      "significance": "Represented the dawn of the internet, revolutionizing communication and information sharing worldwide."
    },
    {
      "year": 1994,
      "title": "Rwandan Genocide Begins",
      "description": "The mass killing began in Rwanda following the assassination of President Juvénal Habyarimana, leading to one of the most devastating genocides in history.",
      "category": "Human Rights",
      "significance": "Resulted in the deaths of an estimated 800,000 people and highlighted the need for international intervention in genocide prevention."
    }
  ]
}