{
  "date": "April 9",
  "events": [
    {
      "year": 1865,
      "title": " Confederate General Robert E. Lee's Surrender at Appomattox Court House",
      "description": "General Robert E. Lee surrendered to Union General Ulysses S. Grant, effectively ending the American Civil War.",
      "category": "Military",
      "significance": "Marked the end of the bloodiest conflict in American history and led to the preservation of the United States."
    },
    {
      "year": 1940,
      "title": " Germany Invades Denmark and Norway",
      "description": "Nazi Germany launched Operation Weserübung, invading Denmark and Norway during World War II.",
      "category": "Military",
      "significance": "Expanded German control in Europe and secured strategic access to resources and naval routes."
    },
    {
      "year": 1967,
      "title": " The First Super Bowl is Broadcast in Color",
      "description": "Super Bowl I, the championship game of the NFL, was televised in color for the first time.",
      "category": "Cultural/Sports",
      "significance": "Marked a milestone in sports broadcasting, enhancing viewer experience and popularizing American football."
    },
    {
      "year": 1917,
      "title": " The Russian Tsar Nicholas II Abdicates",
      "description": "Czar Nicholas II of Russia abdicated the throne, leading to the eventual fall of the Romanov dynasty during the Russian Revolution.",
      "category": "Political",
      "significance": "Signaled the collapse of imperial rule in Russia and paved the way for Bolshevik control."
    },
    {
      "year": 1942,
      "title": " Bataan Death March Begins",
      "description": "After the surrender of the Bataan Peninsula to Japanese forces in World War II, thousands of Filipino and American prisoners were forced to march under brutal conditions.",
      "category": "Military/War Crimes",
      "significance": "An infamous atrocity highlighting the brutal treatment of prisoners of war, impacting Allied morale."
    }
  ]
}