{
  "date": "April 16",
  "events": [
    {
      "year": 73,
      "title": "Fall of Masada",
      "description": "The Roman Empire captures the fortress of Masada in present-day Israel after a lengthy siege, marking the end of the First Jewish–Roman War.",
      "category": "Military/Ancient History",
      "significance": "This event symbolizes Jewish resistance and has become a significant cultural and historical symbol in Jewish history."
    },
    {
      "year": 1746,
      "title": "Battle of Culloden",
      "description": "The Battle of Culloden takes place in Scotland, where British government forces defeat the Jacobite uprising led by Charles Edward Stuart (Bonnie Prince Charlie).",
      "category": "Military/European History",
      "significance": "This battle effectively ends the Jacobite rising of 1745 and leads to the consolidation of British control over Scotland."
    },
    {
      "year": 1912,
      "title": "Titanic Sets Sail",
      "description": "The RMS Titanic departs Southampton, England, on its maiden voyage towards New York City.",
      "category": "Maritime History",
      "significance": "The Titanic would famously sink on April 15, 1912, after hitting an iceberg, becoming one of the deadliest peacetime maritime disasters."
    },
    {
      "year": 1943,
      "title": "Sicilian Mafia Arrests",
      "description": "In a major crackdown, the Italian police arrest key members of the Sicilian Mafia, signaling aggressive attempts to weaken organized crime during World War II.",
      "category": "Crime/World War II",
      "significance": "This marked an important development in combating organized crime in Italy during a tumultuous period."
    },
    {
      "year": 2007,
      "title": "Virginia Tech Shooting",
      "description": "One of the deadliest school shootings in U.S. history occurs at Virginia Tech University, where a gunman kills 32 people before taking his own life.",
      "category": "Modern History/Crime",
      "significance": "The tragedy sparked nationwide debates about gun control, campus safety, and mental health awareness."
    }
  ]
}