{
  "date": "April 17",
  "events": [
    {
      "year": 1961,
      "title": "Bay of Pigs Invasion Begins",
      "description": "A CIA-sponsored paramilitary group of Cuban exiles landed at the Bay of Pigs in Cuba in an unsuccessful attempt to overthrow Fidel Castro's government.",
      "category": "Political/Military",
      "significance": "This event marked a significant Cold War conflict in the Americas and was a major embarrassment for the U.S. government."
    },
    {
      "year": 1941,
      "title": "Erwin Rommel Arrives in North Africa",
      "description": "Field Marshal Erwin Rommel arrived in Tripoli, Libya, to command the German Afrika Korps during World War II.",
      "category": "Military",
      "significance": "Rommel's leadership significantly influenced the North African Campaign, affecting control over the Mediterranean."
    },
    {
      "year": 1492,
      "title": "Christopher Columbus Sets Sail",
      "description": "Christopher Columbus departed from Palos de la Frontera, Spain, on his first voyage across the Atlantic Ocean.",
      "category": "Exploration",
      "significance": "This voyage led to the European discovery of the Americas, initiating widespread contact between Europe and the New World."
    },
    {
      "year": 1946,
      "title": "First Meeting of the United Nations Security Council",
      "description": "The inaugural session of the UN Security Council was held in London, marking the beginning of its role in maintaining global peace and security.",
      "category": "International Relations",
      "significance": "Established a key mechanism for international diplomatic security efforts after World War II."
    },
    {
      "year": 1902,
      "title": "Cuba Gains Independence from the United States",
      "description": "The Republic of Cuba was officially established, ending American military occupation following the Spanish-American War.",
      "category": "Political",
      "significance": "Marked the beginning of Cuban sovereignty and a significant shift in U.S.-Cuban relations."
    }
  ]
}