{
  "date": "April 22",
  "events": [
    {
      "year": 1970,
      "title": "First Earth Day is celebrated",
      "description": "The first Earth Day, a global environmental event, is celebrated to raise awareness about environmental protection and promote conservation efforts worldwide.",
      "category": "Environment",
      "significance": "Marked the beginning of the modern environmental movement and increased public awareness of environmental issues."
    },
    {
      "year": 1500,
      "title": "Pedro Álvares Cabral discovers Brazil",
      "description": "Portuguese navigator Pedro Álvares Cabral officially discovers Brazil on his voyage to India, claiming the land for Portugal.",
      "category": "Exploration",
      "significance": "Initiated Portuguese colonization in South America, shaping Brazilian history and culture."
    },
    {
      "year": 1972,
      "title": "Launch of Apollo 16",
      "description": "NASA launches the Apollo 16 mission to the Moon, the fifth manned mission to land there, with astronauts conducting valuable lunar exploration.",
      "category": "Space Exploration",
      "significance": "Provided important scientific data about the Moon and advanced human space travel."
    },
    {
      "year": 1915,
      "title": "Second Battle of Ypres begins",
      "description": "The Second Battle of Ypres during World War I begins, notable for the first large-scale use of poison gas by German forces.",
      "category": "War",
      "significance": "Marked a new and devastating form of chemical warfare and influenced future military tactics and warfare ethics."
    },
    {
      "year": 1978,
      "title": "Birth of Earth Day founder Gaylord Nelson",
      "description": "Gaylord Nelson, the founder of Earth Day and a prominent environmentalist and U.S. Senator, is honored for his contributions.",
      "category": "Biography",
      "significance": "His vision led to the establishment of Earth Day, catalyzing environmental activism worldwide."
    }
  ]
}