{
  "date": "April 23",
  "events": [
    {
      "year": 1564,
      "title": "Birth of William Shakespeare",
      "description": "William Shakespeare, the renowned English playwright and poet, was born on this day (baptized April 26, 1564) in Stratford-upon-Avon.",
      "category": "Birth",
      "significance": "Shakespeare is widely regarded as one of the greatest writers in the English language and world literature, shaping theatre and literature globally."
    },
    {
      "year": 1616,
      "title": "Death of William Shakespeare",
      "description": "William Shakespeare died on April 23, 1616, on his 52nd birthday according to the Julian calendar.",
      "category": "Death",
      "significance": "Marks the loss of a monumental literary figure whose works continue to influence drama and literature."
    },
    {
      "year": 1920,
      "title": "Founding of the Turkish National Assembly",
      "description": "The Grand National Assembly of Turkey held its first session on April 23, 1920, in Ankara, marking the foundation of modern Turkish governance during the Turkish War of Independence.",
      "category": "Political Event",
      "significance": "This event was crucial in establishing the Republic of Turkey and transitioning from the Ottoman Empire to a modern nation-state."
    },
    {
      "year": 1960,
      "title": "Madrid Train Bombings",
      "description": "On April 23, 1960, a series of bombings occurred on Madrid's commuter train system, attributed to anti-government opposition during Spain's Francoist regime.",
      "category": "Terrorism/Conflict",
      "significance": "The bombings highlighted political unrest and opposition in Spain under authoritarian rule."
    },
    {
      "year": 1985,
      "title": "UNESCO designates April 23 as World Book Day",
      "description": "UNESCO proclaimed April 23 as World Book and Copyright Day to promote reading, publishing, and the protection of intellectual property.",
      "category": "Cultural Milestone",
      "significance": "Encourages global awareness of books, authors, and the importance of literacy."
    }
  ]
}