{
  "date": "April 25",
  "events": [
    {
      "year": 1792,
      "title": "Mutiny on the Bounty",
      "description": "The HMS Bounty, under the command of Lieutenant William Bligh, faced a famous mutiny led by Masters' Mate Fletcher Christian in the South Pacific.",
      "category": "Maritime History",
      "significance": "This event became one of the most well-known mutinies in naval history and has been widely depicted in literature and film."
    },
    {
      "year": 1859,
      "title": "The First Groundbreaking of the Suez Canal",
      "description": "Construction began on the Suez Canal, which would connect the Mediterranean Sea to the Red Sea, significantly impacting global maritime trade routes.",
      "category": "Engineering/Infrastructure",
      "significance": "The canal revolutionized international shipping by drastically reducing travel distance between Europe and Asia."
    },
    {
      "year": 1915,
      "title": "Gallipoli Campaign Commences in World War I",
      "description": "Allied forces began the Gallipoli Campaign with landings on the Gallipoli peninsula in Turkey, aiming to secure a sea route to Russia.",
      "category": "Military History",
      "significance": "Despite being a significant military operation, it ended in heavy losses and withdrawal, shaping national identities, especially in Australia and New Zealand (ANZAC Day)."
    },
    {
      "year": 1945,
      "title": "Liberation of Italy's Capital Rome",
      "description": "Allied forces liberated Rome from Nazi occupation during World War II.",
      "category": "World War II",
      "significance": "This was the first Axis capital to fall to the Allies, marking a major turning point in the Italian Campaign."
    },
    {
      "year": 1974,
      "title": "Carnation Revolution in Portugal",
      "description": "A nearly bloodless military coup in Portugal led to the overthrow of the Estado Novo dictatorship, initiating a transition to democracy.",
      "category": "Political History",
      "significance": "This event ended decades of authoritarian rule and prompted decolonization in Portuguese colonies."
    }
  ]
}