{
  "date": "May 1",
  "holidays": [
    {
      "name": "May Day",
      "description": "An ancient celebration of spring and fertility, featuring dancing around the maypole, crowning a May Queen, and various folk festivities.",
      "origin": "Dating back to pre-Christian Europe, May Day marks the halfway point between the spring equinox and summer solstice and celebrates renewal and growth.",
      "category": "Seasonal/Folk",
      "emoji": "🌸",
      "funFact": "The maypole dance sometimes caused quite the whirl—some villages banned it to avoid chaos in the streets!"
    },
    {
      "name": "International Workers' Day",
      "description": "A day honoring laborers and the working class, often marked by parades, protests, and demonstrations for workers' rights.",
      "origin": "Rooted in the 1886 Haymarket affair in Chicago, it became a global day to advocate for fair labor practices and worker solidarity.",
      "category": "Social/Political",
      "emoji": "✊",
      "funFact": "Many countries use May 1 as a public holiday, turning it into a worldwide mega-focus on workers' power and rights."
    },
    {
      "name": "Hug a Tree Day",
      "description": "An unusual day encouraging people to literally hug a tree to foster a connection with nature and promote environmental awareness.",
      "origin": "Started in the late 20th century as an Earth-friendly campaign to support conservation efforts and remind people of nature's value.",
      "category": "Environmental",
      "emoji": "🌳",
      "funFact": "Hugging a tree for just two minutes can actually boost your mood and lower stress—nature’s own therapy!"
    },
    {
      "name": "Loyalty Day",
      "description": "A U.S. observance dedicated to reaffirming loyalty to the country and recognizing the heritage of American freedom.",
      "origin": "Established during the Cold War in 1958 as a counter to the growing popularity of International Workers' Day.",
      "category": "National/Patriotic",
      "emoji": "🇺🇸",
      "funFact": "Loyalty Day is less well known than May Day but is officially recognized by the U.S. government every May 1."
    },
    {
      "name": "Oderus Urungus Day",
      "description": "A quirky fan holiday celebrating the late lead singer of GWAR, known for his outrageous costumes and theatrical heavy metal performances.",
      "origin": "Fans of the band honor Oderus Urungus (Dave Brockie) on May 1, marking his birthdate and legendary contribution to metal culture.",
      "category": "Pop Culture/Music",
      "emoji": "🤘",
      "funFact": "Oderus was famous for battling monsters on stage and spouting wild, hilarious profanity—not your typical birthday party!"
    }
  ]
}