{
  "date": "May 2",
  "holidays": [
    {
      "name": "Tater Tot Day",
      "description": "A celebration dedicated to the beloved crispy, golden potato bite known as the tater tot! Perfect day to snack on these deliciously simple treats or get creative with tater tot recipes.",
      "origin": "Created by the American Frozen Food Institute to honor this classic comfort food.",
      "category": "Food Holiday",
      "emoji": "🥔",
      "funFact": "The term \"tater tot\" was coined by the founders of Ore-Ida in 1953 after they wanted to use leftover potato pieces."
    },
    {
      "name": "Truffle Day",
      "description": "A day to celebrate luxurious truffles—those precious fungi that turn any dish gourmet. Foodies rejoice and indulge in truffle oils, chocolates, or the real deal!",
      "origin": "Truffle enthusiasts and gourmet chefs promote this day to appreciate the culinary delicacy.",
      "category": "Food Holiday",
      "emoji": "🍄",
      "funFact": "Truffles can fetch prices of thousands of dollars per pound, making them one of the most expensive foods in the world."
    },
    {
      "name": "World Tuna Day",
      "description": "An awareness day highlighting the importance of tuna fish in global food security, encouraging sustainable fishing practices to protect tuna populations.",
      "origin": "Designated by the United Nations to promote sustainable consumption and conservation of tuna species.",
      "category": "Awareness",
      "emoji": "🐟",
      "funFact": "Tuna can swim up to 75 mph, making them among the fastest swimmers of the fish world."
    },
    {
      "name": "Space Day (USA)",
      "description": "A celebration of space exploration and the marvels of the cosmos, inspiring curiosity about the universe beyond Earth.",
      "origin": "Launched by the Space Foundation in the United States as an educational event usually observed the first Friday in May, sometimes landing on May 2.",
      "category": "Pop Culture / Education",
      "emoji": "🚀",
      "funFact": "The day often features school activities, rocket launches, and astronomy events to spark interest in STEM."
    }
  ]
}