{
  "date": "May 3",
  "holidays": [
    {
      "name": "World Press Freedom Day",
      "description": "A day to celebrate and raise awareness about the importance of press freedom and the challenges journalists face worldwide.",
      "origin": "Proclaimed by the United Nations in 1993 to remind governments of the need to respect and uphold the right to freedom of expression.",
      "category": "Awareness Day",
      "emoji": "📰",
      "funFact": "Despite digital media's rise, around 70% of the world's population still experiences restrictions on press freedom!"
    },
    {
      "name": "Two Different Colored Shoes Day",
      "description": "Encourages people to wear two different colored shoes to celebrate uniqueness and embrace quirky fashion choices.",
      "origin": "Started on social media as a fun way to promote individuality and break fashion norms.",
      "category": "Fun/Pop Culture",
      "emoji": "👟👞",
      "funFact": "People who wear mismatched shoes often say it sparks conversations and makes their day more cheerful!"
    },
    {
      "name": "National Paranormal Day",
      "description": "Dedicated to celebrating all things supernatural, from ghost stories and UFOs to spirits and hauntings.",
      "origin": "Began online in the early 2000s as paranormal enthusiasts decided they needed a day to share their eerie experiences.",
      "category": "Pop Culture/Awareness",
      "emoji": "👻",
      "funFact": "May 3 is believed by some ghost hunters to be a prime night for paranormal activity!"
    },
    {
      "name": "Lumpy Rug Day",
      "description": "A whimsical holiday to remind people to enjoy the little annoyances of life—like a bumpy rug underfoot.",
      "origin": "Created by an anonymous internet user as a humorous celebration of life’s small quirks and imperfections.",
      "category": "Whimsical Fun",
      "emoji": "🧶",
      "funFact": "This day inspires some to rearrange or remove their lumpy rugs, turning an everyday annoyance into a playful activity!"
    }
  ]
}