{
  "date": "May 6",
  "holidays": [
    {
      "name": "National Beverage Day",
      "description": "A day to raise your glass and celebrate all kinds of drinks, from water and coffee to exotic juices and fancy cocktails.",
      "origin": "Unofficially created by social media users to honor the importance of refreshing beverages in our daily lives.",
      "category": "Food & Drink",
      "emoji": "🥤",
      "funFact": "Millions celebrate by trying out new beverages, and soda companies often launch limited edition flavors on this day!"
    },
    {
      "name": "No Diet Day",
      "description": "An annual reminder to embrace body positivity and take a break from dieting culture — eat what you love without guilt!",
      "origin": "Started in 1992 by British journalist Mary Evans Young to promote awareness against unrealistic beauty standards.",
      "category": "Awareness & Social",
      "emoji": "🍰",
      "funFact": "No Diet Day encourages self-acceptance, making it a favorite ‘cheat day’ for many, even if unofficially!"
    },
    {
      "name": "Space Day",
      "description": "A celebration of space exploration, astronomy, and everything cosmic to inspire curiosity about the universe.",
      "origin": "Created by educational organizations in the 1990s to promote STEM learning and interest in space science.",
      "category": "Science & Education",
      "emoji": "🚀",
      "funFact": "Many planetariums and space museums offer free admission or special events on Space Day to fuel starry-eyed dreams."
    },
    {
      "name": "Morse Code Day",
      "description": "Commemorates the invention of Morse code, the groundbreaking communication technology using dots and dashes.",
      "origin": "Marks the birthday of Samuel Morse, born on May 6, 1791, who developed this system revolutionizing long-distance communication.",
      "category": "History & Technology",
      "emoji": "📡",
      "funFact": "During World War II, Morse code operators could send messages faster than teletypes, helping win many battles."
    }
  ]
}