{
  "date": "May 8",
  "holidays": [
    {
      "name": "No Socks Day",
      "description": "A quirky day dedicated to celebrating the freedom of going sockless, encouraging people to ditch their socks and let their toes breathe.",
      "origin": "Believed to have started in the early 2000s as a fun, informal way to welcome warmer weather and embrace casual comfort.",
      "category": "Lifestyle",
      "emoji": "🧦❌",
      "funFact": "Some people use No Socks Day as an excuse to show off funky toe nail art or quirky footwear!"
    },
    {
      "name": "Have a Coke Day",
      "description": "A fizzy celebration paying homage to the iconic soft drink Coca-Cola, inviting fans to crack open a cold Coke and savor the classic taste.",
      "origin": "This unofficial holiday sprung from the global fanbase of Coca-Cola and its cultural significance since 1886.",
      "category": "Food & Drink",
      "emoji": "🥤",
      "funFact": "May 8th was reportedly the day in 1985 when Coca-Cola introduced the New Coke formula, making this soda day ironically fitting!"
    },
    {
      "name": "World Red Cross and Red Crescent Day",
      "description": "A solemn day honoring the humanitarian efforts of the International Red Cross and Red Crescent Movement worldwide.",
      "origin": "Established to commemorate the birthday of Henry Dunant, the founder of the Red Cross, born May 8, 1828.",
      "category": "Awareness / Humanitarian",
      "emoji": "❤️✚",
      "funFact": "The Red Cross emblem was inspired by the Swiss flag with its colors inverted, symbolizing neutrality and protection."
    },
    {
      "name": "No Fair Day",
      "description": "A tongue-in-cheek observance inviting people to protest unfairness, whether in games, life's little annoyances, or just to vent!",
      "origin": "An unofficial, humorous day that encourages expressing frustrations with unfair situations.",
      "category": "Humor / Social",
      "emoji": "🚫⚖️",
      "funFact": "No Fair Day is often used by parents and kids alike as a lighthearted excuse when things don't go their way."
    }
  ]
}