{
  "date": "May 9",
  "holidays": [
    {
      "name": "Lost Sock Memorial Day",
      "description": "A day to mourn and celebrate those single lonely socks lost forever in the laundry abyss.",
      "origin": "Originated unofficially among laundry enthusiasts and the internet community to humorously acknowledge the mystery of disappearing socks.",
      "category": "Quirky/Pop Culture",
      "emoji": "🧦",
      "funFact": "It's estimated that Americans lose about 1.3 billion socks per year – now you know where they all go!"
    },
    {
      "name": "National Butterscotch Brownie Day",
      "description": "Celebrate the gooey, sweet, buttery joy of butterscotch brownies! A decadent twist on the classic chocolate brownie.",
      "origin": "Created by dessert lovers eager to highlight the deliciousness of butterscotch desserts.",
      "category": "Food Holiday",
      "emoji": "🍫",
      "funFact": "Butterscotch actually originates from Scotland in the 19th century and was originally a candy, not a flavoring."
    },
    {
      "name": "Apple Pie Day (UK)",
      "description": "A day honoring the quintessential British favorite – the apple pie, beloved for its flaky crust and cinnamon-spiced apple filling.",
      "origin": "Traditional British food celebration, unofficially recognized on May 9 to mark the start of apple harvesting season.",
      "category": "Food Holiday",
      "emoji": "🥧",
      "funFact": "Apple pies date back to at least the 14th century, with early recipes including raisins, figs, and good spices!"
    },
    {
      "name": "Europe Day",
      "description": "Celebrates peace and unity in Europe, marking the anniversary of the Schuman Declaration, which proposed a new form of political cooperation in Europe in 1950.",
      "origin": "Official European Union observance promoting European integration and identity.",
      "category": "Awareness/Political",
      "emoji": "🇪🇺",
      "funFact": "The Schuman Declaration laid the groundwork for what eventually became the European Union — a unique economic and political partnership."
    }
  ]
}