{
  "date": "May 12",
  "holidays": [
    {
      "name": "National Limerick Day",
      "description": "A day to celebrate the witty and often humorous five-line limerick poem with its distinct rhythm and rhyme scheme.",
      "origin": "Observed on the birthday of Edward Lear, the 19th-century English artist and poet who popularized the limerick form.",
      "category": "Literary Celebration",
      "emoji": "📜",
      "funFact": "Edward Lear wrote hundreds of limericks, many nonsensical, which helped make the form a staple of children's poetry."
    },
    {
      "name": "National Nutty Fudge Day",
      "description": "A sweet day dedicated to enjoying fudge loaded with crunchy nuts for the perfect balance of smooth and crunch.",
      "origin": "An unofficial food holiday created to honor this popular candy treat and encourage indulgence.",
      "category": "Food Holiday",
      "emoji": "🍫",
      "funFact": "Fudge originated in the late 1800s, and adding nuts became a favorite variation that boosts both texture and flavor."
    },
    {
      "name": "Zebra Day",
      "description": "A quirky day to appreciate the striking patterns and mysterious nature of zebras, symbols of uniqueness and individuality.",
      "origin": "Created to raise awareness about the challenges zebras face in the wild and to celebrate their distinctive stripes.",
      "category": "Animal Awareness",
      "emoji": "🦓",
      "funFact": "Each zebra's stripe pattern is as unique as a human fingerprint — no two zebras have the same pattern!"
    },
    {
      "name": "Twiddle Day",
      "description": "A whimsical day encouraging people to fidget or ‘twiddle’ their thumbs as a way to relieve stress and spark creativity.",
      "origin": "An informal observance that plays on the common nervous habit and turns it into a lighthearted activity.",
      "category": "Fun & Games",
      "emoji": "👍",
      "funFact": "Twiddling your thumbs can actually help improve focus and motor skills when done mindfully."
    }
  ]
}