{
  "date": "May 13",
  "holidays": [
    {
      "name": "Apple Pie Day",
      "description": "A day to celebrate the classic, comforting dessert—apple pie! Whether topped with ice cream or enjoyed warm, it honors this all-American favorite.",
      "origin": "Apple Pie Day is an unofficial holiday created by pie lovers and food enthusiasts to honor the iconic dessert, which traces roots back to England and has become a symbol of American culture.",
      "category": "Food Holiday",
      "emoji": "🥧",
      "funFact": "Despite the saying 'as American as apple pie,' the dish actually dates back to medieval England and was introduced to America by early colonists."
    },
    {
      "name": "National Croutons Day",
      "description": "Celebrate the crunchy, flavorful salad topping that adds texture and zest to your greens! This day salutes everyone’s favorite toasted bread cubes.",
      "origin": "This quirky food holiday was started by salad dressing companies to boost the popularity of croutons and encourage people to jazz up their salads.",
      "category": "Food Holiday",
      "emoji": "🥗",
      "funFact": "The word 'crouton' comes from the French 'croûton,' meaning 'little crust,' and croutons were originally made to use up leftover bread."
    },
    {
      "name": "Leprechaun Day",
      "description": "A fun day to celebrate the mischievous little fairies of Irish folklore, known for their pots of gold and playful tricks.",
      "origin": "This unofficial day emerged from pop culture fascination with leprechauns and Irish mythology, often embraced in schools and communities to teach folklore.",
      "category": "Pop Culture / Folklore",
      "emoji": "🧙‍♂️",
      "funFact": "Leprechauns are considered shoemakers of the fairy world and are said to hide their treasure at the end of a rainbow!"
    },
    {
      "name": "Frog Jumping Day",
      "description": "Inspired by the classic Mark Twain story, this day encourages folks to host or watch frog-jumping contests and celebrate quirky rural traditions.",
      "origin": "Based on Mark Twain’s 'The Celebrated Jumping Frog of Calaveras County,' this local tradition grew into an annual event celebrated on or near May 13.",
      "category": "Literary / Local Tradition",
      "emoji": "🐸",
      "funFact": "The original frog-jumping contest started in Calaveras County, California, in 1928 and has become a beloved yearly festival."
    }
  ]
}