{
  "date": "May 14",
  "holidays": [
    {
      "name": "Dance Like a Chicken Day",
      "description": "A whimsical day encouraging everyone to break out their best chicken dance moves and embrace their inner poultry.",
      "origin": "Popularized in the 1980s as a parody of dance crazes, it gained unofficial recognition online as a fun way to bring laughter and silliness.",
      "category": "Fun/Pop Culture",
      "emoji": "🐔",
      "funFact": "The chicken dance was originally created in the 1950s by accordion player Werner Thomas as the 'Duck Dance,' but it’s always chickens that get the groove on May 14!"
    },
    {
      "name": "National Buttermilk Biscuit Day",
      "description": "A delicious day dedicated to celebrating fluffy, buttery buttermilk biscuits—a Southern comfort food staple.",
      "origin": "Rooted in American Southern cuisine, this day honors the biscuits that have been a breakfast favorite for generations.",
      "category": "Food",
      "emoji": "🍪",
      "funFact": "The original buttermilk biscuits were made using the liquid left behind from churning butter—talk about no waste baking!"
    },
    {
      "name": "International Thrift Shop Day",
      "description": "An eco-friendly observance encouraging people to shop sustainably, discover vintage treasures, and support second-hand stores.",
      "origin": "Created by sustainability advocates to promote recycling clothing and reducing consumer waste.",
      "category": "Awareness/Environment",
      "emoji": "🛍️",
      "funFact": "Shopping at thrift stores can reduce your carbon footprint by up to 60% compared to buying new clothes!"
    },
    {
      "name": "Lost Sock Memorial Day",
      "description": "A lighthearted day commemorating socks lost in the laundry abyss, honoring those single socks who've mysteriously disappeared.",
      "origin": "An informal, humorous observance created by sock manufacturers and laundry enthusiasts to bring attention to a universally frustrating phenomenon.",
      "category": "Funny/Pop Culture",
      "emoji": "🧦",
      "funFact": "Studies estimate the average person loses about 1.3 socks per week to the mysterious void of the laundry."
    }
  ]
}