{
  "date": "May 17",
  "holidays": [
    {
      "name": "World Telecommunication and Information Society Day",
      "description": "A day to raise awareness of the possibilities that the use of the Internet and other information and communication technologies (ICT) can bring to societies and economies.",
      "origin": "Established by the International Telecommunication Union (ITU) to celebrate the creation of the ITU and the signing of the first International Telegraph Convention in 1865.",
      "category": "Awareness Day",
      "emoji": "📡",
      "funFact": "The day often highlights the importance of closing the digital divide, ensuring everyone can access modern communication tools."
    },
    {
      "name": "National Walnut Day (USA)",
      "description": "Celebrate the crunchy, brain-shaped nut that’s packed with omega-3s and flavor! A perfect day to enjoy walnuts in everything from salads to desserts.",
      "origin": "Started as a fun food holiday in the US to promote the walnut industry and healthy eating habits.",
      "category": "Food Holiday",
      "emoji": "🌰",
      "funFact": "Walnuts have been found in 7,000-year-old archaeological sites. They’re one of the oldest tree foods known to humans!"
    },
    {
      "name": "International Day Against Homophobia, Transphobia and Biphobia",
      "description": "A day to raise awareness of the violence and discrimination experienced by LGBTQ+ people worldwide and to promote their rights.",
      "origin": "Established in 2004 to commemorate the World Health Organization’s decision to remove homosexuality from its list of mental disorders on May 17, 1990.",
      "category": "Awareness Day",
      "emoji": "🏳️‍🌈",
      "funFact": "Millions wear purple on this day as a symbol of support and solidarity with LGBTQ+ communities."
    },
    {
      "name": "Pack Rat Day",
      "description": "Celebrate your inner pack rat! This quirky holiday honors those who have a hard time throwing things away and love to collect odd and interesting stuff.",
      "origin": "Dusts off the excuse for keeping those weird souvenirs and junk that others might toss without a second thought.",
      "category": "Quirky Holiday",
      "emoji": "🐀",
      "funFact": "Pack rats (actual rodents) are famous for their collections, often hoarding shiny or colorful objects in their nests."
    }
  ]
}