{
  "date": "May 18",
  "holidays": [
    {
      "name": "International Museum Day",
      "description": "A day to raise awareness about museums and their role in cultural exchange, enrichment of cultures, and development of mutual understanding.",
      "origin": "Established by the International Council of Museums (ICOM) in 1977 to promote the importance of museums worldwide.",
      "category": "Awareness/Education",
      "emoji": "🖼️",
      "funFact": "Each year International Museum Day has a different theme, encouraging museums globally to create unique events and exhibits!"
    },
    {
      "name": "No Dirty Dishes Day",
      "description": "A fun, lighthearted day that encourages everyone to tackle that growing pile of dishes and celebrate the satisfaction of a clean kitchen.",
      "origin": "An informal observance created by cleaning enthusiasts and social media to motivate people to stay on top of household chores.",
      "category": "Household/Fun",
      "emoji": "🍽️",
      "funFact": "No Dirty Dishes Day is often celebrated by challenging friends and family to see who can clean their dishes the fastest!"
    },
    {
      "name": "National Bike to Work Day (USA)",
      "description": "A day urging commuters to pedal their way to work to promote fitness, reduce pollution, and enjoy a change of pace.",
      "origin": "Part of National Bike Month in the United States, started in 1956 by the League of American Bicyclists.",
      "category": "Health/Environment",
      "emoji": "🚴",
      "funFact": "Cities often organize group rides and offer free bike tune-ups on this day to encourage participation."
    },
    {
      "name": "Vesak (sometimes falls on May 18)",
      "description": "A major Buddhist festival celebrating the birth, enlightenment, and death of Buddha, marked with colorful processions and lanterns.",
      "origin": "An ancient tradition honoring Gautama Buddha, celebrated differently across Buddhist countries according to the lunar calendar.",
      "category": "Religious/Cultural",
      "emoji": "🕯️",
      "funFact": "Millions of Buddhists worldwide release lanterns into the sky on Vesak, creating luminous night spectacles."
    }
  ]
}