{
  "date": "May 20",
  "holidays": [
    {
      "name": "World Bee Day",
      "description": "A day to celebrate the role of bees and other pollinators in nature and agriculture, highlighting their importance to global ecosystems and food production.",
      "origin": "Declared by the United Nations in 2017, May 20 was chosen to honor the birthday of Anton Janša, a pioneer of modern beekeeping from Slovenia.",
      "category": "Awareness Day",
      "emoji": "🐝",
      "funFact": "Without bees, one-third of the food we eat would disappear since they pollinate about 70% of the world's major food crops!"
    },
    {
      "name": "Towel Day",
      "description": "Fans of Douglas Adams honor the author by carrying a towel with them all day, celebrating the beloved sci-fi series 'The Hitchhiker's Guide to the Galaxy'.",
      "origin": "Started in 2001, two weeks after Adams’ death, an homage to his famous advice that a towel is the most useful thing an interstellar hitchhiker can have.",
      "category": "Pop Culture Celebration",
      "emoji": "🛁",
      "funFact": "In the book, a towel is called 'about the most massively useful thing an interstellar hitchhiker can have', earning it legendary status among fans."
    },
    {
      "name": "National Endangered Species Day (USA)",
      "description": "A day to recognize and appreciate endangered species and support efforts to protect and conserve threatened wildlife.",
      "origin": "Established in 2006 by the U.S. Fish and Wildlife Service, observed annually on the third Friday of May, which often falls on or near May 20.",
      "category": "Awareness Day",
      "emoji": "🐘",
      "funFact": "Since 1973, the Endangered Species Act has saved more than 99% of the species under its care from extinction."
    },
    {
      "name": "Pick Strawberries Day",
      "description": "A fun seasonal food celebration encouraging people to enjoy fresh strawberries, whether by picking them, eating them, or making delicious treats.",
      "origin": "Unofficial food holiday rising from the love of spring fruit harvests in temperate climates.",
      "category": "Food Holiday",
      "emoji": "🍓",
      "funFact": "Strawberries aren’t berries botanically, but aggregate fruits formed from several smaller fruits on a single flower!"
    }
  ]
}