{
  "date": "May 21",
  "holidays": [
    {
      "name": "National Waitstaff Day",
      "description": "A day to appreciate the hardworking waiters and waitresses who serve us at restaurants, cafes, and diners. It’s about tipping well and saying thank you with a smile!",
      "origin": "Established in the United States to promote tipping etiquette and recognition for service industry workers.",
      "category": "Service Industry Appreciation",
      "emoji": "🍽️",
      "funFact": "Waitstaff often remember regular customers by their favorite orders or drinks, creating unofficial traditions in many eateries."
    },
    {
      "name": "World Snail Racing Championships",
      "description": "Exactly what it sounds like: a quirky competition where snails race against each other to claim victory in slow motion!",
      "origin": "Began in Congham, Norfolk, England, as a humorous local event starting in 1995.",
      "category": "Quirky Sporting Event",
      "emoji": "🐌",
      "funFact": "In the 1995 inaugural race, the winner was a snail called Archie who completed the course in just 2 minutes and 48 seconds—snail speed legends!."
    },
    {
      "name": "National Memo Day",
      "description": "A tribute to the humble memo – those concise messages that pass important (and sometimes hilarious) office updates!",
      "origin": "An American unofficial holiday celebrating office communication methods.",
      "category": "Office & Workplace",
      "emoji": "📝",
      "funFact": "The first memo in history was sent in the early 20th century as a way to streamline communication before email existed."
    },
    {
      "name": "Endangered Species Day",
      "description": "A day dedicated to raising awareness about endangered animals and the work needed to protect them.",
      "origin": "Officially recognized in the United States to encourage conservation efforts.",
      "category": "Environmental Awareness",
      "emoji": "🦏",
      "funFact": "Many species that were critically endangered on May 21 years ago have made remarkable recoveries, thanks to dedicated conservationists."
    }
  ]
}