{
  "date": "May 22",
  "holidays": [
    {
      "name": "World Goth Day",
      "description": "A celebration of goth culture, music, fashion, and the unique artistic expression embraced by goths worldwide.",
      "origin": "Started in 2009 by a UK-based radio presenter as a way to dispel myths and celebrate goth subculture.",
      "category": "Pop Culture",
      "emoji": "🦇",
      "funFact": "World Goth Day was inspired by an online event called 'Goth Day' created by radio show host Lee Meadows to showcase goth music and style."
    },
    {
      "name": "National Buy a Musical Instrument Day",
      "description": "A perfect day to encourage people to pick up an instrument, embrace music, and maybe start a new hobby or band!",
      "origin": "Created by music enthusiasts to promote learning instruments and the joy of making music.",
      "category": "Hobby/Food",
      "emoji": "🎸",
      "funFact": "Sales of musical instruments often spike on this day as people are inspired to play for the first time or rekindle old passions."
    },
    {
      "name": "World Turtle Day",
      "description": "A day dedicated to raising awareness about turtles and tortoises, their habitats, and the conservation efforts needed to protect them.",
      "origin": "Founded in 2000 by American Tortoise Rescue to help draw attention to these ancient reptiles.",
      "category": "Environmental Awareness",
      "emoji": "🐢",
      "funFact": "Turtles have been around for over 200 million years — they outlived the dinosaurs by a long shot!"
    },
    {
      "name": "National Maritime Day (India)",
      "description": "A tribute to India's maritime heritage, honoring the brave sailors and the naval history of the country.",
      "origin": "Commemorates the maiden voyage of the first Indian merchant ship, SS Loyalty, in 1919.",
      "category": "Historical/Cultural",
      "emoji": "🚢",
      "funFact": "India’s maritime history dates back thousands of years, with ancient trade routes connecting it to the rest of the world."
    }
  ]
}