{
  "date": "May 26",
  "holidays": [
    {
      "name": "International Sorry Day",
      "description": "A day dedicated to acknowledging and apologizing for the mistreatment of Indigenous peoples, particularly in Australia, fostering reconciliation and awareness.",
      "origin": "Started in Australia in 1998 to commemorate the anniversary of the 1997 Bringing Them Home report that investigated the forced removal of Aboriginal children.",
      "category": "Awareness",
      "emoji": "🤝",
      "funFact": "The day helps to keep alive the conversations about Indigenous rights and historical injustices, encouraging healing across communities."
    },
    {
      "name": "Paper Airplane Day",
      "description": "Celebrate your childhood and inner engineer by folding and flying the best paper airplanes you can craft! It’s a quirky tribute to creativity and simple fun.",
      "origin": "Unofficial observance; the exact origin is unclear, but paper airplanes have been a staple of playful ingenuity for decades.",
      "category": "Pop Culture",
      "emoji": "🛩️",
      "funFact": "The longest recorded flight of a paper airplane is 226 feet 10 inches, set by Joe Ayoob and John Collins in 2012!"
    },
    {
      "name": "Leprechaun Day",
      "description": "A whimsical day to honor the mischievous little leprechauns of Irish folklore—be on the lookout for their tricks and celebrate luck and mirth!",
      "origin": "Unofficial celebration inspired by Irish mythology and popular culture surrounding St. Patrick’s Day.",
      "category": "Folklore",
      "emoji": "🧙‍♂️",
      "funFact": "Leprechauns are said to be shoemakers by trade, and if you catch one, he must grant you three wishes — but good luck actually catching one!"
    },
    {
      "name": "Biscuit Day (UK)",
      "description": "A crunchy, buttery day dedicated to enjoying the humble biscuit (cookie) in all its sweet or savory glory — perfect with a cup of tea!",
      "origin": "Informal observance in the UK celebrating the nation’s favorite tea-time snack.",
      "category": "Food",
      "emoji": "🍪",
      "funFact": "Britain consumes about 700 million biscuits every week, making Biscuit Day a deliciously important excuse to indulge."
    }
  ]
}