{
  "date": "May 27",
  "holidays": [
    {
      "name": "Silly Putty Day",
      "description": "A day to celebrate the quirky, bouncy, and endlessly entertaining silicone compound known as Silly Putty! Stretch it, bounce it, or use it to lift comic strips off the newspaper.",
      "origin": "Commemorates the day in 1943 when Silly Putty was accidentally invented by James Wright, a GE scientist attempting to create a synthetic rubber substitute during World War II.",
      "category": "Pop Culture",
      "emoji": "🟣",
      "funFact": "Silly Putty once made headlines when astronauts carried it into space as a stress reliever and creative tool."
    },
    {
      "name": "Sunshine Week",
      "description": "Though it spans multiple days, May 27 often falls within Sunshine Week, dedicated to promoting transparency and open government across the U.S. It’s a celebration of the \"sunshine\" of public access to government information.",
      "origin": "Started in 2005 by the News Leaders Association to raise awareness about the importance of open government and freedom of information.",
      "category": "Awareness",
      "emoji": "☀️",
      "funFact": "The term 'Sunshine Week' refers to 'sunshine laws'—regulations requiring openness in government."
    },
    {
      "name": "Paper Airplane Day",
      "description": "Time to fold, glide, and soar with all kinds of paper airplanes! Celebrate this crafty toy that has fascinated kids and adults for generations.",
      "origin": "An unofficial holiday embraced by paper plane enthusiasts to honor this simple yet scientific paper craft and the joy it brings.",
      "category": "Fun and Games",
      "emoji": "🛩️",
      "funFact": "The longest recorded flight of a paper airplane is 69.14 meters (226 feet, 10 inches) set in 2012!"
    },
    {
      "name": "Chocolate Vyacheslav Day",
      "description": "An eccentric, unofficial celebration dedicated to the combination of chocolate and the mysterious name Vyacheslav, often celebrated by unusual fandom circles. It’s all about embracing odd, niche holidays!",
      "origin": "Originates from internet humor communities that create playful holidays combining names and favorite treats.",
      "category": "Quirky",
      "emoji": "🍫",
      "funFact": "Though mostly unknown, this day has inspired creative chocoholics to invent Vyacheslav-themed chocolate recipes."
    }
  ]
}