{
  "date": "May 31",
  "holidays": [
    {
      "name": "World No Tobacco Day",
      "description": "A day to raise awareness about the dangers of tobacco use and advocate for effective policies to reduce tobacco consumption worldwide.",
      "origin": "Established by the World Health Organization in 1987 to highlight the health risks associated with tobacco and encourage people to quit.",
      "category": "Awareness Day",
      "emoji": "🚭",
      "funFact": "World No Tobacco Day sparks global events such as the 'No Smoking' flash mobs and creative smoke-free art installations every year!"
    },
    {
      "name": "Put a Pillow on Your Fridge Day",
      "description": "A quirky holiday that encourages people to put a pillow on their fridge as a symbol of protection for their food and a reminder to chill out and relax.",
      "origin": "A humorous, unofficial holiday with unclear origins, celebrated mostly in North America as a fun way to 'cool off'.",
      "category": "Quirky Fun",
      "emoji": "🛏️🧊",
      "funFact": "Some people claim putting a pillow on the fridge 'absorbs the chill' – even though fridges and pillows don’t exactly mix scientifically!"
    },
    {
      "name": "Learn about Composting Day",
      "description": "This day promotes understanding of composting and its benefits, encouraging people to start composting to reduce waste and enrich soil naturally.",
      "origin": "Started by environmental groups to boost eco-friendly waste management practices in communities around the world.",
      "category": "Environmental Awareness",
      "emoji": "🍂♻️",
      "funFact": "Composting can reduce household waste by up to 30%, turning kitchen scraps into black gold for your garden!"
    },
    {
      "name": "Choose Day",
      "description": "A lighthearted day dedicated to making decisions—big or small—to take control of one's life and embrace the power of choice.",
      "origin": "Informal, motivational observance encouraging proactive living by focusing on the choices that shape our lives.",
      "category": "Pop Culture / Lifestyle",
      "emoji": "🤔✅",
      "funFact": "On Choose Day, some people make all their choices blindfolded for fun—to prove that sometimes trust beats overthinking!"
    }
  ]
}