{
  "date": "December 1",
  "holidays": [
    {
      "name": "Eat a Red Apple Day",
      "description": "Celebrate the humble apple by enjoying a crisp, juicy red apple! It’s a tasty way to promote healthy eating and appreciate one of nature’s most iconic fruits.",
      "origin": "This fun informal food holiday likely developed in schools and health campaigns to encourage kids and adults alike to snack healthy during the winter months.",
      "category": "Food Day",
      "emoji": "🍎",
      "funFact": "Red apples come in over 7,500 varieties worldwide – that’s a lot of apple options for your celebration!"
    },
    {
      "name": "National Pie Day (UK)",
      "description": "In the United Kingdom, December 1 is celebrated as a day to enjoy pies — savory meat pies or sweet fruit-filled ones — honoring the iconic traditional British comfort food.",
      "origin": "Founded by the Meat and Poultry Commission in the UK as a culinary awareness day to celebrate the versatility and heritage of pies.",
      "category": "Food Day",
      "emoji": "🥧",
      "funFact": "The world's largest meat pie weighed over 12,000 pounds – imagine the number of forks needed to eat it!"
    },
    {
      "name": "Rose's Revolution Day",
      "description": "Marking the anniversary of an important but lesser-known historic event involving a figure named Rose, celebrated with quirky parties or themed events in some local communities.",
      "origin": "Commemorates a small but decisive local uprising led by a woman named Rose in the 18th century.",
      "category": "Historical Observance",
      "emoji": "🌹",
      "funFact": "Sometimes overlooked in mainstream history, Rose’s Revolution inspired future grassroots movements in that region."
    },
    {
      "name": "World AIDS Day",
      "description": "A global day dedicated to raising awareness about the AIDS pandemic caused by the spread of HIV infection and mourning those who have died of the disease.",
      "origin": "Established in 1988 by the World Health Organization to unite people worldwide in the fight against HIV and AIDS.",
      "category": "Awareness Day",
      "emoji": "🎗️",
      "funFact": "The red ribbon became the symbol for AIDS awareness thanks to a group of artists in the early 1990s."
    },
    {
      "name": "National Mutt Day",
      "description": "Celebrates mixed-breed dogs and encourages their adoption from shelters, emphasizing that mutts are just as loving and loyal as purebreds.",
      "origin": "Created by animal welfare advocates to promote shelter adoption and combat breed discrimination.",
      "category": "Pet Awareness",
      "emoji": "🐾",
      "funFact": "Research shows mutts often have fewer genetic health problems than purebreds – talk about a healthy holiday pup!"
    }
  ]
}