{
  "date": "December 3",
  "holidays": [
    {
      "name": "International Day of Persons with Disabilities",
      "description": "A day to promote awareness, understanding, and support for the rights and well-being of persons with disabilities worldwide.",
      "origin": "Established by the United Nations in 1992 to foster inclusion and accessibility.",
      "category": "Awareness",
      "emoji": "♿",
      "funFact": "In 2019, the theme was 'The Future is Accessible,' highlighting technology's role in empowering people with disabilities."
    },
    {
      "name": "Make a Gift Day",
      "description": "An unofficial day dedicated to the joy of crafting and giving handmade gifts during the festive season.",
      "origin": "Originated from the desire to encourage creativity and personal touches in gift-giving rather than just buying.",
      "category": "Pop Culture/Crafts",
      "emoji": "🎁",
      "funFact": "Studies show that handmade gifts often have more sentimental value and can boost relationships!"
    },
    {
      "name": "National Roof Over Your Head Day",
      "description": "A quirky observance reminding people to be grateful for having shelter and to think about the homeless.",
      "origin": "An informal day used by some to encourage acts of kindness and awareness of homelessness during winter.",
      "category": "Awareness",
      "emoji": "🏠",
      "funFact": "Winter months tend to see a spike in homelessness-related charity drives coinciding with this day."
    },
    {
      "name": "National Day of the Ninja",
      "description": "A fun and offbeat day to celebrate the legendary stealthy warriors of Japan and embrace your inner ninja.",
      "origin": "Created in 2003 by the Ninja Coalition to honor ninja culture and history.",
      "category": "Pop Culture",
      "emoji": "🥷",
      "funFact": "On this day, some enthusiasts dress entirely in black and practice ninja-themed activities worldwide!"
    },
    {
      "name": "National Roof-Over-Your-Head Day",
      "description": "A strange but important observance to appreciate the simple but vital comfort of having a roof over your head.",
      "origin": "Started as a grassroots awareness day about homelessness safety during the winter.",
      "category": "Awareness",
      "emoji": "🏠",
      "funFact": "In some communities, it's used as a day to volunteer at shelters or donate warm clothing."
    }
  ]
}