{
  "date": "December 6",
  "holidays": [
    {
      "name": "St. Nicholas Day",
      "description": "A celebration honoring St. Nicholas, the patron saint of children and gift-giving, often marked by leaving shoes out to be filled with treats and small gifts.",
      "origin": "Rooted in the traditions of St. Nicholas of Myra, a 4th-century Greek bishop known for his generosity, this day has inspired many modern gift-giving customs, including Santa Claus.",
      "category": "Cultural/Religious",
      "emoji": "🎅",
      "funFact": "In some countries, children clean their shoes the night before, hoping St. Nicholas will leave candy or small toys inside!"
    },
    {
      "name": "National Pawnbrokers Day",
      "description": "A day to recognize the important role pawnbrokers play in communities by providing financial services and loans secured by personal property.",
      "origin": "Established by the National Pawnbrokers Association to celebrate their contributions and raise public awareness about the industry.",
      "category": "Industry/Business",
      "emoji": "💰",
      "funFact": "The pawnbroker symbol of three gold balls is said to originate from the Medici family crest in medieval Italy!"
    },
    {
      "name": "National Microwave Oven Day",
      "description": "A quirky day celebrating the invention and convenience of the microwave oven, which revolutionized cooking and reheating food.",
      "origin": "Commemorates the patent filing by Percy Spencer, who discovered microwave cooking in 1945, changing kitchen life forever.",
      "category": "Technology/Food",
      "emoji": "🍲",
      "funFact": "Percy Spencer realized microwave cooking when a candy bar in his pocket melted while standing near a magnetron!"
    },
    {
      "name": "Repeat Day",
      "description": "A playful observance inviting people to do things twice to enjoy, reflect, or get a second chance at fun, conversation, or indulgence.",
      "origin": "Unofficial and modern, this day encourages embracing repetition for amusement or better outcomes in everyday life.",
      "category": "Unusual/Fun",
      "emoji": "🔁",
      "funFact": "Some use Repeat Day as an excuse to have their second breakfast, twice as much coffee, or rewatch a favorite movie!"
    }
  ]
}