{
  "date": "December 7",
  "holidays": [
    {
      "name": "Pearl Harbor Remembrance Day",
      "description": "A solemn day commemorating the attack on Pearl Harbor in 1941, which thrust the U.S. into World War II. Though serious, it’s a crucial moment in history observed yearly.",
      "origin": "Established in 1994 by Congress to honor those who died in the attack.",
      "category": "Historical Remembrance",
      "emoji": "⚓",
      "funFact": "The attack on Pearl Harbor involved over 350 Japanese airplanes and lasted less than two hours."
    },
    {
      "name": "Letter Writing Day",
      "description": "Celebrate the lost art of handwriting by sending a letter to someone special. It's a quirky antidote to emails and texts!",
      "origin": "Likely emerged as a modern initiative to revive personal communication through snail mail.",
      "category": "Communication",
      "emoji": "✉️",
      "funFact": "A handwritten letter is often treasured more than an email because it shows extra effort and care."
    },
    {
      "name": "National Cotton Candy Day",
      "description": "Indulge your sweet tooth and enjoy the fluffy, sugary goodness of cotton candy—perfect for winter fairs and nostalgic treats.",
      "origin": "Origin unclear, but enjoyed as a fun foodie observance in the U.S.",
      "category": "Food Holiday",
      "emoji": "🍭",
      "funFact": "Cotton candy was invented by a dentist, William Morrison, in 1897. Sweet irony!"
    },
    {
      "name": "National Biscuits and Gravy Day",
      "description": "Embrace the hearty Southern comfort food of biscuits smothered in creamy sausage gravy. A perfect cure for chilly December mornings.",
      "origin": "An American culinary celebration, particularly beloved in the Southern U.S.",
      "category": "Food Holiday",
      "emoji": "🍽️",
      "funFact": "Biscuits and gravy rose to popularity during the Great Depression as an affordable, filling breakfast."
    },
    {
      "name": "Make a Gift Day",
      "description": "Get crafty and DIY a unique gift for someone special. It’s a charming way to show love during the holiday season with something handmade.",
      "origin": "A modern creative holiday encouraging personal touches during gift-giving season.",
      "category": "Crafts and Creativity",
      "emoji": "🎁",
      "funFact": "Handmade gifts often carry more sentimental value and are remembered longer than store-bought ones."
    }
  ]
}