{
  "date": "December 10",
  "holidays": [
    {
      "name": "National Lager Day",
      "description": "A day to raise a cold glass to lagers — those crisp, refreshing beers that keep holiday parties lively!",
      "origin": "Celebrated mostly in the U.S., this unofficial day is all about appreciating the versatility and smooth taste of lager beer varieties.",
      "category": "Food & Drink",
      "emoji": "🍺",
      "funFact": "Lager requires cold fermentation, which was only possible to do reliably after refrigeration was invented."
    },
    {
      "name": "Human Rights Day",
      "description": "Commemorates the adoption of the Universal Declaration of Human Rights by the United Nations General Assembly in 1948.",
      "origin": "Established by the UN to promote global human rights awareness and encourage action worldwide.",
      "category": "Awareness",
      "emoji": "🕊️",
      "funFact": "The Universal Declaration has inspired more than 60 human rights instruments that together constitute an international standard of human rights."
    },
    {
      "name": "Wear Brown Shoes Day",
      "description": "A humorous fashion reminder to retire your brown shoes for winter — since December is the last month to sport them before switching to boots!",
      "origin": "An unofficial fashion quip among style enthusiasts noting that brown shoes are considered a warm-season staple.",
      "category": "Fashion & Style",
      "emoji": "👞",
      "funFact": "Traditionally, brown shoes are less formal than black shoes and are often associated with spring and summer wardrobes."
    },
    {
      "name": "Nobel Prize Day",
      "description": "Honors the anniversary of Alfred Nobel's death and celebrates the announcement of Nobel Prize laureates for outstanding contributions in Physics, Chemistry, Medicine, Literature, Peace, and Economics.",
      "origin": "The prize ceremonies are held annually on December 10th in Stockholm and Oslo, established by Nobel's will in 1895.",
      "category": "Cultural & Science",
      "emoji": "🏆",
      "funFact": "The Nobel Peace Prize is actually awarded in Oslo, Norway, rather than Stockholm where the other prizes are presented."
    }
  ]
}