{
  "date": "December 11",
  "holidays": [
    {
      "name": "International Mountain Day",
      "description": "A day dedicated to raising awareness about the importance of mountains and promoting sustainable mountain development.",
      "origin": "Established by the United Nations in 2003 to highlight the environmental, cultural, and economic significance of mountain regions worldwide.",
      "category": "Environmental Awareness",
      "emoji": "🏔️",
      "funFact": "Mountains cover about 22% of the Earth's land surface and are home to over half of all terrestrial biodiversity species!"
    },
    {
      "name": "National App Day (USA)",
      "description": "Celebrate the app developers and the amazing applications on your phone or computer that make life easier and more fun!",
      "origin": "An unofficial modern holiday that recognizes the massive impact of mobile and computer apps on daily life.",
      "category": "Technology Pop Culture",
      "emoji": "📱",
      "funFact": "The first app store was launched in 2008 by Apple, revolutionizing how we download and use software."
    },
    {
      "name": "National Deluxe Holiday Meal Day (USA)",
      "description": "Celebrate by enjoying a luxuriously extravagant meal with all the trimmings and maybe a little something extra!",
      "origin": "An informal food holiday encouraging indulgence in festive feasts during the holiday season.",
      "category": "Food Celebration",
      "emoji": "🍽️",
      "funFact": "In preparation for the holidays, Americans consume about 46 million turkeys annually — talk about a deluxe meal!"
    },
    {
      "name": "Chupacabra Awareness Day",
      "description": "An unofficial day to dive into the legends and lore of the infamous Chupacabra, the mythical goat-sucking creature.",
      "origin": "Rooted in Latin American folklore, this day celebrates the mystery and entertainment surrounding this cryptid.",
      "category": "Cryptid / Folklore",
      "emoji": "🦇",
      "funFact": "The Chupacabra was first reported in Puerto Rico in the 1990s and quickly became a pop culture icon for strange phenomena."
    }
  ]
}