{
  "date": "December 13",
  "holidays": [
    {
      "name": "National Cocoa Day",
      "description": "Celebrate the warmth and chocolaty goodness of cocoa! Perfect for sipping a rich cup of hot chocolate and embracing cozy vibes.",
      "origin": "Believed to have originated in the U.S. as a way to honor the beloved winter drink made from cocoa beans.",
      "category": "Food Day",
      "emoji": "☕️",
      "funFact": "The Aztecs considered cocoa beans so valuable they used them as currency, and pure cacao was once a sacred beverage."
    },
    {
      "name": "Saint Lucy's Day (Santa Lucia)",
      "description": "A festival of lights celebrated in Scandinavia and Italy honoring Saint Lucy, symbolizing hope and light during the darkest time of year.",
      "origin": "Commemorates Saint Lucy, a Christian martyr who brought food and aid to persecuted Christians by wearing a candlelit wreath.",
      "category": "Cultural/Historical",
      "emoji": "🕯️",
      "funFact": "In Sweden, young girls dress as 'Lucia' with a crown of candles, serving saffron buns called 'Lussekatter' to family and friends."
    },
    {
      "name": "National Day of the Horse",
      "description": "A day to appreciate and celebrate horses, their importance in history, and bonds with humans.",
      "origin": "Created to raise awareness about horse welfare and promote the equestrian community.",
      "category": "Awareness/Animal",
      "emoji": "🐴",
      "funFact": "Horses have the largest eyes of any land mammal, allowing them to see nearly 360 degrees around!"
    },
    {
      "name": "International Day of Neutrality",
      "description": "A United Nations observance encouraging countries to remain neutral in conflicts and promote peace.",
      "origin": "Established by the UN in 2017 to strengthen the culture of peace and respect for sovereignty.",
      "category": "International Observance",
      "emoji": "🤝",
      "funFact": "Switzerland is famously neutral and has not participated in a foreign war since 1815."
    }
  ]
}