{
  "date": "December 14",
  "holidays": [
    {
      "name": "National Chocolate Candy Day",
      "description": "A delicious day dedicated to celebrating all forms of chocolate candy, from truffles to bars, this holiday is perfect for indulging your sweet tooth and sharing treats with friends and family.",
      "origin": "Observed mainly in the United States, this day was created by candy lovers and confectionery enthusiasts to honor chocolate and its many delightful variations.",
      "category": "Food",
      "emoji": "🍫",
      "funFact": "Did you know that the largest chocolate bar ever made weighed over 12,000 pounds? That's a lot of chocolate to share!"
    },
    {
      "name": "Monkey Day",
      "description": "A whimsical day to celebrate monkeys and primates, Monkey Day encourages people to learn about these intelligent animals, visit zoos, or just enjoy monkey-themed fun.",
      "origin": "Created in 2000 by Casey Sorrow and Eric Millikin, artists who wanted a day to honor monkeys and promote conservation efforts for primates.",
      "category": "Awareness/Nature",
      "emoji": "🐒",
      "funFact": "Monkey Day has inspired art shows, parties, and even monkey-themed marathons around the world!"
    },
    {
      "name": "National Dice Day",
      "description": "Roll the dice and test your luck on this gaming-inspired holiday that celebrates dice, the tiny cubes that have been used in games and decision-making for thousands of years.",
      "origin": "Unclear exact origin, but widely promoted by gaming communities and dice manufacturers as a fun reason to play and collect dice.",
      "category": "Games/Fun",
      "emoji": "🎲",
      "funFact": "The oldest dice ever discovered are about 5,000 years old and were found in an ancient Persian city!"
    },
    {
      "name": "Ursula K. Le Guin Day",
      "description": "A celebration of the pioneering and imaginative science fiction and fantasy author Ursula K. Le Guin, honoring her contributions to literature and social thought.",
      "origin": "An unofficial observance created by fans and literary communities to commemorate the life and work of Le Guin, who passed away on January 22, but December 14 was chosen in some circles to celebrate her legacy.",
      "category": "Literature",
      "emoji": "📚",
      "funFact": "Le Guin's speculative fiction explored themes of gender, race, and environmentalism long before they were mainstream topics."
    }
  ]
}