{
  "date": "December 15",
  "holidays": [
    {
      "name": "Cat Herders Day",
      "description": "A whimsical celebration dedicated to the impossible task of herding cats—whether literal felines or metaphorical chaos in life! It honors those brave souls who try to organize the unorganizable.",
      "origin": "Inspired by the famous humorous phrase 'herding cats' referring to managing something uncontrollable. The day was created as a fun nod to chaos management.",
      "category": "Humor/Pop Culture",
      "emoji": "🐱🐾",
      "funFact": "The phrase 'like herding cats' has been part of English slang since at least the 1940s, and this day celebrates that shared understanding of chaos."
    },
    {
      "name": "National Cupcake Day (UK)",
      "description": "A delightful day to indulge in sweet, frosted cupcake treats, celebrating one of the most beloved bite-sized desserts around!",
      "origin": "Began as a promotional day by bakeries and sweet brands in the UK to encourage cupcake consumption during the winter months.",
      "category": "Food",
      "emoji": "🧁",
      "funFact": "This holiday often supports charities with cupcake sales, turning indulgence into goodwill."
    },
    {
      "name": "International Tea Day",
      "description": "A day to appreciate the cultural, economic, and social importance of tea worldwide and enjoy a comforting cuppa!",
      "origin": "Declared by the UN in 2019 to raise awareness of the impact tea cultivation has on farmers and economies globally.",
      "category": "Awareness/Cultural",
      "emoji": "🍵",
      "funFact": "Tea is the most widely consumed beverage in the world after water, with over 3 billion cups consumed daily!"
    },
    {
      "name": "Bill of Rights Day (USA)",
      "description": "Commemorates the ratification of the first 10 amendments to the U.S. Constitution, reminding us of the rights and freedoms guaranteed to citizens.",
      "origin": "Marks the adoption of the Bill of Rights on December 15, 1791.",
      "category": "Historical/Political",
      "emoji": "📜🗽",
      "funFact": "The Bill of Rights was originally a compromise to appease Anti-Federalists who wanted more protections for individuals."
    }
  ]
}