{
  "date": "December 17",
  "holidays": [
    {
      "name": "Wright Brothers Day",
      "description": "Celebrating the pioneering achievements of Orville and Wilbur Wright, marking the anniversary of their first successful powered flight in 1903.",
      "origin": "Established in the U.S. in 1959 to honor the brothers' contribution to aviation on the date of the first flight.",
      "category": "Historical / Aviation",
      "emoji": "🛩️",
      "funFact": "Their first flight lasted only 12 seconds and covered just 120 feet, but it changed the world forever!"
    },
    {
      "name": "National Maple Syrup Day",
      "description": "A delicious day dedicated to appreciating the sweet, sticky syrup made from the sap of maple trees.",
      "origin": "An unofficial food holiday celebrated mainly in North America where maple syrup production is a proud tradition.",
      "category": "Food",
      "emoji": "🍁",
      "funFact": "It takes about 40 gallons of maple sap to make just 1 gallon of pure maple syrup — talk about sweetness concentration!"
    },
    {
      "name": "Ugly Sweater Day",
      "description": "A festive day to don the tackiest, most outrageous holiday sweaters you can find or create.",
      "origin": "Became popular with quirky Christmas parties in the early 2000s and now a widespread fun tradition around December.",
      "category": "Holiday / Pop Culture",
      "emoji": "🧶",
      "funFact": "The ugly holiday sweater trend started as a joke but now some sweaters can sell for hundreds of dollars as collector's items!"
    },
    {
      "name": "National Chocolate-Covered Anything Day",
      "description": "An excuse to dunk or coat literally anything edible in chocolate and enjoy the sweet, creamy goodness.",
      "origin": "An unofficial food holiday encouraging sweet creativity and indulgence, celebrated especially by chocoholics worldwide.",
      "category": "Food",
      "emoji": "🍫",
      "funFact": "Chocolate-covered bacon has been one of the strangest but surprisingly popular chocolate-covered treats embraced on this day!"
    }
  ]
}