{
  "date": "December 20",
  "holidays": [
    {
      "name": "National Sangria Day",
      "description": "A delightful day dedicated to celebrating the vibrant and refreshing Spanish punch known as sangria, made from wine, fruit, and often a splash of brandy or soda.",
      "origin": "While the exact origin is unclear, National Sangria Day gained popularity in the U.S. as part of trends embracing international wines and cocktails.",
      "category": "Food & Drink",
      "emoji": "🍷",
      "funFact": "Sangria gets its name from the Spanish word 'sangre' meaning blood, inspired by its deep red color."
    },
    {
      "name": "International Human Solidarity Day",
      "description": "A day to recognize the importance of solidarity in addressing global challenges, promoting unity and cooperation among peoples and nations.",
      "origin": "Established by the United Nations in 2005 to encourage efforts towards global harmony and poverty eradication.",
      "category": "Awareness",
      "emoji": "🤝",
      "funFact": "This day underscores the role of solidarity in achieving the UN's Sustainable Development Goals."
    },
    {
      "name": "Look for an Evergreen Day",
      "description": "Encourages people to seek out evergreen trees — symbols of life and endurance — especially in the winter months, reminding us that life persists even in the coldest seasons.",
      "origin": "An unofficial day created to connect people with nature and the beauty of evergreens during winter.",
      "category": "Nature & Environment",
      "emoji": "🌲",
      "funFact": "Evergreens remain green all year round by retaining their needles rather than shedding leaves like deciduous trees."
    },
    {
      "name": "Bazaar Day",
      "description": "A quirky day celebrating fun bazaars, marketplaces, and vibrant trading traditions that bring communities together in curious and joyful ways.",
      "origin": "Inspired by traditional markets that have been cultural hubs for centuries around the world.",
      "category": "Culture & Community",
      "emoji": "🛍️",
      "funFact": "In some cultures, bazaars serve not just as markets, but as social centers for music, storytelling, and festivities."
    }
  ]
}