{
  "date": "December 26",
  "holidays": [
    {
      "name": "Boxing Day",
      "description": "A day traditionally dedicated to giving to the less fortunate and to the exchange of boxed gifts to service workers and others.",
      "origin": "Originates in the UK where boxes of money or goods were given to those in service or the poor the day after Christmas.",
      "category": "Cultural/Traditional",
      "emoji": "📦",
      "funFact": "Boxing Day is a major shopping holiday in many countries, similar to Black Friday in the US!"
    },
    {
      "name": "National Candy Cane Day (USA)",
      "description": "A sweet celebration honoring the iconic red-and-white-striped peppermint candy cane that's a holiday staple.",
      "origin": "Established to recognize the Christmas candy that dates back to the 17th century, originally used to keep children quiet during church.",
      "category": "Food/Pop Culture",
      "emoji": "🍬",
      "funFact": "Candy canes were originally all white and their red stripes were added in the 20th century for festive appeal!"
    },
    {
      "name": "St. Stephen’s Day",
      "description": "A Christian feast day to honor St. Stephen, known as the first Christian martyr.",
      "origin": "Named after St. Stephen, the first Christian martyr said to have been stoned to death, this day is recognized mainly in Ireland, parts of Europe, and among some Christian denominations.",
      "category": "Religious/Traditional",
      "emoji": "⛪",
      "funFact": "In Ireland, St. Stephen’s Day is also called 'Wren Day' where people dress in colorful costumes and parade outdoors with a fake wren bird."
    },
    {
      "name": "National Thank You Note Day (USA)",
      "description": "An unofficial holiday encouraging people to send thank you notes for the holiday gifts and kindnesses received during Christmas.",
      "origin": "Began as a reminder to spread gratitude and practice good manners during the hectic post-Christmas season.",
      "category": "Social Courtesy",
      "emoji": "✉️",
      "funFact": "Despite the rise of digital messaging, writing thank you notes on paper is shown to make the sender feel happier too!"
    }
  ]
}