{
  "date": "December 27",
  "holidays": [
    {
      "name": "Fruitcake Toss Day",
      "description": "A day devoted to the humorous tradition of tossing or regifting those infamous dense, nut-and-candied-fruit-packed cakes that seem to multiply each holiday season.",
      "origin": "Rooted in the widespread love-hate relationship with fruitcake, this unofficial day celebrates the fruitcake's resilience and the sometimes comical way people dispose of or re-gift them.",
      "category": "Food Humor",
      "emoji": "🍰🎯",
      "funFact": "The world's largest fruitcake weighed over 1.7 tons and was made in the USA in 2011!"
    },
    {
      "name": "Make Cut-Out Snowflakes Day",
      "description": "Time to bust out the scissors and paper for an artsy winter craft—creating delicate, intricate paper snowflakes to brighten up any space.",
      "origin": "Paper snowflakes have been a winter-time craft tradition for centuries, and this day encourages creativity and childlike joy during the cold season.",
      "category": "Crafts & Creativity",
      "emoji": "❄️✂️",
      "funFact": "No two paper snowflakes are alike, just like the real ones found in nature!"
    },
    {
      "name": "National Fruitcake Day",
      "description": "An official day to honor the infamous holiday fruitcake, celebrating this dense dessert filled with nuts, dried fruits, and plenty of history.",
      "origin": "Observed in the United States, this day recognizes the fruitcake as a classic holiday treat with roots tracing back to Roman times.",
      "category": "Food Holiday",
      "emoji": "🍒🍰",
      "funFact": "Fruitcakes are known for their remarkable shelf life; some fruitcakes have been found still edible after decades."
    },
    {
      "name": "No Interruptions Day",
      "description": "Encourages people to get some peace and quiet by minimizing interruptions, perfect for catching up on work, reading, or just relaxing without distractions.",
      "origin": "Created to boost productivity and mental well-being by allowing focused and uninterrupted time.",
      "category": "Wellness & Productivity",
      "emoji": "🤫⏳",
      "funFact": "This day is especially beloved by introverts and office workers looking for a rare moment of silence."
    }
  ]
}