{
  "date": "December 28",
  "holidays": [
    {
      "name": "Fool's Day (Japan)",
      "description": "In Japan, December 28 is known as Fool's Day, a day when jokes and pranks are part of the fun, somewhat like April Fools' Day but in winter!",
      "origin": "Traditionally, this day is called \"Toshikoshi no Warai,\" meaning 'year-crossing laughter,' symbolizing laughter as a way to bring good luck into the new year.",
      "category": "Cultural/Tradition",
      "emoji": "🤡",
      "funFact": "People in Japan believe that laughter on this day can help ward off evil spirits and bring happiness for the coming year."
    },
    {
      "name": "Holy Innocents' Day",
      "description": "Also known as Childermas or The Feast of the Holy Innocents, this day commemorates the biblical massacre of male infants by King Herod in his attempt to kill baby Jesus.",
      "origin": "Rooted in Christian tradition, this day has been observed since the early centuries of Christianity, often with somber remembrances or, in some cultures, as a day for fun pranks.",
      "category": "Religious/Traditional",
      "emoji": "🕯️",
      "funFact": "In some Spanish-speaking countries, the day is somewhat like April Fools', when people play pranks called 'Inocentadas.'"
    },
    {
      "name": "National Card Playing Day (USA)",
      "description": "A day to dust off your deck and deal some hands! National Card Playing Day celebrates all types of card games, from poker to bridge to crazy eights.",
      "origin": "The origins are unofficial but it encourages spending time with friends and family over card games during the holiday season.",
      "category": "Recreational/Food & Fun",
      "emoji": "🃏",
      "funFact": "Playing cards date back to the 9th century in China, and today there are hundreds of card games enjoyed worldwide."
    },
    {
      "name": "Fruitcake Toss Day",
      "description": "A humorous day encouraging people to throw fruitcakes as far as they can, poking fun at the holiday fruitcake's status as the infamous 're-gifted' gift everyone seems to receive.",
      "origin": "Started in the 1990s as a lighthearted tradition in certain US towns to make fruitcake tossing a fun competition.",
      "category": "Novelty/Pop Culture",
      "emoji": "🍰",
      "funFact": "The world record fruitcake toss is over 75 feet — definitely a serious throw for a dense cake!"
    }
  ]
}