{
  "date": "December 29",
  "holidays": [
    {
      "name": "Tick Tock Day",
      "description": "A quirky reminder that the year is running out and those last-minute goals and resolutions should get going! It’s perfect for urging procrastinators to finally stop putting things off before the calendar flips.",
      "origin": "Observed unofficially to motivate people to take action on their year's pending goals, emerging as a popular internet meme and social media prompt.",
      "category": "Motivational/Procrastination Awareness",
      "emoji": "⏰",
      "funFact": "Tick Tock Day gained traction through viral posts urging people to 'get a move on' before the year ends, making it a favorite among last-minute planners."
    },
    {
      "name": "Card Playing Day",
      "description": "Dedicated to the timeless joy of playing cards—whether it's poker, bridge, solitaire, or any other card game. A great day to shuffle, deal, and enjoy some friendly competition!",
      "origin": "Unofficial observance to celebrate the social and entertainment value of card games, with roots in various traditional games worldwide.",
      "category": "Games & Recreation",
      "emoji": "🃏",
      "funFact": "Card games date back over 1,000 years, originating in China before spreading globally, and December 29 is the perfect chill day for indoor games."
    },
    {
      "name": "Chilean Sheep Shearing Festival",
      "description": "A traditional Chilean celebration marking the annual shearing of sheep, highlighting the cultural and economic importance of wool farming in rural communities.",
      "origin": "Local festival turned cultural event celebrated mainly in southern Chile during late December, showcasing sheep shearing competitions and folk music.",
      "category": "Cultural/Farming Festival",
      "emoji": "🐑",
      "funFact": "Some communities hold lively sheep-shearing contests on this day, drawing crowds and emphasizing sustainable wool practices."
    },
    {
      "name": "Bacon Day",
      "description": "An unofficial but beloved food holiday honoring everyone's favorite crispy, savory treat. Perfect for indulging in bacon-wrapped anything and celebrating this breakfast staple.",
      "origin": "Pop culture food holiday created by bacon enthusiasts and social media foodies to celebrate bacon's versatility and popularity.",
      "category": "Food Celebration",
      "emoji": "🥓",
      "funFact": "Bacon Day sparks a surge in creative recipes from bacon-wrapped desserts to bacon cocktails, fueling a meaty frenzy online."
    }
  ]
}