{
  "date": "March 2",
  "events": [
    {
      "year": 1836,
      "title": "Texas Declares Independence from Mexico",
      "description": "The Republic of Texas declared its independence from Mexico, marking the beginning of the Texas Revolution and eventually leading to Texas becoming an independent nation before joining the United States.",
      "category": "Political",
      "significance": "This declaration was a critical moment in the history of Texas and the expansion of the United States, leading to the Texas Revolution and later American territorial growth."
    },
    {
      "year": 1901,
      "title": "Queen Victoria's Funeral",
      "description": "Queen Victoria of the United Kingdom was buried after her death on January 22, 1901, marking the end of the Victorian era.",
      "category": "Cultural",
      "significance": "Queen Victoria's death and funeral marked the end of an era that deeply influenced British society, culture, and politics for over six decades."
    },
    {
      "year": 1917,
      "title": "The U.S. Senate Votes to Join World War I",
      "description": "The United States Senate voted in favor of declaring war on Germany, officially entering World War I.",
      "category": "Military",
      "significance": "This decision was a turning point that shifted the balance of power in the war and changed U.S. foreign policy from isolationism to active involvement in global conflicts."
    },
    {
      "year": 1939,
      "title": "Adolf Hitler Orders the German Invasion of Poland",
      "description": "Hitler authorized the planning for the invasion of Poland, which would start World War II later that year.",
      "category": "Military",
      "significance": "This planning set the stage for the outbreak of World War II, one of the deadliest conflicts in human history."
    },
    {
      "year": 1962,
      "title": "American Astronaut John Glenn Orbits the Earth",
      "description": "John Glenn became the first American to orbit the Earth aboard Friendship 7, marking a major milestone in the Space Race.",
      "category": "Science/Technology",
      "significance": "Glenn's successful orbit boosted U.S. morale during the Cold War and advanced human space exploration efforts."
    }
  ]
}