{
  "date": "March 3",
  "events": [
    {
      "year": 1845,
      "title": "Florida becomes the 27th U.S. State",
      "description": "Florida was admitted to the United States as the 27th state, expanding the country and impacting the balance between free and slave states.",
      "category": "Political",
      "significance": "This statehood impacted U.S. politics and sectional tensions leading up to the Civil War."
    },
    {
      "year": 1875,
      "title": "The First Volume of the 'Je Sais Tout' Magazine Published",
      "description": "The French popular science magazine 'Je Sais Tout' was first published, contributing to the spread of scientific knowledge among the general public.",
      "category": "Cultural",
      "significance": "Helped popularize science and knowledge in France during the 19th century."
    },
    {
      "year": 1931,
      "title": "The Star-Spangled Banner Officially Becomes U.S. National Anthem",
      "description": "The United States Congress passed a law that made 'The Star-Spangled Banner' the official national anthem of the United States.",
      "category": "Political/Cultural",
      "significance": "Established a key national symbol and patriotic song for the United States."
    },
    {
      "year": 1991,
      "title": "Boris Yeltsin Becomes President of Russia",
      "description": "Boris Yeltsin was sworn in as the first elected President of the Russian Federation, marking the start of a new era in post-Soviet Russia.",
      "category": "Political",
      "significance": "Signaled a shift from Soviet communism to a new political and economic system in Russia."
    },
    {
      "year": 2002,
      "title": "Bulgaria, Estonia, Latvia, Lithuania, Romania, Slovakia, and Slovenia join NATO",
      "description": "These countries signed accession protocols to join the North Atlantic Treaty Organization (NATO), expanding the alliance eastward.",
      "category": "Political",
      "significance": "Strengthened NATO’s presence in Eastern Europe and reshaped European security dynamics."
    }
  ]
}