{
  "date": "March 13",
  "events": [
    {
      "year": 1781,
      "title": "Discovery of Uranus",
      "description": "William Herschel discovered Uranus, the seventh planet from the Sun, expanding the known boundaries of our solar system for the first time in modern history.",
      "category": "Scientific Discovery",
      "significance": "This discovery was pivotal in astronomy, broadening the understanding of the solar system and triggering further planetary research."
    },
    {
      "year": 1881,
      "title": "Assassination of Tsar Alexander II of Russia",
      "description": "Tsar Alexander II was fatally wounded in an attack by members of the revolutionary group 'People's Will' in St. Petersburg, leading to his death a few hours later.",
      "category": "Political Event",
      "significance": "His assassination led to a period of political repression and influenced the course of the Russian revolutionary movements."
    },
    {
      "year": 1930,
      "title": "Cities of Constantinople and Angora officially renamed Istanbul and Ankara",
      "description": "The Turkish government officially changed the names of Constantinople and Angora to Istanbul and Ankara as part of efforts to modernize and nationalize the country.",
      "category": "Cultural/Political Milestone",
      "significance": "This reflected the shift towards Turkish national identity following the establishment of the Republic of Turkey."
    },
    {
      "year": 1996,
      "title": "Titanic Wreck Site Found",
      "description": "An expedition led by Robert Ballard discovered the wreck of the RMS Titanic on the bottom of the North Atlantic Ocean.",
      "category": "Exploration",
      "significance": "The discovery brought closure to one of the most famous maritime disasters and spurred interest in deep-sea exploration and preservation efforts."
    },
    {
      "year": 2013,
      "title": "Pope Francis becomes the 266th Pope",
      "description": "Jorge Mario Bergoglio was elected Pope Francis, becoming the first pope from the Americas and the first Jesuit pope in history.",
      "category": "Religious Event",
      "significance": "His papacy marked a notable shift in the Catholic Church with an emphasis on humility, social justice, and outreach to marginalized communities."
    }
  ]
}