{
  "date": "March 18",
  "events": [
    {
      "year": 1766,
      "title": "Repeal of the Stamp Act",
      "description": "The British Parliament repealed the Stamp Act, a tax enacted on the American colonies that had sparked widespread protest and unrest.",
      "category": "Political",
      "significance": "This repeal marked a temporary easing of tensions between Britain and the American colonies, but the conflict eventually led to the American Revolution."
    },
    {
      "year": 1834,
      "title": "The Zollverein Established",
      "description": "The German Customs Union (Zollverein) was established under Prussian leadership, promoting economic unity among German states by abolishing internal tariffs.",
      "category": "Economic",
      "significance": "It laid the groundwork for the eventual political unification of Germany by fostering economic cooperation."
    },
    {
      "year": 1922,
      "title": "Fascists March on Rome",
      "description": "Benito Mussolini's National Fascist Party organized the 'March on Rome,' a coup which led King Victor Emmanuel III to appoint Mussolini as Prime Minister of Italy.",
      "category": "Political",
      "significance": "This event marked the beginning of fascist rule in Italy and significantly influenced European politics leading up to World War II."
    },
    {
      "year": 1965,
      "title": "Soviet Cosmonaut Aleksei Leonov Performs First Spacewalk",
      "description": "Aleksei Leonov became the first human to conduct a spacewalk (extravehicular activity) during the Voskhod 2 mission.",
      "category": "Science and Technology",
      "significance": "This milestone advanced human capabilities in space exploration and technology."
    },
    {
      "year": 1990,
      "title": "Lithuania Declares Independence from the Soviet Union",
      "description": "Lithuania became the first Soviet republic to declare independence, challenging Soviet authority and inspiring other republics to do the same.",
      "category": "Political",
      "significance": "This was a key event in the dissolution of the Soviet Union and the re-emergence of independent Baltic states."
    }
  ]
}