{
  "date": "March 27",
  "events": [
    {
      "year": 1939,
      "title": "Completion of the Spanish Civil War",
      "description": "Madrid falls to the forces of Francisco Franco, effectively ending the Spanish Civil War with a Nationalist victory.",
      "category": "War/Conflict",
      "significance": "Marked the establishment of Franco’s dictatorship in Spain, which lasted until his death in 1975."
    },
    {
      "year": 1977,
      "title": "Tenerife Airport Disaster",
      "description": "Two Boeing 747 jumbo jets collide on the runway at Los Rodeos Airport (now Tenerife North Airport), resulting in 583 fatalities.",
      "category": "Disaster/Aviation",
      "significance": "Remains the deadliest accident in aviation history, leading to significant improvements in aircraft communication and safety procedures."
    },
    {
      "year": 1933,
      "title": "Citizenship Stripped from Jews in Nazi Germany",
      "description": "The Nazi regime issues the Law for the Restoration of the Professional Civil Service, which excludes Jews and political opponents from civil service positions.",
      "category": "Law/Human Rights",
      "significance": "Early step in the systemic disenfranchisement and persecution that led to the Holocaust."
    },
    {
      "year": 1924,
      "title": "First Surrealist Manifesto Released",
      "description": "André Breton publishes the first Surrealist Manifesto, defining the Surrealist movement in art and literature.",
      "category": "Culture/Art",
      "significance": "Marked the beginning of Surrealism, which had a profound influence on modern art and literature."
    },
    {
      "year": 1905,
      "title": "Cyprus Convention Signed",
      "description": "Britain and the Ottoman Empire sign an agreement granting Britain administrative control over Cyprus while the island remains officially Ottoman territory.",
      "category": "Politics/International Relations",
      "significance": "Strengthened British influence in the Mediterranean, impacting regional politics for decades."
    }
  ]
}