{
  "date": "March 28",
  "events": [
    {
      "year": 1939,
      "title": "Battle of the Ebro begins",
      "description": "The Battle of the Ebro, one of the longest and largest battles of the Spanish Civil War, commenced as Republican forces launched an offensive against Franco's Nationalist troops.",
      "category": "Military",
      "significance": "It marked a crucial turning point in the Spanish Civil War, exhausting Republican resources and leading to Nationalist victory."
    },
    {
      "year": 1939,
      "title": "Spanish Civil War ends",
      "description": "Although the Battle of the Ebro began in late July 1938, on March 28, 1939, Madrid fell to the Nationalist forces, essentially ending the Spanish Civil War.",
      "category": "War",
      "significance": "The victory solidified Francisco Franco's dictatorship in Spain for several decades."
    },
    {
      "year": 1939,
      "title": "SS St. Louis incident begins",
      "description": "The ocean liner SS St. Louis, carrying Jewish refugees fleeing Nazi Germany, was denied entry to Cuba and later the United States, forcing passengers to return to Europe.",
      "category": "Human Rights",
      "significance": "This event highlighted the global refusal to accept Jewish refugees, with tragic consequences for many."
    },
    {
      "year": 1939,
      "title": "The last known Tasmanian tiger dies",
      "description": "The last known thylacine, commonly known as the Tasmanian tiger, died in captivity at the Hobart Zoo in Tasmania, Australia.",
      "category": "Environmental",
      "significance": "This marked the extinction of a unique marsupial species, symbolizing human impact on biodiversity."
    },
    {
      "year": 1939,
      "title": "The German occupation of Czechoslovakia",
      "description": "Germany formally annexed the remaining Czech lands, establishing the Protectorate of Bohemia and Moravia following the Munich Agreement.",
      "category": "Political",
      "significance": "This act demonstrated Nazi Germany's aggressive expansionist policy leading up to World War II."
    }
  ]
}