{
  "date": "March 30",
  "events": [
    {
      "year": 1856,
      "title": "End of the Crimean War",
      "description": "The Treaty of Paris was signed, ending the Crimean War. The treaty neutralized the Black Sea and resolved territorial disputes between Russia and the Ottoman Empire.",
      "category": "War and diplomacy",
      "significance": "This treaty shifted the balance of power in Europe and marked a significant moment in 19th century diplomacy."
    },
    {
      "year": 1981,
      "title": "Assassination attempt on Ronald Reagan",
      "description": "President Ronald Reagan survived an assassination attempt by John Hinckley Jr. outside a Washington D.C. hotel. Reagan was shot but recovered quickly.",
      "category": "Political history",
      "significance": "The event highlighted issues of presidential security and mental health awareness in the US."
    },
    {
      "year": 1972,
      "title": "Launch of Pioneer 10 spacecraft",
      "description": "NASA launched Pioneer 10, the first spacecraft to travel through the asteroid belt and make a direct passage through the outer solar system.",
      "category": "Science and exploration",
      "significance": "Pioneer 10 provided humanity’s first close-up images of Jupiter and opened the era of deep space exploration."
    },
    {
      "year": 1939,
      "title": "Spanish Civil War ends",
      "description": "Madrid fell to Francisco Franco's troops, marking the conclusion of the Spanish Civil War.",
      "category": "War",
      "significance": "This event led to the establishment of Franco's dictatorship in Spain, impacting European politics for decades."
    },
    {
      "year": 1991,
      "title": "Croatia declares independence",
      "description": "Croatia formally declared independence from Yugoslavia, escalating conflicts that led to the Croatian War of Independence.",
      "category": "Political history",
      "significance": "This declaration was a key moment in the breakup of Yugoslavia and the reshaping of Eastern Europe."
    }
  ]
}