{
  "date": "March 31",
  "events": [
    {
      "year": 1889,
      "title": "Opening of the Eiffel Tower",
      "description": "The Eiffel Tower was officially opened to the public during the 1889 Exposition Universelle (World's Fair) in Paris, France, showcasing innovative iron architecture.",
      "category": "Architecture/Engineering",
      "significance": "Became a global cultural icon of France and an architectural landmark, symbolizing modernity and engineering achievement."
    },
    {
      "year": 1966,
      "title": "Soviet Luna 10 Moon Orbiter",
      "description": "The Soviet spacecraft Luna 10 became the first space probe to enter orbit around the Moon, marking a significant advancement in lunar exploration.",
      "category": "Space Exploration",
      "significance": "Pioneered human exploration of the Moon and contributed valuable scientific data about the lunar environment."
    },
    {
      "year": 1991,
      "title": "End of Persian Gulf War",
      "description": "The Persian Gulf War officially ended as coalition forces declared victory over Iraq following Operation Desert Storm.",
      "category": "Military/War",
      "significance": "Marked the conclusion of a major conflict in the Middle East and demonstrated the effectiveness of modern coalition military operations."
    },
    {
      "year": 1949,
      "title": "Schenectady Sit-down Strike Begins",
      "description": "Workers at the General Electric plant in Schenectady, New York, began a sit-down strike for better working conditions and union recognition.",
      "category": "Labor Movement",
      "significance": "Contributed to the strengthening of labor unions and improved workers’ rights in the US industrial sector."
    },
    {
      "year": 1970,
      "title": "Launch of Apollo 13 Space Mission",
      "description": "NASA launched the Apollo 13 mission intended for lunar landing, which later became famous for its 'successful failure' after an in-flight accident jeopardized the crew.",
      "category": "Space Exploration",
      "significance": "Demonstrated human ingenuity and problem-solving under pressure, contributing important lessons to space mission safety."
    }
  ]
}