{
  "date": "November 2",
  "plants": [
    {
      "name": "Chrysanthemum indicum",
      "commonName": "Chrysanthemum",
      "description": "Chrysanthemums are popular autumn-blooming flowers that brighten gardens with their vibrant colors. They are widely cultivated and signify longevity and rejuvenation in many cultures.",
      "bloomingSeason": "September to November",
      "location": "Temperate regions worldwide, especially East Asia and North America",
      "colors": [
        "yellow",
        "white",
        "red",
        "purple",
        "orange"
      ],
      "emoji": "🌼",
      "funFact": "Chrysanthemums were first cultivated in China as a flowering herb as early as the 15th century BC."
    },
    {
      "name": "Dianella tasmanica",
      "commonName": "Tasman Flax-lily",
      "description": "A native Australian perennial with starry blue-purple flowers that bloom in late spring through early summer into November in milder climates. It produces attractive berries following the bloom.",
      "bloomingSeason": "September to November",
      "location": "Eastern Australia",
      "colors": [
        "blue",
        "purple"
      ],
      "emoji": "🌸",
      "funFact": "The blue berries of the Dianella tasmanica are edible but bland, historically used by Indigenous Australians."
    },
    {
      "name": "Magnolia grandiflora",
      "commonName": "Southern Magnolia",
      "description": "An iconic evergreen tree with large, fragrant white flowers that bloom sporadically from late spring to early fall, sometimes blooming as late as November in warmer southern states of the USA.",
      "bloomingSeason": "May to November",
      "location": "Southeastern United States",
      "colors": [
        "white"
      ],
      "emoji": "🌺",
      "funFact": "The southern magnolia's flowers can be up to 12 inches in diameter and are a favorite food source for beetles."
    },
    {
      "name": "Camellia japonica",
      "commonName": "Japanese Camellia",
      "description": "A widely cultivated ornamental shrub producing rose-like flowers in late autumn and early winter, especially in mild climates. Blooms vary from white to pink and red.",
      "bloomingSeason": "October to March",
      "location": "East Asia, cultivated globally in temperate zones",
      "colors": [
        "red",
        "pink",
        "white"
      ],
      "emoji": "🌺",
      "funFact": "Camellia japonica flowers inspired the design of the famous Camellia handbag by Chanel."
    }
  ]
}