{
  "date": "November 3",
  "plants": [
    {
      "name": "Chrysanthemum indicum",
      "commonName": "Chrysanthemum",
      "description": "Chrysanthemums are popular garden flowering plants known for their vibrant blooms and varieties in shape and color. They often mark the transition into cooler autumn months and are widely cultivated worldwide.",
      "bloomingSeason": "September to November",
      "location": "Temperate regions worldwide",
      "colors": [
        "yellow",
        "red",
        "white",
        "purple"
      ],
      "emoji": "🌼",
      "funFact": "Chrysanthemums are symbols of longevity and rejuvenation in many cultures, especially in East Asia."
    },
    {
      "name": "Camellia japonica",
      "commonName": "Camellia",
      "description": "Camellias are evergreen shrubs blooming in late autumn to early winter with large, showy flowers. They are widely grown in temperate climates and are prized for their beauty and winter blooming.",
      "bloomingSeason": "October to March",
      "location": "East Asia, cultivated in temperate zones worldwide",
      "colors": [
        "red",
        "pink",
        "white"
      ],
      "emoji": "🌺",
      "funFact": "Camellia japonica was the original source of the tea plant (Camellia sinensis) cultivated for tea leaves."
    },
    {
      "name": "Grevillea robusta",
      "commonName": "Silky Oak",
      "description": "An Australian native tree, Grevillea robusta produces striking orange flowers in spring and autumn. It is commonly used as an ornamental tree in suitable climates worldwide.",
      "bloomingSeason": "March to November (varies by location)",
      "location": "Australia and subtropical/tropical regions",
      "colors": [
        "orange"
      ],
      "emoji": "🌸",
      "funFact": "The silky oak's timber is valued for furniture and cabinet making; its flowers attract birds with nectar."
    },
    {
      "name": "Nerium oleander",
      "commonName": "Oleander",
      "description": "Oleander is a hardy shrub with fragrant trumpet-shaped flowers that bloom in warm climates over a long period including autumn. It tolerates drought and poor soils, making it popular in Mediterranean landscapes.",
      "bloomingSeason": "May to November",
      "location": "Mediterranean region, subtropical and tropical climates",
      "colors": [
        "pink",
        "white",
        "red"
      ],
      "emoji": "🌺",
      "funFact": "Despite its beauty, all parts of oleander are poisonous if ingested."
    }
  ]
}