{
  "date": "November 5",
  "plants": [
    {
      "name": "Chrysanthemum indicum",
      "commonName": "Chrysanthemum",
      "description": "Chrysanthemums are popular garden flowers well-known for their bright, daisy-like blooms that come in a variety of colors including yellow, red, white, and purple. They are often associated with autumn and are widely cultivated in temperate regions.",
      "bloomingSeason": "September to November",
      "location": "Northern Hemisphere temperate regions, including North America, Europe, and East Asia",
      "colors": [
        "yellow",
        "red",
        "white",
        "purple"
      ],
      "emoji": "🌼",
      "funFact": "Chrysanthemums are considered the flower of autumn in many cultures and symbolize longevity and rejuvenation in Japan."
    },
    {
      "name": "Camellia japonica",
      "commonName": "Camellia",
      "description": "Camellias are evergreen shrubs known for their glossy leaves and large, elegant flowers that bloom in late autumn to winter. Their flowers can be single or double and come in shades of white, pink, and red.",
      "bloomingSeason": "October to January",
      "location": "East Asia (native), widely cultivated in southern US, Europe, and Australasia",
      "colors": [
        "white",
        "pink",
        "red"
      ],
      "emoji": "🌺",
      "funFact": "Camellias are the source of the tea plant (Camellia sinensis), but Camellia japonica itself is prized for ornamental purposes rather than tea production."
    },
    {
      "name": "Wattle (Acacia pycnantha)",
      "commonName": "Golden Wattle",
      "description": "The golden wattle is an Australian native tree or shrub that produces bright yellow, fragrant, fluffy flowers arranged in spherical clusters. It blooms in late winter and spring, often starting to bloom in early November in parts of Australia.",
      "bloomingSeason": "September to November",
      "location": "Australia, especially southeastern regions",
      "colors": [
        "yellow"
      ],
      "emoji": "🌻",
      "funFact": "The golden wattle is Australia's national floral emblem and symbolizes unity and resilience."
    },
    {
      "name": "Magnolia champaca",
      "commonName": "Champak",
      "description": "Champak is a tropical tree known for its highly fragrant yellow to orange flowers. It blooms year-round in suitable climates, with strong flowering peaks often occurring around late autumn and early winter in tropical Asia.",
      "bloomingSeason": "Year-round, peak flowering in autumn to winter",
      "location": "South Asia and Southeast Asia tropical regions",
      "colors": [
        "yellow",
        "orange"
      ],
      "emoji": "🌸",
      "funFact": "Champak flowers are used in perfumery and religious offerings due to their intense, sweet fragrance."
    }
  ]
}