{
  "date": "November 6",
  "plants": [
    {
      "name": "Chrysanthemum indicum",
      "commonName": "Chrysanthemum",
      "description": "A widely cultivated ornamental plant known for its vibrant and diverse flower colors, chrysanthemums often bloom in autumn, making them popular in gardens and floral arrangements during late fall.",
      "bloomingSeason": "September to November",
      "location": "Temperate regions, widely cultivated globally",
      "colors": [
        "yellow",
        "white",
        "red",
        "purple"
      ],
      "emoji": "🌼",
      "funFact": "Chrysanthemums are native to East Asia and have been cultivated in China for over 2,500 years."
    },
    {
      "name": "Camellia japonica",
      "commonName": "Camellia",
      "description": "An evergreen shrub admired for its large, showy flowers which bloom in late fall to early spring, camellias are prevalent in temperate climates and are valued in gardens and parks.",
      "bloomingSeason": "October to March",
      "location": "East Asia, cultivated in temperate zones of North America and Europe",
      "colors": [
        "white",
        "pink",
        "red"
      ],
      "emoji": "🌺",
      "funFact": "Camellia flowers were a favorite of Queen Victoria and were symbolic of refinement in Victorian England."
    },
    {
      "name": "Bougainvillea glabra",
      "commonName": "Bougainvillea",
      "description": "A vibrant climbing plant known for its brilliantly colored bracts surrounding small white flowers, bougainvillea blooms year-round in tropical and subtropical climates, including November.",
      "bloomingSeason": "Year-round in tropical climates, including November",
      "location": "Tropical and subtropical regions worldwide",
      "colors": [
        "magenta",
        "purple",
        "red",
        "orange",
        "white"
      ],
      "emoji": "🌸",
      "funFact": "Bougainvillea's colorful parts are actually modified leaves called bracts, not petals."
    },
    {
      "name": "Kalanchoe blossfeldiana",
      "commonName": "Flaming Katy",
      "description": "A succulent houseplant that produces clusters of small, long-lasting blooms, Kalanchoe is often seen blooming indoors in cooler months such as November, thriving in bright light environments.",
      "bloomingSeason": "Mostly in late fall and winter",
      "location": "Native to Madagascar, widely grown indoors globally",
      "colors": [
        "red",
        "pink",
        "yellow",
        "orange",
        "white"
      ],
      "emoji": "🌵",
      "funFact": "Kalanchoe can propagate vegetatively from leaf or stem cuttings, making it easy to propagate at home."
    }
  ]
}