{
  "date": "November 7",
  "plants": [
    {
      "name": "Chrysanthemum indicum",
      "commonName": "Chrysanthemum",
      "description": "A popular autumn-blooming garden plant with dense flower heads composed of many small flowers. Chrysanthemums are often associated with fall festivals and are highly diverse in color and form.",
      "bloomingSeason": "September to November",
      "location": "Temperate regions worldwide, especially East Asia, Europe, and North America",
      "colors": [
        "yellow",
        "white",
        "red",
        "purple"
      ],
      "emoji": "🌼",
      "funFact": "Chrysanthemums represent longevity and rejuvenation in many Asian cultures and are often used in tea."
    },
    {
      "name": "Camellia japonica",
      "commonName": "Camellia",
      "description": "An evergreen shrub famous for its large, rose-like flowers that bloom in late fall to early spring, depending on the cultivar. Camellias thrive in mild temperate climates with acidic well-drained soil.",
      "bloomingSeason": "October to March",
      "location": "East Asia, Southern US, and temperate gardens worldwide",
      "colors": [
        "red",
        "pink",
        "white"
      ],
      "emoji": "🌺",
      "funFact": "Camellia flowers were introduced to Europe in the 18th century and led to the popular 'tea plant' family, as Camellia sinensis is the source of tea leaves."
    },
    {
      "name": "Grevillea robusta",
      "commonName": "Silky Oak",
      "description": "An Australian native tree with striking orange to golden flowers arranged in bottlebrush-like clusters that bloom in late spring through early summer in Australia but can bloom in the Northern Hemisphere's autumn when grown there.",
      "bloomingSeason": "September to November (Southern Hemisphere)",
      "location": "Australia and cultivated in subtropical and Mediterranean climates globally",
      "colors": [
        "orange",
        "golden yellow"
      ],
      "emoji": "🌿",
      "funFact": "Despite its common name, Silky Oak is not related to oaks; its wood is valued for furniture and musical instruments."
    },
    {
      "name": "Bougainvillea glabra",
      "commonName": "Bougainvillea",
      "description": "A vibrant, thorny vine or shrub known for its colorful papery bracts that surround small, inconspicuous white flowers. It blooms almost year-round in tropical and subtropical climates, including November.",
      "bloomingSeason": "Year-round in tropical climates, including November",
      "location": "Tropical and subtropical regions worldwide",
      "colors": [
        "magenta",
        "purple",
        "red",
        "orange",
        "white"
      ],
      "emoji": "🌺",
      "funFact": "Bougainvillea bracts are modified leaves that attract pollinators, often mistaken as flower petals."
    }
  ]
}