{
  "date": "November 8",
  "plants": [
    {
      "name": "Chrysanthemum morifolium",
      "commonName": "Chrysanthemum",
      "description": "Chrysanthemums are flowering plants native to East Asia and northeastern Europe, well-known for their vibrant autumn blooms. They are widely cultivated in gardens and as potted plants, symbolizing longevity and joy in many cultures.",
      "bloomingSeason": "October to November",
      "location": "Temperate regions worldwide, especially East Asia, Europe, and North America",
      "colors": [
        "yellow",
        "red",
        "white",
        "purple",
        "orange"
      ],
      "emoji": "🌼",
      "funFact": "Chrysanthemums were first cultivated in China as a flowering herb as far back as the 15th century BC."
    },
    {
      "name": "Camellia japonica",
      "commonName": "Camellia",
      "description": "Camellias are evergreen shrubs known for their stunning, delicate flowers that bloom in late autumn through winter. They thrive in subtropical climates and are popular for their glossy leaves and rose-like flowers.",
      "bloomingSeason": "October to December",
      "location": "East Asia (Japan, China, Korea); cultivated in subtropical gardens worldwide",
      "colors": [
        "pink",
        "red",
        "white"
      ],
      "emoji": "🌺",
      "funFact": "Camellia flowers have a unique double-layered petal arrangement that resembles roses, and the tea plant Camellia sinensis is a close relative."
    },
    {
      "name": "Grevillea robusta",
      "commonName": "Silky Oak",
      "description": "An Australian native tree famous for its fern-like foliage and bright orange flowers that attract nectar-feeding birds. It blooms in spring and early summer in Australia but extends into November in some subtropical areas.",
      "bloomingSeason": "September to November",
      "location": "Eastern Australia; also cultivated in subtropical regions worldwide",
      "colors": [
        "orange"
      ],
      "emoji": "🧡",
      "funFact": "Despite its common name, Silky Oak is not a true oak but is valued for its timber and ornamental flowers."
    },
    {
      "name": "Magnolia grandiflora",
      "commonName": "Southern Magnolia",
      "description": "A large evergreen tree native to the southeastern United States, known for its large, fragrant white flowers that bloom from late spring through fall and sometimes sporadically into early winter in warmer areas.",
      "bloomingSeason": "May to November (sporadic bloom in November in mild climates)",
      "location": "Southeastern United States",
      "colors": [
        "white"
      ],
      "emoji": "🌷",
      "funFact": "Southern Magnolia flowers can be up to 12 inches (30 cm) wide and emit a lemony scent that attracts beetles for pollination."
    }
  ]
}