{
  "date": "November 12",
  "plants": [
    {
      "name": "Chrysanthemum morifolium",
      "commonName": "Chrysanthemum",
      "description": "Chrysanthemums are popular garden flowers known for their vibrant and diverse blooms that appear in late autumn. They have a rich cultural significance in many countries and add color to gardens as other plants begin to fade.",
      "bloomingSeason": "September to November",
      "location": "Temperate regions worldwide (Asia, Europe, North America)",
      "colors": [
        "yellow",
        "white",
        "red",
        "purple",
        "orange"
      ],
      "emoji": "🌼",
      "funFact": "Chrysanthemums are symbols of longevity and rejuvenation in East Asia and are often associated with the autumn festival season."
    },
    {
      "name": "Camellia japonica",
      "commonName": "Japanese Camellia",
      "description": "Japanese Camellias are evergreen shrubs that produce large, attractive flowers during the cooler seasons. Their blooms can last for several weeks, brightening up gardens when fewer plants flower.",
      "bloomingSeason": "October to March",
      "location": "East Asia (Japan, China, Korea) and cultivated in mild temperate climates worldwide",
      "colors": [
        "red",
        "pink",
        "white"
      ],
      "emoji": "🌺",
      "funFact": "Camellia japonica was the first camellia species introduced to Western gardeners in the 18th century, sparking a long history of camellia cultivation."
    },
    {
      "name": "Grevillea robusta",
      "commonName": "Silky Oak",
      "description": "The Silky Oak is a fast-growing tree native to Australia, producing clusters of bright orange flowers that attract birds. Its blooming in late spring to early summer fits November in the Southern Hemisphere's spring season.",
      "bloomingSeason": "September to December",
      "location": "Eastern Australia and cultivated in subtropical regions",
      "colors": [
        "orange"
      ],
      "emoji": "🌻",
      "funFact": "Despite its common name, Silky Oak is not an oak but is valued for its ornamental flowers and timber."
    },
    {
      "name": "Bougainvillea glabra",
      "commonName": "Bougainvillea",
      "description": "Bougainvillea is a woody vine known for its vibrant bracts surrounding tiny white flowers. It thrives in tropical and subtropical climates and blooms year-round in frost-free areas, often peaking in the dry season.",
      "bloomingSeason": "Year-round with peaks in dry seasons",
      "location": "Tropical and subtropical regions worldwide, native to South America",
      "colors": [
        "magenta",
        "purple",
        "red",
        "orange",
        "white"
      ],
      "emoji": "🌺",
      "funFact": "Bougainvillea's colorful parts are actually modified leaves called bracts, not petals."
    }
  ]
}