{
  "date": "November 18",
  "plants": [
    {
      "name": "Chrysanthemum morifolium",
      "commonName": "Chrysanthemum",
      "description": "Chrysanthemums are popular garden flowers known for their vibrant blooms that flourish in late autumn. They feature a wide variety of flower shapes and colors, and are often used in floral arrangements and as ornamental plants.",
      "bloomingSeason": "October to November",
      "location": "Temperate regions worldwide, commonly cultivated in gardens",
      "colors": [
        "yellow",
        "white",
        "red",
        "purple"
      ],
      "emoji": "🌼",
      "funFact": "Chrysanthemums are symbols of autumn in many cultures and are associated with longevity and rejuvenation in Asia."
    },
    {
      "name": "Magnolia grandiflora",
      "commonName": "Southern Magnolia",
      "description": "Southern Magnolia is an evergreen tree famous for its large, fragrant white flowers that bloom from late spring into late autumn in warm climates. In some regions, blooming extends into November, especially in mild subtropical zones.",
      "bloomingSeason": "May to November",
      "location": "Southeastern United States and similar climates",
      "colors": [
        "white"
      ],
      "emoji": "🌸",
      "funFact": "The southern magnolia's flowers can be up to 12 inches in diameter and have a lemony fragrance that attracts beetles for pollination."
    },
    {
      "name": "Rhododendron simsii",
      "commonName": "Azalea",
      "description": "Azaleas are shrubs celebrated for their stunning flower displays. In tropical and subtropical areas, some azalea species bloom in autumn and into November, offering vibrant color when many temperate species have finished blooming.",
      "bloomingSeason": "October to December",
      "location": "Subtropical Asia, also cultivated in gardens worldwide",
      "colors": [
        "pink",
        "red",
        "white",
        "purple"
      ],
      "emoji": "🌺",
      "funFact": "Azaleas are part of the Rhododendron genus and contain toxins that can be deadly if ingested by humans or pets."
    },
    {
      "name": "Eucalyptus pauciflora",
      "commonName": "Snow Gum",
      "description": "Snow Gum is a eucalyptus species native to the Australian subalpine regions. It often blooms in late spring to early summer, but certain populations can bloom again in late autumn, producing clusters of creamy white flowers.",
      "bloomingSeason": "November to December (late blooming populations)",
      "location": "Australian Alps",
      "colors": [
        "white"
      ],
      "emoji": "🌿",
      "funFact": "Snow Gum trees are resilient to cold and snow, a rarity among eucalyptus species typically found in warmer climates."
    }
  ]
}