{
  "date": "November 24",
  "plants": [
    {
      "name": "Chrysanthemum indicum",
      "commonName": "Chrysanthemum",
      "description": "Chrysanthemums are hardy perennial flowers known for their vibrant and long-lasting blooms. They often flower in late autumn, bringing vivid color before winter sets in, and are popular in gardens and floral arrangements worldwide.",
      "bloomingSeason": "September to November",
      "location": "Temperate zones worldwide",
      "colors": [
        "yellow",
        "white",
        "red",
        "purple"
      ],
      "emoji": "🌼",
      "funFact": "Chrysanthemums are symbolic of autumn and longevity in many cultures, particularly in Japan and China."
    },
    {
      "name": "Rhododendron arboreum",
      "commonName": "Tree Rhododendron",
      "description": "This species of rhododendron is notable for its large clusters of bright red flowers that often bloom in late autumn to early winter. It is a significant ornamental and wild plant in the Himalayan region.",
      "bloomingSeason": "October to December",
      "location": "Himalayan region, South Asia",
      "colors": [
        "red"
      ],
      "emoji": "🌺",
      "funFact": "Rhododendron arboreum is the national flower of Nepal and is celebrated for its striking bright red blossoms."
    },
    {
      "name": "Camellia japonica",
      "commonName": "Japanese Camellia",
      "description": "Camellia japonica is an evergreen shrub that produces large, showy flowers in cool seasons, often blooming from late autumn through winter. It is widely cultivated for its beauty in temperate gardens worldwide.",
      "bloomingSeason": "October to March",
      "location": "East Asia and cultivated globally",
      "colors": [
        "red",
        "pink",
        "white"
      ],
      "emoji": "🌸",
      "funFact": "Camellia japonica flowers were a favorite motif for Victorian-era gardeners and symbolize admiration and perfection."
    },
    {
      "name": "Banksia integrifolia",
      "commonName": "Coast Banksia",
      "description": "Banksia integrifolia produces striking cylindrical flower spikes that bloom in late autumn to early winter, attracting numerous nectar-feeding birds and insects along Australian coastlines.",
      "bloomingSeason": "May to November (late season in some areas)",
      "location": "Eastern Australia",
      "colors": [
        "yellow",
        "cream"
      ],
      "emoji": "🌻",
      "funFact": "Banksias are vital nectar sources in Australian ecosystems and are named after botanist Sir Joseph Banks."
    }
  ]
}