{
  "date": "November 27",
  "plants": [
    {
      "name": "Camellia japonica",
      "commonName": "Japanese Camellia",
      "description": "An evergreen shrub known for its glossy leaves and large, roselike flowers. It blooms from late fall to early spring, providing vibrant color in mild winters.",
      "bloomingSeason": "October to March",
      "location": "Eastern Asia, also widely cultivated in temperate regions globally",
      "colors": [
        "pink",
        "red",
        "white"
      ],
      "emoji": "🌺",
      "funFact": "Camellia japonica flowers were once used to produce tea before Camellia sinensis became popular."
    },
    {
      "name": "Chrysanthemum morifolium",
      "commonName": "Garden Mum",
      "description": "Popular garden chrysanthemums bloom profusely in late autumn, celebrated in festivals particularly in East Asia. They have a variety of flower forms and colors.",
      "bloomingSeason": "October to November",
      "location": "Native to East Asia, widely cultivated worldwide",
      "colors": [
        "yellow",
        "white",
        "red",
        "purple"
      ],
      "emoji": "🌼",
      "funFact": "Chrysanthemums symbolize longevity and rejuvenation in many Asian cultures."
    },
    {
      "name": "Nerium oleander",
      "commonName": "Oleander",
      "description": "A hardy evergreen shrub that blooms in warm climates. In Mediterranean and subtropical zones, it flowers from spring through late fall, often extending into November depending on conditions.",
      "bloomingSeason": "Spring to late fall",
      "location": "Mediterranean Basin, South Asia, cultivated in subtropical regions worldwide",
      "colors": [
        "pink",
        "white",
        "red"
      ],
      "emoji": "🌸",
      "funFact": "Despite its beauty, all parts of the oleander plant are highly toxic if ingested."
    },
    {
      "name": "Hibiscus rosa-sinensis",
      "commonName": "Chinese Hibiscus",
      "description": "A tropical shrub with large, showy flowers that can bloom year-round in frost-free climates, including November in many tropical and subtropical areas.",
      "bloomingSeason": "Year-round in frost-free climates",
      "location": "Native to East Asia, tropical and subtropical regions worldwide",
      "colors": [
        "red",
        "pink",
        "yellow",
        "white"
      ],
      "emoji": "🌺",
      "funFact": "Hibiscus flowers are used to make a popular tart-infused tea called 'agua de Jamaica' in Latin America."
    }
  ]
}