{
  "date": "August 3",
  "holidays": [
    {
      "name": "Watermelon Day",
      "description": "A juicy celebration of one of summer's most refreshing fruits – the watermelon! Perfect for picnics, seed-spitting contests, and indulging in that sweet, pink goodness.",
      "origin": "This unofficial food holiday originated as a way to celebrate and enjoy the quintessential summer fruit.",
      "category": "Food Holiday",
      "emoji": "🍉",
      "funFact": "Watermelons are over 90% water, making them a delicious way to stay hydrated on hot days!"
    },
    {
      "name": "National Grab Some Nuts Day",
      "description": "A nutty celebration encouraging everyone to enjoy some crunchy, nutritious nuts – whether almonds, peanuts, or cashews!",
      "origin": "Started in the United States to promote healthy snacking and awareness of various nuts’ benefits.",
      "category": "Food/Nutrition Holiday",
      "emoji": "🥜",
      "funFact": "Despite the name, peanuts are actually legumes, not true nuts!"
    },
    {
      "name": "Swiss Wrestling Festival Day",
      "description": "Celebrates the traditional Swiss sport of Schwingen, a kind of folk wrestling where competitors try to throw each other onto the back.",
      "origin": "Dating back to the 13th century in Switzerland, this day honors the age-old tradition and the festivals held around it.",
      "category": "Cultural Tradition",
      "emoji": "🤼‍♂️",
      "funFact": "Swiss wrestlers compete in sawdust-filled rings; the winners often earn wreaths made of flowers and cowbells!"
    },
    {
      "name": "National Water Quality Month (Start)",
      "description": "Kicks off a month-long focus on the importance of clean water, protecting watersheds, and awareness about water pollution issues.",
      "origin": "Designated to promote water conservation and quality awareness across communities.",
      "category": "Environmental Awareness",
      "emoji": "💧",
      "funFact": "Only about 3% of the world's water is freshwater, and an even smaller fraction is accessible for human use!"
    }
  ]
}