{
  "date": "August 4",
  "holidays": [
    {
      "name": "Chocolate Chip Cookie Day",
      "description": "A deliciously sweet day dedicated to celebrating the beloved chocolate chip cookie, an all-time favorite treat around the world.",
      "origin": "This holiday commemorates the accidental invention of the chocolate chip cookie by Ruth Graves Wakefield in the 1930s at the Toll House Inn in Massachusetts.",
      "category": "Food Holiday",
      "emoji": "🍪",
      "funFact": "Did you know? The original chocolate chip cookie recipe was created by adding chopped Nestlé chocolate bars into cookie dough, giving birth to an iconic American dessert!"
    },
    {
      "name": "Coast Guard Day",
      "description": "A day honoring the United States Coast Guard and its courageous service protecting the nation’s waters, saving lives, and enforcing maritime law.",
      "origin": "Observed annually to commemorate the founding of the Revenue Cutter Service on August 4, 1790, which later evolved into the modern Coast Guard.",
      "category": "Awareness Day / Service Holiday",
      "emoji": "🚢",
      "funFact": "The Coast Guard is the only military branch under the Department of Homeland Security, and it uniquely combines law enforcement, search and rescue, and military duties!"
    },
    {
      "name": "National Single Working Woman's Day",
      "description": "Celebrating the independence, strength, and awesomeness of single working women everywhere, recognizing their contributions and resilience.",
      "origin": "An unofficial, modern observance started to uplift and honor single professional women making strides in their careers and lives.",
      "category": "Pop Culture / Social Awareness",
      "emoji": "💼👩",
      "funFact": "This day encourages single working women to treat themselves—whether it’s with a spa day, a movie night, or conquering a new project at work!"
    },
    {
      "name": "International Beer Day (First Friday of August)",
      "description": "Although varying year to year, International Beer Day often falls on the first Friday of August, which sometimes is August 4. It’s a worldwide celebration of beer, brewers, and the joyous social occasions they inspire.",
      "origin": "Started in 2007 in Santa Cruz, California, with the mission to unite beer lovers globally with a pint in hand.",
      "category": "Food & Drink / Cultural Celebration",
      "emoji": "🍺",
      "funFact": "On this day, beer enthusiasts around the world raise a glass in honor of their local brewers and enjoy trying unique and craft beers."
    }
  ]
}