{
  "date": "August 5",
  "holidays": [
    {
      "name": "National Underwear Day",
      "description": "A cheeky celebration encouraging everyone to embrace comfort and confidence by rocking their favorite underwear—whether it's fancy lingerie or cozy boxers!",
      "origin": "Started in 2003 by Australian undergarment brand \"Bonds\" to promote body positivity and break the taboo around underwear.",
      "category": "Unusual/Fun",
      "emoji": "🩲",
      "funFact": "Some people celebrate by wearing only their underwear outside as a fun, liberating protest against social norms!"
    },
    {
      "name": "National Oyster Day",
      "description": "A tasty tribute to the briny bivalve mollusks that have been enjoyed by coastal cultures for centuries. Perfect for seafood lovers to indulge in oysters raw, grilled, or fried!",
      "origin": "Began as an American food holiday to honor and celebrate the oyster’s culinary and ecological importance.",
      "category": "Food",
      "emoji": "🦪",
      "funFact": "Oysters can filter up to 50 gallons of water a day, making them natural water purifiers and essential to ocean health."
    },
    {
      "name": "Work Like a Dog Day",
      "description": "A humorous day to poke fun at hard work and hustle culture by comparing your effort to that of a hardworking dog, or to remind yourself to take breaks!",
      "origin": "An unofficial fun observance that encourages balancing diligence with play and relaxation.",
      "category": "Humor/Work",
      "emoji": "🐶",
      "funFact": "Dogs often work to assist humans in tasks like herding, hunting, or rescue — making this day a nod to their loyal work ethic."
    },
    {
      "name": "National Friendship Day (UK)",
      "description": "A day to appreciate and celebrate the friendships that bring joy and support. Different countries observe Friendship Day on various dates; in the UK, it’s often celebrated on August 5.",
      "origin": "Friendship Day was first proposed in 1958 and adopted by many cultures worldwide on different days throughout summer.",
      "category": "Social/Relationship",
      "emoji": "🤝",
      "funFact": "In addition to exchanging cards and gifts, some people celebrate by organizing group activities or sharing stories about their closest friends."
    }
  ]
}