{
  "date": "August 12",
  "holidays": [
    {
      "name": "International Left-Handers Day",
      "description": "A day to celebrate the uniqueness and quirks of being left-handed in a right-handed world! Lefties get recognition for their creativity and the special challenges they face.",
      "origin": "Created by Dean R. Campbell in 1976 to raise awareness of the inconveniences left-handed people encounter.",
      "category": "Awareness Day",
      "emoji": "🖐️",
      "funFact": "Approximately only 10% of the world's population is left-handed, making this day a rare and special celebration!"
    },
    {
      "name": "World Elephant Day",
      "description": "Dedicated to the preservation and protection of elephants worldwide, raising awareness about their plight and the importance of conservation.",
      "origin": "Founded in 2012 by Patricia Sims and the Elephant Reintroduction Foundation to inspire and educate about elephant conservation.",
      "category": "Conservation Day",
      "emoji": "🐘",
      "funFact": "Elephants are known for their incredible memory and complex social structures, making them one of the most intelligent animals on Earth."
    },
    {
      "name": "Vinyl Record Day",
      "description": "A celebration of all things vinyl, from collecting classic records to appreciating the warm sound unique to analog music formats.",
      "origin": "Emerging from the resurgence of vinyl record popularity among audiophiles and collectors in the 21st century.",
      "category": "Pop Culture",
      "emoji": "🎶",
      "funFact": "Vinyl records outsold CDs for the first time since the 1980s in the past decade, proving that old school is cool again!"
    },
    {
      "name": "Middle Child Day",
      "description": "A quirky day to recognize and appreciate middle children who often feel sandwiched between their siblings, sometimes overlooked but definitely special.",
      "origin": "Uncertain, but it gained popularity online as families looked to spotlight different sibling roles.",
      "category": "Family/Quirky Holidays",
      "emoji": "👶",
      "funFact": "Middle children are often said to be great negotiators and peacemakers within families!"
    }
  ]
}