{
  "date": "August 13",
  "holidays": [
    {
      "name": "Left-Handers Day",
      "description": "A day to celebrate the unique talents and quirks of left-handed people in a right-handed world.",
      "origin": "Started in 1976 by Dean R. Campbell to promote awareness of the challenges left-handed people face and to celebrate their distinctiveness.",
      "category": "Awareness Day",
      "emoji": "✋🖐️",
      "funFact": "Approximately 10% of the world's population is left-handed, making them a quirky minority! On this day, lefties often try using right-handed tools to show how tricky they can be."
    },
    {
      "name": "International Lefthanders Rule Day",
      "description": "An unofficial extension of Left-Handers Day but with a more rebellious twist, encouraging lefties to 'rule' the day by showing off their creative dominance.",
      "origin": "A playful spin on Left-Handers Day that emerged from internet communities to celebrate the lefty lifestyle with a bit more swagger.",
      "category": "Pop Culture Celebration",
      "emoji": "🤘",
      "funFact": "Some lefties claim they have enhanced creativity and problem-solving skills — and on this day, they put those claims to the test!"
    },
    {
      "name": "National Filet Mignon Day",
      "description": "A tasty tribute to the luxurious and tender beef steak known as filet mignon.",
      "origin": "An American food holiday created by culinary enthusiasts to honor one of the most prized cuts of steak in fine dining.",
      "category": "Food Holiday",
      "emoji": "🥩",
      "funFact": "Filet mignon means 'cute fillet' in French — because it’s the most tender and small cut from the cow’s tenderloin."
    },
    {
      "name": "National Prosecco Day",
      "description": "A sparkling celebration of the Italian sparkling wine Prosecco! Time to pop bottles and toast with bubbles.",
      "origin": "A fun, unofficial holiday embraced by wine lovers and Italian culture enthusiasts worldwide.",
      "category": "Food and Drink Holiday",
      "emoji": "🥂",
      "funFact": "Prosecco comes mainly from northeastern Italy and is traditionally made using the Charmat method, which preserves its fresh and fruity bubbles."
    }
  ]
}