{
  "date": "August 14",
  "holidays": [
    {
      "name": "National Creamsicle Day",
      "description": "Celebrate the delightful frozen treat that combines creamy vanilla and tangy orange flavors in a refreshing popsicle form.",
      "origin": "The Creamsicle was invented in the early 1900s, with the treat becoming popular in the 1950s as an ideal summer frozen dessert.",
      "category": "Food Holiday",
      "emoji": "🍦",
      "funFact": "The Creamsicle actually came before the more famous Fudgsicle, making it one of the first branded ice pops in America!"
    },
    {
      "name": "Violet Warning Day",
      "description": "A quirky day that humorously warns people about the surprising invasiveness of violet flowers in gardens.",
      "origin": "Originated from gardening communities noticing how these seemingly innocent flowers spread rapidly and take over beds and lawns.",
      "category": "Nature/Environmental Awareness",
      "emoji": "💜",
      "funFact": "Though delicate-looking, violets can spread underground by runners, making them tough to remove once established."
    },
    {
      "name": "National Black Cow Day",
      "description": "A celebration of the tasty classic soda fountain drink made with root beer and creamy vanilla ice cream.",
      "origin": "Black Cow is a vintage soda fountain favorite dating back to the early 20th century, often enjoyed as a retro indulgence.",
      "category": "Food Holiday",
      "emoji": "🥤",
      "funFact": "Different regions have variations of the Black Cow; in some places, it's called a Root Beer Float."
    },
    {
      "name": "National Financial Awareness Day",
      "description": "A day to raise awareness about the importance of financial literacy and awareness of personal finances.",
      "origin": "Created by financial education advocates to encourage better money management and understanding of finances.",
      "category": "Awareness Day",
      "emoji": "💰",
      "funFact": "Research shows many Americans struggle with basic money management skills—this day aims to help change that!"
    }
  ]
}