{
  "date": "August 15",
  "holidays": [
    {
      "name": "Relaxation Day",
      "description": "A perfect excuse to unwind, kick back, and indulge in some guilt-free relaxation. Whether it’s a nap, a spa day, or just sitting quietly, this day is dedicated to doing nothing and enjoying it to the fullest.",
      "origin": "Started in 1985 by a small group of wellness advocates who felt the world needed a reminder to slow down, Relaxation Day has grown into a popular mental health observance.",
      "category": "Wellness & Lifestyle",
      "emoji": "🛀",
      "funFact": "Spanish researchers found that just 10 minutes of relaxing activities can reduce stress by up to 30%!"
    },
    {
      "name": "National Thrift Shop Day",
      "description": "Celebrate the thrill of the find and the sustainable joy of shopping secondhand! This day champions thrift stores and all the quirky treasures you can discover in them.",
      "origin": "Started by thrift shop enthusiasts and environmentalists in the 1980s to promote recycling and reusing through secondhand shopping.",
      "category": "Shopping & Environment",
      "emoji": "🛍️",
      "funFact": "Thrift shopping is a billion-dollar industry that helps reduce millions of tons of textile waste annually."
    },
    {
      "name": "National Lemon Meringue Pie Day",
      "description": "A delightful day dedicated to the tangy-sweet masterpiece of lemon meringue pie — crisp crust, tart lemon filling, and cloud-like meringue topping!",
      "origin": "An American food holiday likely started by baking enthusiasts and pie lovers keen to honor this classic dessert.",
      "category": "Food & Drink",
      "emoji": "🥧",
      "funFact": "Lemon meringue pie gained popularity in the 19th century but really skyrocketed when lemon juice and meringue were discovered to be a perfect pairing!"
    },
    {
      "name": "Independence Day (India)",
      "description": "A major national holiday marking India’s independence from British rule in 1947, filled with flag hoisting, parades, and patriotic celebrations.",
      "origin": "Officially recognized since August 15, 1947, when India became a sovereign nation after decades of struggle",
      "category": "National Holiday",
      "emoji": "🇮🇳",
      "funFact": "The first Prime Minister, Jawaharlal Nehru, delivered his iconic 'Tryst with Destiny' speech on this day at midnight."
    }
  ]
}