{
  "date": "August 20",
  "holidays": [
    {
      "name": "National Radio Day",
      "description": "A day to celebrate the invention and impact of the radio, honoring the technology that revolutionized communication and entertainment.",
      "origin": "National Radio Day was inspired by the birthdate of inventor Guglielmo Marconi, credited with pioneering radio technology in the late 19th century.",
      "category": "Technology & Communication",
      "emoji": "📻",
      "funFact": "The first radio broadcast is often attributed to 1906, and today, radio reaches over 95% of the US population weekly!"
    },
    {
      "name": "World Mosquito Day",
      "description": "Commemorates the discovery that female mosquitoes transmit malaria, raising awareness about mosquito-borne diseases and prevention efforts.",
      "origin": "Observed since 1897, the day marks Dr. Ronald Ross's discovery of the malaria parasite in the stomach of a mosquito in 1897.",
      "category": "Health & Awareness",
      "emoji": "🦟",
      "funFact": "Mosquitoes are considered the deadliest animals on Earth due to the spread of diseases causing millions of deaths annually."
    },
    {
      "name": "National Senior Citizens Day (Philippines)",
      "description": "A Filipino observance to honor and appreciate the contributions and hard work of senior citizens in society.",
      "origin": "Established by the Philippine government to promote respect and care for the elderly population.",
      "category": "Social Awareness",
      "emoji": "👵👴",
      "funFact": "The Philippines celebrates this day with activities encouraging young people to connect with senior citizens and share life stories."
    },
    {
      "name": "National Lemonade Day",
      "description": "A fun day dedicated to the refreshing and zesty drink beloved especially during hot summer days—lemonade!",
      "origin": "Started as a fun way to encourage kids to run lemonade stands and learn about entrepreneurship, money management, and community involvement.",
      "category": "Food & Drink",
      "emoji": "🍋🍹",
      "funFact": "Lemonade dates back to ancient Egypt around 1000 AD, making it one of the oldest known drinks!"
    }
  ]
}