{
  "date": "August 24",
  "holidays": [
    {
      "name": "National Peach Pie Day",
      "description": "A scrumptious day to celebrate peach pie, a delicious dessert loved by many, especially during the late summer harvest.",
      "origin": "This observance has been popularized in the US as a way to honor one of the sweetest fruits of summer baked into a classic pie.",
      "category": "Food Holiday",
      "emoji": "🥧🍑",
      "funFact": "Peach pie is so beloved that some bakeries hold annual contests to crown the best peach pie baker! Also, peaches were once called 'Persian Apples'."
    },
    {
      "name": "Pioneer Historical Society Day",
      "description": "A day to celebrate the pioneering spirit and the historical societies that preserve tales and artifacts from early settlers.",
      "origin": "Observed by various cultural and historical groups to honor the preservation of pioneer heritage and local histories.",
      "category": "Cultural/Historical",
      "emoji": "🛖📜",
      "funFact": "The first historical societies date back to the 19th century and helped save countless artifacts that would have otherwise been lost to time."
    },
    {
      "name": "National Waffle Day (International)",
      "description": "Though US National Waffle Day is in August, in some parts of the world August 24 is an unofficial day to enjoy waffles with all the toppings you can imagine!",
      "origin": "Celebrated by waffle lovers internationally as a fun reason to indulge in waffles, sweet or savory.",
      "category": "Food Holiday",
      "emoji": "🧇🍯",
      "funFact": "Waffles date back to the Middle Ages and were originally cooked between two plates of metal patterned with religious symbols."
    },
    {
      "name": "Moon Day (US Air Force)",
      "description": "Commemorates the first US Air Force moon landing mission's achievements and the ongoing exploration of the lunar surface.",
      "origin": "Recognized within Air Force circles to honor space missions and astronauts connected to lunar exploration.",
      "category": "Space Exploration",
      "emoji": "🌕🚀",
      "funFact": "The US Air Force played a crucial role in moon exploration planning and support during the Apollo missions of the 1960s and 70s."
    }
  ]
}