{
  "date": "August 26",
  "holidays": [
    {
      "name": "Just Because Day",
      "description": "A delightfully pointless holiday invented for no special reason—celebrate life and spontaneity by doing something fun 'just because'!",
      "origin": "Created by an advertising agency in the 1980s to encourage unplanned kindness and joy.",
      "category": "Fun/Quirky",
      "emoji": "🎉",
      "funFact": "People often share random acts of kindness on Just Because Day, proving sometimes the best moments happen with no reason at all!"
    },
    {
      "name": "National Dog Day",
      "description": "A day dedicated to honoring dogs of all breeds, their love, loyalty, and the joy they bring to our lives.",
      "origin": "Founded in 2004 by animal welfare advocate Colleen Paige to raise awareness about adoption and rescue.",
      "category": "Animal Awareness",
      "emoji": "🐕",
      "funFact": "National Dog Day celebrates not just pets but also working dogs, including service dogs and therapy dogs who perform incredible tasks!"
    },
    {
      "name": "National Cherry Popsicle Day",
      "description": "Cool down with some fruity nostalgia by enjoying the classic cherry popsicle treat—perfect for beating the summer heat!",
      "origin": "Popsicles were invented in the early 1900s, but cherry flavor remains a perennial favorite among fans.",
      "category": "Food Holiday",
      "emoji": "🍒",
      "funFact": "Cherry popsicles were among the original flavors when the Popsicle brand launched, sparking countless childhood memories."
    },
    {
      "name": "Women’s Equality Day",
      "description": "Marks the anniversary of the 19th Amendment’s certification in 1920, granting women the right to vote in the U.S.",
      "origin": "Officially designated in 1971 to honor women’s suffrage and promote equal rights.",
      "category": "Historical/Awareness",
      "emoji": "♀️",
      "funFact": "Women's Equality Day encourages reflection on the progress made and the work still needed for full gender equality."
    }
  ]
}