{
  "date": "August 27",
  "holidays": [
    {
      "name": "Just Because Day",
      "description": "A whimsical holiday that encourages doing something nice or spontaneous without any special reason or occasion.",
      "origin": "Originated in the 1980s as a way to celebrate the joy of random acts of kindness and spur-of-the-moment fun.",
      "category": "Whimsical Celebration",
      "emoji": "🎉",
      "funFact": "Just Because Day promotes happiness by reminding people that sometimes, you don’t need a reason to celebrate or be kind!"
    },
    {
      "name": "Lyndon B. Johnson National Historical Park Day",
      "description": "Marks the birthday of the 36th U.S. President Lyndon B. Johnson, recognizing his contributions and legacy.",
      "origin": "Established to honor President Johnson’s role in civil rights legislation and the Great Society program.",
      "category": "Historical/Political",
      "emoji": "🇺🇸",
      "funFact": "LBJ was known for his powerful 'Johnson Treatment'—a persuasive tactic where he would get up close and personal to win people over."
    },
    {
      "name": "Just Read It Day",
      "description": "An unofficial encouragement day to pick up a book, magazine, or article and just read something to feed your mind and imagination.",
      "origin": "Birthed by various reading advocates and book lovers to combat the digital overload and promote literacy.",
      "category": "Literary/Reading",
      "emoji": "📚",
      "funFact": "This day is perfect for finishing that book you’ve been putting off or starting a new genre you've never tried!"
    },
    {
      "name": "Bow Tie Day",
      "description": "A quirky celebration honoring one of the most distinctive neckwear accessories: the bow tie!",
      "origin": "Became popular through fashion enthusiasts and bow tie aficionados who wanted to celebrate this stylish and fun accessory.",
      "category": "Fashion/Style",
      "emoji": "🎀",
      "funFact": "Bow ties have been a symbol of individuality and intellect—Winston Churchill and Albert Einstein famously rocked them!"
    }
  ]
}