{
  "date": "August 30",
  "holidays": [
    {
      "name": "International Whale Shark Day",
      "description": "A day dedicated to celebrating the gentle giants of the ocean – the whale sharks! These massive creatures are the largest fish species on Earth and are known for their peaceful nature.",
      "origin": "Established by marine conservation groups to raise awareness about whale shark protection and ocean conservation.",
      "category": "Environmental Awareness",
      "emoji": "🦈",
      "funFact": "Whale sharks can grow as long as a school bus and live up to 70 years or more!"
    },
    {
      "name": "National Toasted Marshmallow Day (USA)",
      "description": "A yummy celebration honoring the gooey, golden-crisp perfection of toasted marshmallows, perfect for campfires and s'mores!",
      "origin": "Unofficial food holiday created by marshmallow and camping enthusiasts to enjoy the iconic treat.",
      "category": "Food Celebration",
      "emoji": "🔥",
      "funFact": "The earliest marshmallows were made from the root sap of the marshmallow plant before becoming the sweet snack we know today."
    },
    {
      "name": "Spider-Man Day",
      "description": "A day to swing into action and celebrate everyone's favorite web-slinging superhero, Spider-Man!",
      "origin": "Officially recognized in New York City in 2015 to honor the iconic comic book and film character created by Stan Lee and Steve Ditko.",
      "category": "Pop Culture",
      "emoji": "🕷️",
      "funFact": "Spider-Man was the first teenage superhero who wasn’t a sidekick, inspiring generations to embrace responsibility with their powers."
    },
    {
      "name": "More Herbs, Less Salt Day",
      "description": "A health-conscious observance encouraging people to enhance their meals with herbs instead of salt to reduce sodium intake and promote wellness.",
      "origin": "Created by health advocates to inspire healthier cooking habits and awareness of the dangers of excessive salt.",
      "category": "Health Awareness",
      "emoji": "🌿",
      "funFact": "Herbs like basil and rosemary not only boost flavor but also contain antioxidants and vitamins!"
    }
  ]
}