{
  "date": "September 14",
  "events": [
    {
      "year": 1814,
      "title": "Francis Scott Key writes 'The Star-Spangled Banner'",
      "description": "During the War of 1812, Francis Scott Key wrote the poem that would become the lyrics of the United States national anthem, inspired by the British bombardment of Fort McHenry.",
      "category": "Cultural",
      "significance": "The poem was later set to music and became an important patriotic symbol, eventually adopted as the U.S. national anthem."
    },
    {
      "year": 1901,
      "title": "U.S. President William McKinley dies",
      "description": "President William McKinley died after being shot by an assassin on September 6, 1901, making September 14 the day his death was officially recorded and his Vice President Theodore Roosevelt assumed the presidency.",
      "category": "Political",
      "significance": "This event marked a significant transition in U.S. leadership and policies during the Progressive Era."
    },
    {
      "year": 1959,
      "title": "The Soviet Union launches Luna 2",
      "description": "Luna 2 became the first human-made object to reach the Moon's surface, marking a significant milestone in space exploration during the Cold War.",
      "category": "Science and Technology",
      "significance": "It was a major achievement in the space race, demonstrating Soviet capabilities and advancing lunar exploration."
    },
    {
      "year": 1940,
      "title": "Germany begins systematic bombing of London in World War II",
      "description": "The Luftwaffe launched continuous bombing raids on London, marking the start of the Blitz, which lasted for several months.",
      "category": "Military",
      "significance": "The bombings had profound effects on civilian morale and urban infrastructure and influenced the course of the war."
    },
    {
      "year": 1960,
      "title": "OPEC founded",
      "description": "The Organization of the Petroleum Exporting Countries (OPEC) was founded by five oil-producing countries to regulate oil prices and supplies.",
      "category": "Economic/Political",
      "significance": "OPEC has played a crucial role in global oil markets and international economic relations."
    }
  ]
}