{
  "date": "September 15",
  "events": [
    {
      "year": 1830,
      "title": "Launch of the First Passenger Railway Chartered in Britain",
      "description": "The Liverpool and Manchester Railway, which was the first railway to rely exclusively on steam power, was officially opened. It marked the beginning of the railway age in Britain.",
      "category": "Transportation",
      "significance": "This event revolutionized transport, commerce, and the Industrial Revolution, enabling faster movement of goods and people."
    },
    {
      "year": 1916,
      "title": "Battle of Flers-Courcelette Begins",
      "description": "Part of the larger Battle of the Somme in World War I, this battle was notable for the first use of tanks in warfare by the British forces.",
      "category": "Military",
      "significance": "The introduction of tanks marked a turning point in military technology and modern warfare tactics."
    },
    {
      "year": 1940,
      "title": "The Blitz Begins on London",
      "description": "The German Luftwaffe launched an intense bombing campaign on London and other British cities during World War II.",
      "category": "Military/War",
      "significance": "Marked a critical phase in the Battle of Britain, demonstrating the devastating effects of aerial bombing on civilian populations."
    },
    {
      "year": 1963,
      "title": "Martin Luther King Jr. Writes 'Letter from Birmingham Jail'",
      "description": "While imprisoned, King penned this influential letter defending nonviolent resistance to racism.",
      "category": "Civil Rights",
      "significance": "The letter became a foundational text for the American civil rights movement, articulating moral and strategic arguments against segregation and injustice."
    },
    {
      "year": 1997,
      "title": "Membership of Hong Kong Transferred to China Announced",
      "description": "The official transfer of sovereignty over Hong Kong from Britain to China was scheduled for July 1, 1997, with preparations and negotiations culminating around this time.",
      "category": "Political",
      "significance": "Marked the end of British colonial rule in Hong Kong and the beginning of Chinese administration under the 'one country, two systems' framework."
    }
  ]
}