{
  "date": "September 17",
  "events": [
    {
      "year": 1787,
      "title": "Signing of the United States Constitution",
      "description": "The United States Constitution was signed by delegates at the Constitutional Convention in Philadelphia, marking the establishment of the framework of the federal government of the United States.",
      "category": "Political",
      "significance": "It laid the foundational legal structure for the United States, influencing democratic governance worldwide."
    },
    {
      "year": 1862,
      "title": "Battle of Antietam",
      "description": "The Battle of Antietam during the American Civil War became the bloodiest single-day battle in American history with about 22,700 casualties.",
      "category": "Military",
      "significance": "This battle halted the Confederate advance into the North and gave President Abraham Lincoln the opportunity to issue the Emancipation Proclamation."
    },
    {
      "year": 1939,
      "title": "Soviet Union invades Poland",
      "description": "Following the Molotov-Ribbentrop Pact, the Soviet Union invaded eastern Poland, expanding the conflict of World War II.",
      "category": "Military",
      "significance": "This invasion contributed to the division of Poland between Germany and the Soviet Union, escalating World War II."
    },
    {
      "year": 1978,
      "title": "First Women's Day at the US Open",
      "description": "Chris Evert and Billie Jean King fought the first officially designated Women's Day at the US Open tennis tournament.",
      "category": "Sports/Cultural",
      "significance": "This event marked a milestone in women's sports, promoting gender equality in tennis and sports in general."
    },
    {
      "year": 2016,
      "title": "Rome Declaration signed",
      "description": "Representatives from 27 European Union countries signed the Rome Declaration commemorating the 60th anniversary of the Treaty of Rome.",
      "category": "Political",
      "significance": "The declaration reaffirmed commitment to a united Europe amidst growing challenges to unity."
    }
  ]
}