{
  "date": "September 18",
  "events": [
    {
      "year": 1793,
      "title": "Start of the French Revolutionary Calendar",
      "description": "The French First Republic introduces the French Revolutionary Calendar, designed to remove religious and royalist influences from the calendar system.",
      "category": "Political/Calendar Reform",
      "significance": "Represents an attempt to secularize and rationalize timekeeping during the revolutionary period."
    },
    {
      "year": 1851,
      "title": "First America's Cup Yacht Race",
      "description": "The yacht America wins the first race around the Isle of Wight, which later becomes known as the America's Cup.",
      "category": "Sports/Sailing",
      "significance": "Marks the beginning of the world's oldest international sporting trophy competition."
    },
    {
      "year": 1931,
      "title": "Japan Invades Manchuria",
      "description": "The Mukden Incident leads to Japan's invasion and occupation of northeastern China (Manchuria).",
      "category": "Military/Conflict",
      "significance": "A major prelude to the Pacific conflicts of World War II, escalating tensions in East Asia."
    },
    {
      "year": 1973,
      "title": "Ferdinand Marcos Declares Martial Law in the Philippines",
      "description": "President Ferdinand Marcos announces martial law in the Philippines, leading to authoritarian rule.",
      "category": "Political",
      "significance": "Marked the beginning of a period of political repression and dictatorship in the Philippines."
    },
    {
      "year": 2014,
      "title": "U.S. and Cuba Announce Plans to Restore Diplomatic Relations",
      "description": "The U.S. and Cuba announce an agreement to normalize relations after more than 50 years of hostility.",
      "category": "Diplomatic/International Relations",
      "significance": "Signaled a major shift in U.S.-Cuba relations and opened the door for increased cooperation and dialogue."
    }
  ]
}