{
  "date": "September 28",
  "events": [
    {
      "year": 1066,
      "title": "Battle of Stamford Bridge",
      "description": "King Harold Godwinson of England defeated the invading Norwegian forces led by King Harald Hardrada, ending the Viking Age invasions of England.",
      "category": "Military",
      "significance": "Marked the end of Viking invasions in England and paved the way for the Norman Conquest shortly thereafter."
    },
    {
      "year": 1542,
      "title": "Death of Explorer Juan Rodríguez Cabrillo",
      "description": "Juan Rodríguez Cabrillo, the first European to explore the west coast of present-day United States, died after an expedition in California.",
      "category": "Exploration",
      "significance": "His explorations led to early European knowledge of the West Coast of North America."
    },
    {
      "year": 1928,
      "title": "Alexander Fleming Discovers Penicillin",
      "description": "Scottish bacteriologist Alexander Fleming discovered penicillin, the world's first widely effective antibiotic, by observing mold killing bacteria.",
      "category": "Science/Medicine",
      "significance": "Revolutionized medicine and led to the development of antibiotics, saving millions of lives."
    },
    {
      "year": 1978,
      "title": "Pope John Paul I Dies",
      "description": "Pope John Paul I died suddenly after only 33 days as pope, one of the shortest papacies in history.",
      "category": "Religion",
      "significance": "His death led to the election of Pope John Paul II, one of the most influential popes of the 20th century."
    },
    {
      "year": 1995,
      "title": "The Dayton Peace Agreement is initialed",
      "description": "The leaders of Bosnia, Croatia, and Serbia initialed the Dayton Peace Agreement to end the Bosnian War.",
      "category": "Politics/Diplomacy",
      "significance": "Ended a brutal conflict in the Balkans and laid the foundation for peace and reconstruction."
    }
  ]
}