{
  "date": "April 7",
  "plants": [
    {
      "name": "Forsythia × intermedia",
      "commonName": "Forsythia",
      "description": "A deciduous shrub known for its brilliant yellow flowers that often herald the arrival of spring. Forsythia blooms profusely before its leaves emerge, creating a bright splash of color in early April in temperate regions.",
      "bloomingSeason": "Early spring (March to April)",
      "location": "Temperate regions of the Northern Hemisphere, especially Europe, North America, and East Asia",
      "colors": [
        "Yellow"
      ],
      "emoji": "🌼",
      "funFact": "Forsythia is often one of the earliest blooming shrubs in gardens, and its bright yellow flowers are associated with good fortune in some cultures."
    },
    {
      "name": "Magnolia × soulangeana",
      "commonName": "Saucer Magnolia",
      "description": "A large deciduous tree or shrub with spectacular large flowers that can be white, pink, or purple. Saucer Magnolias bloom in early spring before the leaves unfold, creating an impressive floral display that typically peaks in April in mild climates.",
      "bloomingSeason": "Early to mid spring (March to April)",
      "location": "Native to East Asia but widely cultivated in temperate gardens worldwide, especially in North America and Europe",
      "colors": [
        "White",
        "Pink",
        "Purple"
      ],
      "emoji": "🌸",
      "funFact": "Magnolia flowers are ancient; fossil records date back over 95 million years, making them one of the oldest flowering plants."
    },
    {
      "name": "Protea neriifolia",
      "commonName": "Narrow-leaved Sugarbush",
      "description": "An evergreen shrub or small tree that produces large, dramatic flower heads with pink bracts and a central cluster of flowers. Blooming in the Southern Hemisphere's autumn and early winter, Protea neriifolia exhibits peak flowering around April in South Africa.",
      "bloomingSeason": "Autumn to early winter (March to June)",
      "location": "Native to the Western Cape of South Africa",
      "colors": [
        "Pink"
      ],
      "emoji": "🌺",
      "funFact": "Proteas are part of the ancient Gondwanan flora, and their unique flower structure is adapted to pollination by birds and small mammals."
    },
    {
      "name": "Rhododendron arboreum",
      "commonName": "Tree Rhododendron",
      "description": "A large evergreen shrub or small tree with clusters of vibrant red or pink flowers. This species flowers in spring, often around April at higher altitudes in the Himalayas, adding vibrant color to mountainous forest landscapes.",
      "bloomingSeason": "Spring (March to May)",
      "location": "Himalayan region of South Asia, including Nepal, India, and Bhutan",
      "colors": [
        "Red",
        "Pink"
      ],
      "emoji": "🌺",
      "funFact": "Rhododendron arboreum is the national flower of Nepal and is valued for its beauty and medicinal properties."
    }
  ]
}