{
  "date": "April 10",
  "plants": [
    {
      "name": "Magnolia × soulangeana",
      "commonName": "Saucer Magnolia",
      "description": "A beloved ornamental tree known for its large, fragrant, cup-shaped flowers that appear before the leaves in early spring. The blooms are usually pink, white, or purple, creating spectacular displays in temperate regions.",
      "bloomingSeason": "March to April",
      "location": "Temperate regions of North America, Europe, and Asia",
      "colors": [
        "pink",
        "white",
        "purple"
      ],
      "emoji": "🌸",
      "funFact": "Saucer Magnolias bloom on old wood, meaning the flowers appear on last year's growth, often before the leaves."
    },
    {
      "name": "Narcissus pseudonarcissus",
      "commonName": "Wild Daffodil",
      "description": "A spring-flowering bulb native to Europe, producing bright yellow, trumpet-shaped flowers on slender stems. It thrives in woodlands, meadows, and along riverbanks.",
      "bloomingSeason": "March to April",
      "location": "Western and Central Europe",
      "colors": [
        "yellow"
      ],
      "emoji": "💛",
      "funFact": "Wild daffodils are among the first wildflowers to bloom, often forming carpets in ancient woodland areas."
    },
    {
      "name": "Prunus serrulata",
      "commonName": "Japanese Cherry Blossom",
      "description": "Famous for its spectacular, ephemeral pink or white flowers that bloom in early to mid-spring. These ornamental cherries are culturally significant in Japan and other parts of the world.",
      "bloomingSeason": "Late March to mid-April",
      "location": "Japan, Korea, China, and temperate regions worldwide",
      "colors": [
        "pink",
        "white"
      ],
      "emoji": "🌺",
      "funFact": "Cherry blossoms bloom for a very short period, typically lasting only a week or two, symbolizing the fleeting nature of life."
    },
    {
      "name": "Acacia dealbata",
      "commonName": "Silver Wattle or Mimosa",
      "description": "An evergreen shrub or small tree native to southeastern Australia, noted for its fluffy, bright yellow flower clusters that bloom in late winter and early spring.",
      "bloomingSeason": "Late winter to April",
      "location": "Australia (native); cultivated in Mediterranean climates worldwide",
      "colors": [
        "yellow"
      ],
      "emoji": "🌼",
      "funFact": "The bright yellow flowers of Acacia dealbata were traditionally used as a symbol of International Women's Day in some countries."
    }
  ]
}