{
  "date": "April 16",
  "plants": [
    {
      "name": "Magnolia × soulangeana",
      "commonName": "Saucer Magnolia",
      "description": "A popular ornamental tree known for its large, fragrant, and tulip-shaped flowers that appear early in the spring before the leaves. It is often cultivated in temperate regions worldwide.",
      "bloomingSeason": "March to April",
      "location": "Temperate regions of North America, Europe, and Asia",
      "colors": [
        "white",
        "pink",
        "purple"
      ],
      "emoji": "🌸",
      "funFact": "Saucer magnolia flowers are some of the first to bloom in spring, often emerging before the leaves, making their blossoms especially striking."
    },
    {
      "name": "Azalea (Rhododendron spp.)",
      "commonName": "Azalea",
      "description": "Azaleas are flowering shrubs prized for their profuse, bright blooms in the spring. They thrive in acidic soils and are commonly found in gardens and woodland areas.",
      "bloomingSeason": "March to May",
      "location": "Asia, North America, and garden cultivations worldwide",
      "colors": [
        "pink",
        "red",
        "white",
        "purple",
        "orange"
      ],
      "emoji": "🌺",
      "funFact": "Azaleas have been cultivated for centuries and often signify abundance and beauty in traditional Asian cultures."
    },
    {
      "name": "Ocimum basilicum",
      "commonName": "Sweet Basil",
      "description": "An aromatic herb widely cultivated for culinary use. In warm climates, basil produces small white or purple flowers typically in late spring to summer.",
      "bloomingSeason": "April to August",
      "location": "Tropical and subtropical regions worldwide",
      "colors": [
        "white",
        "purple"
      ],
      "emoji": "🌿",
      "funFact": "Sweet basil flowers are edible and sometimes used to make herbal teas, though flowering signals the plant may be less flavorful."
    },
    {
      "name": "Banksia integrifolia",
      "commonName": "Coast Banksia",
      "description": "A tree native to eastern Australia characterized by cylindrical flower spikes composed of hundreds of tiny flowers, which bloom mainly in autumn but can extend into spring in some areas.",
      "bloomingSeason": "March to May (with some regional variation)",
      "location": "Eastern Australia coastal regions",
      "colors": [
        "yellow"
      ],
      "emoji": "🌼",
      "funFact": "Banksia flowers are rich in nectar, attracting birds and insects, and indigenous Australians traditionally used the nectar as a sweet treat."
    }
  ]
}