{
  "date": "April 17",
  "plants": [
    {
      "name": "Corylopsis spicata",
      "commonName": "Spike Winterhazel",
      "description": "A deciduous shrub known for its fragrant, pale yellow, bell-shaped flowers that bloom in early spring before the leaves fully appear. It is native to Japan and thrives in temperate climates.",
      "bloomingSeason": "March to April",
      "location": "Japan, temperate gardens worldwide",
      "colors": [
        "pale yellow"
      ],
      "emoji": "💛",
      "funFact": "Spike Winterhazel flowers produce a pleasant fragrance that attracts early pollinators."
    },
    {
      "name": "Magnolia × soulangeana",
      "commonName": "Saucer Magnolia",
      "description": "A hybrid magnolia famous for its large, showy, cup-shaped flowers ranging from white to pink and purple hues. It blooms in early to mid-spring, often before the leaves emerge, heralding the start of the growing season.",
      "bloomingSeason": "March to April",
      "location": "Native to China, widely cultivated in temperate regions",
      "colors": [
        "white",
        "pink",
        "purple"
      ],
      "emoji": "🌸",
      "funFact": "Magnolia flowers appeared on earth before bees evolved, and are primarily pollinated by beetles."
    },
    {
      "name": "Lupinus texensis",
      "commonName": "Texas Bluebonnet",
      "description": "A wildflower and the state flower of Texas, it produces vibrant blue to purple pea-shaped flowers that bloom in spring, carpeting fields and roadsides.",
      "bloomingSeason": "March to April",
      "location": "South-central United States, mainly Texas",
      "colors": [
        "blue",
        "purple",
        "white"
      ],
      "emoji": "🌿",
      "funFact": "Bluebonnets fix nitrogen in the soil, improving fertility for other plants."
    },
    {
      "name": "Daphne odora",
      "commonName": "Winter Daphne",
      "description": "An evergreen shrub valued for its highly fragrant pinkish-white flowers that bloom in late winter to early spring. Native to China and Japan, it's often grown as an ornamental in mild climates.",
      "bloomingSeason": "February to April",
      "location": "East Asia and cultivated gardens in temperate regions",
      "colors": [
        "pink",
        "white"
      ],
      "emoji": "🌷",
      "funFact": "Daphne odora's fragrance is so strong that it can be detected from several meters away."
    }
  ]
}