{
  "date": "April 25",
  "plants": [
    {
      "name": "Rhododendron ponticum",
      "commonName": "Pontic Rhododendron",
      "description": "An evergreen shrub native to the Caucasus and Black Sea region, producing large clusters of bell-shaped flowers.",
      "bloomingSeason": "April to May",
      "location": "Caucasus region, Europe, and parts of the United Kingdom",
      "colors": [
        "purple",
        "pink",
        "white"
      ],
      "emoji": "🌸",
      "funFact": "Pontic Rhododendron is an invasive species in parts of the UK, covering large areas of heathland and suppressing native plants."
    },
    {
      "name": "Magnolia × soulangeana",
      "commonName": "Saucer Magnolia",
      "description": "A hybrid magnolia shrub or small tree, famous for its large, fragrant cup-shaped flowers that appear before its leaves fully develop.",
      "bloomingSeason": "Early to late April",
      "location": "Cultivated widely in temperate regions, native hybrid from China",
      "colors": [
        "pink",
        "white",
        "purple"
      ],
      "emoji": "🌺",
      "funFact": "Saucer magnolias often bloom heavily even after late frosts, giving a spectacular floral display in early spring."
    },
    {
      "name": "Erythronium americanum",
      "commonName": "Yellow Trout Lily",
      "description": "A spring ephemeral wildflower native to eastern North American woodlands, characterized by nodding yellow flowers and mottled leaves resembling trout patterns.",
      "bloomingSeason": "April to May",
      "location": "Eastern North America",
      "colors": [
        "yellow"
      ],
      "emoji": "🌼",
      "funFact": "Yellow Trout Lily spreads through underground bulbs and can form large colonies, some believed to be hundreds of years old."
    },
    {
      "name": "Acacia pycnantha",
      "commonName": "Golden Wattle",
      "description": "Australia’s national floral emblem, this perennial shrub or small tree produces bright yellow, fluffy spherical flowers in late winter to spring.",
      "bloomingSeason": "June to September in Australia (Southern Hemisphere), but in cultivated subtropical regions like California, blooming can start as early as April.",
      "location": "Native to southeastern Australia; cultivated in subtropical regions worldwide",
      "colors": [
        "yellow"
      ],
      "emoji": "🌻",
      "funFact": "The golden wattle’s bright yellow flowers attract numerous pollinators and have a sweet, honey-like scent."
    }
  ]
}