{
  "date": "April 26",
  "plants": [
    {
      "name": "Magnolia × soulangeana",
      "commonName": "Saucer Magnolia",
      "description": "A hybrid magnolia tree known for its large, fragrant, tulip-shaped flowers that emerge in early spring before the leaves develop.",
      "bloomingSeason": "March to April",
      "location": "Temperate regions of North America, Europe, and Asia",
      "colors": [
        "pink",
        "white",
        "purple"
      ],
      "emoji": "🌸",
      "funFact": "Saucer Magnolia blooms before its leaves appear, creating a spectacular floral display that can last up to two weeks."
    },
    {
      "name": "Lantana camara",
      "commonName": "Lantana",
      "description": "A hardy flowering shrub often used in warm climates as ground cover or ornamental hedges, known for clusters of small, brightly colored flowers.",
      "bloomingSeason": "Late spring to fall (including April in warmer climates)",
      "location": "Tropical and subtropical regions worldwide, including parts of India, Africa, and the southern United States",
      "colors": [
        "yellow",
        "orange",
        "red",
        "pink",
        "purple"
      ],
      "emoji": "🌺",
      "funFact": "Lantana flowers can change colors as they age, attracting a variety of pollinators with different hues throughout their blooming period."
    },
    {
      "name": "Erythronium americanum",
      "commonName": "Yellow Trout Lily",
      "description": "A spring ephemeral wildflower growing in deciduous forests with mottled leaves resembling trout patterns and nodding yellow flowers.",
      "bloomingSeason": "March to May",
      "location": "Eastern North America",
      "colors": [
        "yellow"
      ],
      "emoji": "🌼",
      "funFact": "Yellow Trout Lily often grows in colonies formed by vegetative reproduction and is an indicator of rich, undisturbed woods."
    },
    {
      "name": "Wisteria sinensis",
      "commonName": "Chinese Wisteria",
      "description": "A vigorous, deciduous climbing vine prized for its cascading clusters of fragrant flowers in spring.",
      "bloomingSeason": "April to May",
      "location": "Native to China, widely cultivated in temperate regions including the United States and Europe",
      "colors": [
        "purple",
        "lavender",
        "white"
      ],
      "emoji": "🌿",
      "funFact": "Wisteria can live for over 50 years, and some specimens bloom for more than a month each spring."
    }
  ]
}