{
  "date": "April 27",
  "plants": [
    {
      "name": "Magnolia × soulangeana",
      "commonName": "Saucer Magnolia",
      "description": "A hybrid deciduous magnolia known for its large, tulip-shaped flowers that emerge in early spring before the leaves. It is widely cultivated in temperate regions and admired for its striking pink and white blooms.",
      "bloomingSeason": "Early to mid spring (March to April)",
      "location": "Temperate regions worldwide, native hybrid from Asia",
      "colors": [
        "Pink",
        "White"
      ],
      "emoji": "🌸",
      "funFact": "Saucer magnolias bloom before their leaves appear, creating a spectacular floral display that can be seen in many gardens worldwide in April."
    },
    {
      "name": "Erythrina crista-galli",
      "commonName": "Cockspur Coral Tree",
      "description": "A small to medium-sized tree known for its brilliant red, spiky flowers that attract hummingbirds and other pollinators. It is native to South America and thrives in subtropical to tropical climates.",
      "bloomingSeason": "Spring to early summer (September to December in Southern Hemisphere, March to May in Northern Hemisphere subtropics)",
      "location": "Native to South America; cultivated in subtropical regions globally",
      "colors": [
        "Red"
      ],
      "emoji": "🌺",
      "funFact": "The name 'crista-galli' means rooster's crest in Latin, referring to the shape of the flowers resembling a cock's comb."
    },
    {
      "name": "Narcissus pseudonarcissus",
      "commonName": "Wild Daffodil",
      "description": "A perennial bulbous plant with bright yellow trumpet-shaped flowers, native to Europe. It is one of the earliest signs of spring in woodlands and meadows across temperate regions.",
      "bloomingSeason": "Early to mid spring (March to April)",
      "location": "Native to Western Europe, widely naturalized elsewhere",
      "colors": [
        "Yellow"
      ],
      "emoji": "💛",
      "funFact": "Wild daffodils are toxic due to alkaloids, which protect them from herbivores."
    },
    {
      "name": "Banksia integrifolia",
      "commonName": "Coast Banksia",
      "description": "An Australian native tree that produces cylindrical flower spikes rich in nectar, attracting birds and mammals. It blooms prolifically during autumn and spring, even sometimes extending to summer.",
      "bloomingSeason": "Year-round with peaks in autumn and spring (March to May and October to December)",
      "location": "Eastern Australia coastal regions",
      "colors": [
        "Yellow"
      ],
      "emoji": "🌼",
      "funFact": "Banksias play a crucial role in their ecosystems by providing nectar for many native animals during times of scarce food."
    }
  ]
}