{
  "date": "April 28",
  "plants": [
    {
      "name": "Magnolia × soulangeana",
      "commonName": "Saucer Magnolia",
      "description": "A popular deciduous flowering tree or shrub known for its large, fragrant, tulip-shaped flowers that appear in early spring, often before the leaves fully emerge.",
      "bloomingSeason": "March to April",
      "location": "Temperate regions of North America, Europe, and Asia",
      "colors": [
        "pink",
        "white",
        "purple"
      ],
      "emoji": "🌸",
      "funFact": "Saucer Magnolia flowers can be large enough to fit in the palm of your hand and are often among the earliest big blooms signaling the arrival of spring."
    },
    {
      "name": "Nerium oleander",
      "commonName": "Oleander",
      "description": "An evergreen shrub widely cultivated in warm climates, producing clusters of delicate, funnel-shaped flowers with a sweet scent and glossy, lance-shaped leaves.",
      "bloomingSeason": "April to October",
      "location": "Mediterranean basin, southern United States, and parts of Asia",
      "colors": [
        "pink",
        "red",
        "white",
        "yellow"
      ],
      "emoji": "🌺",
      "funFact": "Despite its beauty, all parts of the oleander plant are highly toxic if ingested, containing cardiac glycosides."
    },
    {
      "name": "Erythrina crista-galli",
      "commonName": "Cockspur Coral Tree",
      "description": "A deciduous tree or shrub native to South America, notable for its bright red, spiky flowers resembling a rooster's comb, attracting hummingbirds and insects.",
      "bloomingSeason": "Late spring to early summer (October to December in Southern Hemisphere)",
      "location": "Argentina, Uruguay, southern Brazil; blooms in late April in some subtropical areas of Northern Hemisphere cultivation",
      "colors": [
        "red"
      ],
      "emoji": "🌺",
      "funFact": "The Cockspur Coral Tree is the national flower of Argentina and Uruguay, cherished for its striking flowers and shade-providing canopy."
    },
    {
      "name": "Anemone coronaria",
      "commonName": "Poppy Anemone",
      "description": "A herbaceous perennial that produces vividly colorful poppy-like flowers atop slender stems, popular both as a garden and wildflower.",
      "bloomingSeason": "March to May",
      "location": "Mediterranean region",
      "colors": [
        "red",
        "blue",
        "purple",
        "white",
        "pink"
      ],
      "emoji": "🌼",
      "funFact": "Anemone coronaria flowers close at night and on cloudy days, opening again with sunlight, a behavior known as nyctinasty."
    }
  ]
}