{
  "date": "March 17",
  "plants": [
    {
      "name": "Narcissus pseudonarcissus",
      "commonName": "Wild Daffodil",
      "description": "A perennial bulbous plant native to Europe, characterized by its bright yellow trumpet-shaped flowers and long, slender leaves. It often signals the arrival of spring in temperate zones.",
      "bloomingSeason": "February to April",
      "location": "Western Europe, especially the United Kingdom, France",
      "colors": [
        "Yellow"
      ],
      "emoji": "🌼",
      "funFact": "Wild daffodils can naturalize in woodlands and meadows, growing in large carpets of yellow in early spring."
    },
    {
      "name": "Camellia japonica",
      "commonName": "Japanese Camellia",
      "description": "An evergreen shrub prized for its large, rose-like flowers. It blooms from late winter to spring with lush, glossy green leaves and flowers in various shades, including pink, red, and white.",
      "bloomingSeason": "January to April",
      "location": "East Asia, widely cultivated in temperate gardens worldwide",
      "colors": [
        "Pink",
        "Red",
        "White"
      ],
      "emoji": "🌺",
      "funFact": "Camellias are related to tea plants and have been cultivated in Asia for centuries for ornamental purposes."
    },
    {
      "name": "Acacia pycnantha",
      "commonName": "Golden Wattle",
      "description": "Australia’s national floral emblem, this small tree produces vibrant yellow, fluffy flower clusters. It blooms in late winter to early spring and is adapted to dry climates.",
      "bloomingSeason": "July to October in Australia (Southern Hemisphere). However, in some subtropical regions, cultivated plants may bloom sporadically around March.",
      "location": "Southeastern Australia",
      "colors": [
        "Yellow"
      ],
      "emoji": "🌻",
      "funFact": "The golden wattle’s flowering period varies geographically; while it naturally blooms in Southern Hemisphere winter to spring, some cultivated specimens in different climates may bloom off-season."
    },
    {
      "name": "Magnolia × soulangeana",
      "commonName": "Saucer Magnolia",
      "description": "A hybrid magnolia notable for its large, tulip-shaped flowers that emerge before the leaves in early spring. Flowers range from white to pink and deep purple.",
      "bloomingSeason": "March to April",
      "location": "Cultivated in temperate regions globally, originally from Asia",
      "colors": [
        "Pink",
        "White",
        "Purple"
      ],
      "emoji": "🌸",
      "funFact": "Magnolia flowers have existed for millions of years, even before bees, and are pollinated by beetles."
    }
  ]
}