{
  "date": "March 18",
  "plants": [
    {
      "name": "Prunus serrulata",
      "commonName": "Japanese Cherry Blossom",
      "description": "A deciduous tree famous for its stunning pale pink to white flowers that bloom profusely, typically heralding the arrival of spring in temperate regions. The blossoms are short-lived but spectacular, creating a breathtaking floral display.",
      "bloomingSeason": "March to April",
      "location": "Japan, East Asia, and temperate regions worldwide",
      "colors": [
        "pink",
        "white"
      ],
      "emoji": "🌸",
      "funFact": "Cherry blossoms symbolize the transient nature of life in Japanese culture, celebrated annually during Hanami festival."
    },
    {
      "name": "Nerium oleander",
      "commonName": "Oleander",
      "description": "An evergreen shrub or small tree with fragrant, funnel-shaped flowers that bloom abundantly in early spring through summer. Oleanders thrive in warm climates and are drought-tolerant, making them popular in Mediterranean and subtropical gardens.",
      "bloomingSeason": "March to October",
      "location": "Mediterranean Basin, Southern United States, and parts of South America",
      "colors": [
        "pink",
        "white",
        "red"
      ],
      "emoji": "🌺",
      "funFact": "Despite its beauty, all parts of the oleander plant are highly toxic if ingested."
    },
    {
      "name": "Erythronium dens-canis",
      "commonName": "Dog's Tooth Violet",
      "description": "A perennial spring wildflower that grows in woodland areas, featuring nodding, delicate flowers with mauve or pink petals and mottled leaves resembling a dog's tooth, hence its name.",
      "bloomingSeason": "March to May",
      "location": "Europe and Western Asia",
      "colors": [
        "pink",
        "purple"
      ],
      "emoji": "💐",
      "funFact": "Erythronium bulbs were sometimes used as a starch substitute in famine times."
    },
    {
      "name": "Acacia dealbata",
      "commonName": "Silver Wattle or Mimosa",
      "description": "A fast-growing tree known for its fluffy, bright yellow flowers that bloom in late winter and early spring. The flowers have a strong fragrance and appear in dense, spherical clusters.",
      "bloomingSeason": "February to March",
      "location": "Australia and cultivated in Mediterranean climates worldwide",
      "colors": [
        "yellow"
      ],
      "emoji": "🌼",
      "funFact": "The bright yellow flowers of Acacia dealbata are celebrated during International Women's Day in many countries, symbolizing respect and appreciation."
    }
  ]
}