{
  "date": "February 1",
  "plants": [
    {
      "name": "Crocus vernus",
      "commonName": "Spring Crocus",
      "description": "A perennial bulbous plant known for its early bright and colorful cup-shaped flowers emerging from the ground often through snow, signaling early spring in temperate climates.",
      "bloomingSeason": "Late winter to early spring (February to April)",
      "location": "Europe and North America (temperate zones)",
      "colors": [
        "purple",
        "yellow",
        "white"
      ],
      "emoji": "🌸",
      "funFact": "Crocuses are among the first flowers to bloom after winter, often poking through late snow, making them a traditional symbol of new beginnings."
    },
    {
      "name": "Mahonia aquifolium",
      "commonName": "Oregon Grape",
      "description": "An evergreen shrub with holly-like leaves and clusters of bright yellow flowers appearing in early spring, providing nectar for early pollinators.",
      "bloomingSeason": "Late winter to early spring (February to March)",
      "location": "Pacific Northwest, USA and Canada",
      "colors": [
        "yellow"
      ],
      "emoji": "🌼",
      "funFact": "Mahonia flowers are an important early nectar source for bees emerging after winter dormancy."
    },
    {
      "name": "Acacia dealbata",
      "commonName": "Mimosa or Silver Wattle",
      "description": "A fast-growing tree known for its fragrant, bright yellow, fluffy flower clusters that bloom in late winter, heralding spring in Mediterranean and subtropical climates.",
      "bloomingSeason": "Late winter (January to March)",
      "location": "Mediterranean Basin, Australia, and subtropical regions",
      "colors": [
        "bright yellow"
      ],
      "emoji": "🌻",
      "funFact": "The yellow blooms of Acacia dealbata are traditionally celebrated in many Mediterranean countries during winter festivals."
    },
    {
      "name": "Winter Jasmine (Jasminum nudiflorum)",
      "commonName": "Winter Jasmine",
      "description": "A deciduous shrub producing bright yellow, trumpet-shaped flowers directly on green arching stems during the winter months when few other plants bloom.",
      "bloomingSeason": "Late winter (January to March)",
      "location": "China and widely cultivated in temperate gardens worldwide",
      "colors": [
        "yellow"
      ],
      "emoji": "🌼",
      "funFact": "Winter Jasmine flowers on bare green stems before leaves appear, making it very distinctive and valuable for winter color in gardens."
    }
  ]
}