{
  "date": "February 8",
  "plants": [
    {
      "name": "Helleborus niger",
      "commonName": "Christmas Rose",
      "description": "A perennial flowering plant known for its striking white to pinkish flowers that bloom in winter and early spring. It thrives in shady woodland gardens and is prized for blooming in cold months.",
      "bloomingSeason": "December to February",
      "location": "Europe (Central and Southern), cultivated in temperate regions worldwide",
      "colors": [
        "white",
        "pink"
      ],
      "emoji": "🌸",
      "funFact": "Despite its common name, the Christmas Rose is not a rose but a member of the buttercup family (Ranunculaceae), and its flowers are said to bloom through the snow."
    },
    {
      "name": "Cattleya labiata",
      "commonName": "Ruby Cattleya Orchid",
      "description": "A vibrant orchid species admired for its large, fragrant magenta flowers with ruffled lips. It blooms in late winter to early spring and is often cultivated in tropical and subtropical climates.",
      "bloomingSeason": "January to March",
      "location": "Brazil (Atlantic Forest) and cultivated globally in greenhouses",
      "colors": [
        "magenta",
        "purple"
      ],
      "emoji": "🌺",
      "funFact": "The genus Cattleya is named after William Cattley, a British horticulturist who first cultivated this orchid in Europe in the 19th century."
    },
    {
      "name": "Acacia baileyana",
      "commonName": "Cootamundra Wattle",
      "description": "An Australian native small tree or shrub that produces fluffy, bright yellow spherical flower heads in late winter. It is popular as an ornamental and is often one of the earliest bloomers signaling the end of winter.",
      "bloomingSeason": "July to August in Australia (Southern Hemisphere, thus blooms in their winter months)",
      "location": "Australia",
      "colors": [
        "yellow"
      ],
      "emoji": "🌼",
      "funFact": "Wattle flowers are Australia's national floral emblem; during February in the Northern Hemisphere, similar wattles in the Southern Hemisphere bloom at this time."
    },
    {
      "name": "Camellia japonica",
      "commonName": "Japanese Camellia",
      "description": "An evergreen shrub that produces large, elegant flowers ranging from white to deep red. It typically blooms in late winter to early spring, adding color to gardens when few other plants flower.",
      "bloomingSeason": "January to March",
      "location": "East Asia (Japan, Korea, China) and widely cultivated in temperate regions worldwide",
      "colors": [
        "white",
        "pink",
        "red"
      ],
      "emoji": "🌺",
      "funFact": "Camellias were highly prized in Victorian England and are also the state flower of Alabama, USA."
    }
  ]
}