{
  "date": "February 11",
  "plants": [
    {
      "name": "Crocus vernus",
      "commonName": "Spring Crocus",
      "description": "A small, early-blooming perennial bulb known for its bright and vibrant flowers that emerge through snow in late winter to early spring, signaling the end of the cold season.",
      "bloomingSeason": "February to April",
      "location": "Temperate regions of Europe and North America (cultivated)",
      "colors": [
        "purple",
        "yellow",
        "white"
      ],
      "emoji": "🌸",
      "funFact": "Crocuses are one of the first flowers to bloom in spring and have been cultivated since ancient times for their beauty and for saffron in related species."
    },
    {
      "name": "Prunus mume",
      "commonName": "Japanese Apricot or Ume Blossom",
      "description": "A deciduous tree producing fragrant, delicate blossoms that appear in late winter, often before its leaves emerge, widely celebrated in East Asian cultures for its beauty and symbolism of resilience.",
      "bloomingSeason": "January to March",
      "location": "East Asia (Japan, China, Korea)",
      "colors": [
        "pink",
        "white"
      ],
      "emoji": "🌺",
      "funFact": "Ume blossoms are often featured in traditional poetry and art symbolizing endurance and hope during the cold winter months."
    },
    {
      "name": "Helleborus niger",
      "commonName": "Christmas Rose",
      "description": "An evergreen perennial that blooms in late winter, producing elegant white flowers that sometimes have a greenish tinge, popular in shade gardens for winter interest.",
      "bloomingSeason": "December to February",
      "location": "European mountainous regions and cultivated in temperate gardens worldwide",
      "colors": [
        "white",
        "green"
      ],
      "emoji": "❄️",
      "funFact": "Despite its common name, it is not a true rose and has been used medicinally in Europe since medieval times."
    },
    {
      "name": "Acacia dealbata",
      "commonName": "Silver Wattle or Mimosa",
      "description": "A fast-growing tree known for its fluffy, bright yellow flowers that bloom profusely in late winter and early spring, widely planted as an ornamental and used in floristry.",
      "bloomingSeason": "January to March",
      "location": "Native to southeastern Australia; cultivated in Mediterranean climates worldwide",
      "colors": [
        "yellow"
      ],
      "emoji": "🌼",
      "funFact": "Its golden flowers are celebrated in the Mimosa Festival in Italy every February, symbolizing female strength and respect."
    }
  ]
}