{
  "date": "February 12",
  "plants": [
    {
      "name": "Crocus vernus",
      "commonName": "Dutch Crocus",
      "description": "A small, early spring flowering bulb that pushes up through late winter snow in many temperate regions. Known for its vivid cup-shaped flowers signaling the end of winter.",
      "bloomingSeason": "February to April",
      "location": "Europe, North America (cultivated)",
      "colors": [
        "purple",
        "yellow",
        "white"
      ],
      "emoji": "🌸",
      "funFact": "Crocus flowers have been used historically to produce saffron, though the true saffron crocus blooms later in autumn."
    },
    {
      "name": "Prunus mume",
      "commonName": "Japanese Apricot or Ume",
      "description": "A species of Asian plum that blooms in late winter, with fragrant blossoms that are a cultural symbol in East Asia, marking the coming of spring.",
      "bloomingSeason": "January to March",
      "location": "East Asia (Japan, China, Korea)",
      "colors": [
        "pink",
        "white"
      ],
      "emoji": "🌺",
      "funFact": "The ume flower is celebrated in Japan with festivals and is considered one of the first signs of spring."
    },
    {
      "name": "Banksia ericifolia",
      "commonName": "Heath-leaved Banksia",
      "description": "A coastal Australian shrub with striking cylindrical flower spikes, important for local wildlife providing nectar during the Australian summer and early autumn months, still flowering in some regions in February.",
      "bloomingSeason": "January to April",
      "location": "Eastern Australia",
      "colors": [
        "orange",
        "red"
      ],
      "emoji": "🌿",
      "funFact": "Banksia flowers are rich nectar sources and play a vital role in Australian ecosystems."
    },
    {
      "name": "Magnolia x soulangeana",
      "commonName": "Saucer Magnolia",
      "description": "A hybrid magnolia notable for its large, tulip-shaped flowers appearing on bare branches in late winter to early spring before the leaves emerge.",
      "bloomingSeason": "February to April",
      "location": "Temperate regions worldwide (cultivated)",
      "colors": [
        "white",
        "pink",
        "purple"
      ],
      "emoji": "🌼",
      "funFact": "Magnolias are ancient flowering plants dating back 95 million years, predating bees; early magnolias were pollinated by beetles."
    }
  ]
}