{
  "date": "February 15",
  "plants": [
    {
      "name": "Helleborus niger",
      "commonName": "Christmas Rose",
      "description": "A shade-loving perennial with striking white flowers that can sometimes bloom from late winter to early spring, including February. It thrives in temperate European gardens.",
      "bloomingSeason": "December to February",
      "location": "Europe",
      "colors": [
        "White",
        "Pink"
      ],
      "emoji": "🌸",
      "funFact": "Despite its name, the Christmas Rose is not a true rose and is known for being toxic if ingested."
    },
    {
      "name": "Crocus vernus",
      "commonName": "Spring Crocus",
      "description": "A popular early-blooming bulbous plant that emerges through the snow, bringing splashes of purple, yellow, or white to gardens and wild meadows in temperate regions.",
      "bloomingSeason": "February to April",
      "location": "Europe and North America",
      "colors": [
        "Purple",
        "Yellow",
        "White"
      ],
      "emoji": "💜",
      "funFact": "Crocuses are among the first flowers to bloom after winter, signaling the coming of spring."
    },
    {
      "name": "Prunus campanulata",
      "commonName": "Taiwan Cherry",
      "description": "This cherry species blooms early in the year, sometimes starting in February, producing stunning clusters of bright pink flowers. It’s native to Taiwan and is cultivated in subtropical and tropical areas.",
      "bloomingSeason": "February to March",
      "location": "Taiwan and subtropical Asia",
      "colors": [
        "Bright Pink"
      ],
      "emoji": "🌸",
      "funFact": "Taiwan Cherry blossoms are celebrated in festivals and are admired for their vibrant color earlier than many other cherry trees."
    },
    {
      "name": "Eremophila maculata",
      "commonName": "Spotted Emu Bush",
      "description": "A drought-tolerant Australian native shrub that blooms in various seasons, including winter months like February, with tubular red, orange, or yellow flowers attractive to birds.",
      "bloomingSeason": "Winter to Spring",
      "location": "Australia",
      "colors": [
        "Red",
        "Orange",
        "Yellow"
      ],
      "emoji": "🌺",
      "funFact": "Eremophila species produce nectar-rich flowers that are important for native pollinators in arid zones."
    }
  ]
}