{
  "date": "February 18",
  "plants": [
    {
      "name": "Crocus sativus",
      "commonName": "Saffron Crocus",
      "description": "The saffron crocus is a small perennial that blooms in late winter to early spring. It is best known for its vibrant purple flowers with striking orange stigmas, which are harvested as the spice saffron.",
      "bloomingSeason": "February to March",
      "location": "Mediterranean region, parts of Western Asia",
      "colors": [
        "purple",
        "orange"
      ],
      "emoji": "🌸",
      "funFact": "Saffron crocus flowers bloom in late winter, often poking through snow, marking one of the earliest signs of spring."
    },
    {
      "name": "Hamamelis virginiana",
      "commonName": "Witch Hazel",
      "description": "A deciduous shrub native to North America, witch hazel produces fragrant yellow to orange spidery flowers during late fall to early winter, often extending into February. It is valued for its astringent extracts.",
      "bloomingSeason": "October to February",
      "location": "Eastern North America",
      "colors": [
        "yellow",
        "orange"
      ],
      "emoji": "🌼",
      "funFact": "Witch hazel flowers bloom when most other trees are bare, providing a rare splash of color in winter woods."
    },
    {
      "name": "Nerium oleander",
      "commonName": "Oleander",
      "description": "An evergreen shrub or small tree known for its clusters of brightly colored, fragrant flowers. Oleanders bloom throughout much of the year in subtropical climates, including February in Mediterranean and parts of Australia.",
      "bloomingSeason": "Year-round in warm climates, including February",
      "location": "Mediterranean, Australia, California",
      "colors": [
        "pink",
        "red",
        "white",
        "yellow"
      ],
      "emoji": "🌺",
      "funFact": "Oleander is highly toxic, but has been widely cultivated as an ornamental plant due to its abundant blooms and drought tolerance."
    },
    {
      "name": "Magnolia × soulangeana",
      "commonName": "Saucer Magnolia",
      "description": "A hybrid magnolia that blooms early in spring with large, fragrant flowers ranging from white to pink and purple. It typically flowers in late winter to early spring in temperate climates.",
      "bloomingSeason": "February to April",
      "location": "Cultivated widely in temperate regions, native to China",
      "colors": [
        "white",
        "pink",
        "purple"
      ],
      "emoji": "🌷",
      "funFact": "Saucer Magnolia flowers appear before its leaves, often signaling the start of spring in many gardens."
    }
  ]
}