{
  "date": "February 19",
  "plants": [
    {
      "name": "Prunus domestica",
      "commonName": "Plum Blossom",
      "description": "Plum blossoms are among the earliest flowering trees in temperate climates, heralding the coming of spring. These flowers have a delicate and fragrant aroma and typically appear before the leaves do, creating striking displays of pink or white petals.",
      "bloomingSeason": "Late winter to early spring (February to March)",
      "location": "Temperate regions of East Asia, including Japan, China, and Korea",
      "colors": [
        "pink",
        "white"
      ],
      "emoji": "🌸",
      "funFact": "Plum blossoms are a symbol of perseverance and hope in East Asian cultures, blooming despite the cold late-winter conditions."
    },
    {
      "name": "Helleborus niger",
      "commonName": "Christmas Rose",
      "description": "The Christmas rose is an evergreen perennial known for its ability to bloom in the depths of winter, often emerging through snow. Its large, cup-shaped flowers are usually white and sometimes tinged with pink or green.",
      "bloomingSeason": "Winter to early spring (December to February)",
      "location": "Mountainous regions of Central and Southern Europe",
      "colors": [
        "white",
        "pink",
        "green"
      ],
      "emoji": "❄️🌺",
      "funFact": "Despite its common name, the Christmas rose often blooms well into February, providing color when most plants are still dormant."
    },
    {
      "name": "Acacia dealbata",
      "commonName": "Silver Wattle or Mimosa",
      "description": "The Silver Wattle is a fast-growing tree noted for its bright yellow, fluffy, ball-shaped flowers that bloom profusely. It is widely planted as an ornamental and valued for its early flowering in late winter.",
      "bloomingSeason": "Late winter to early spring (January to March)",
      "location": "Native to southeastern Australia; cultivated in Mediterranean climates worldwide",
      "colors": [
        "yellow"
      ],
      "emoji": "🌼",
      "funFact": "In many Mediterranean countries, Acacia dealbata is celebrated in February festivals for its cheerful yellow blossoms signaling the end of winter."
    },
    {
      "name": "Narcissus spp.",
      "commonName": "Daffodil",
      "description": "Daffodils are bulbous perennials well known for their trumpet-shaped flowers, which bloom in late winter to early spring. They often appear in gardens, naturalized woodland areas, and fields, signaling spring's arrival.",
      "bloomingSeason": "Late winter to early spring (January to March)",
      "location": "Native to Europe and North Africa; widely cultivated worldwide",
      "colors": [
        "yellow",
        "white"
      ],
      "emoji": "🌼",
      "funFact": "Daffodils contain toxic alkaloids that discourage herbivores, allowing them to bloom early without much disturbance."
    }
  ]
}