{
  "date": "February 24",
  "plants": [
    {
      "name": "Crocus vernus",
      "commonName": "Spring Crocus",
      "description": "A perennial bulbous plant known for signaling the start of spring with its cup-shaped flowers that emerge through late winter snow in temperate regions.",
      "bloomingSeason": "February to April",
      "location": "Native to central and southern Europe, widely cultivated in temperate gardens worldwide",
      "colors": [
        "purple",
        "yellow",
        "white"
      ],
      "emoji": "🌸",
      "funFact": "Crocuses were among the first flowers cultivated by ancient humans and have been used historically as a source of saffron from a related species."
    },
    {
      "name": "Rhododendron ferrugineum",
      "commonName": "Alpenrose",
      "description": "An evergreen shrub that thrives in acidic, alpine soils and produces bright pink to red bell-shaped flowers during late winter to early spring in mountainous regions.",
      "bloomingSeason": "February to May",
      "location": "Alps and Pyrenees mountain ranges of Europe",
      "colors": [
        "pink",
        "red"
      ],
      "emoji": "🌺",
      "funFact": "The Alpenrose is the floral emblem of the Swiss canton of Valais, symbolizing the beauty and resilience of alpine flora."
    },
    {
      "name": "Acacia dealbata",
      "commonName": "Silver Wattle",
      "description": "A fast-growing evergreen tree famous for its fluffy, fragrant yellow flower clusters that brighten late winter landscapes in Mediterranean and subtropical climates.",
      "bloomingSeason": "January to March",
      "location": "Native to southeastern Australia; widely planted in Mediterranean, California, and southern Europe climates",
      "colors": [
        "yellow"
      ],
      "emoji": "🌼",
      "funFact": "The Silver Wattle is celebrated in parts of Europe, such as Italy and France, where its blooming is associated with international women’s day in early March."
    },
    {
      "name": "Camellia japonica",
      "commonName": "Japanese Camellia",
      "description": "An evergreen shrub or small tree with glossy leaves and large, showy flowers blooming in winter to early spring, popular in shaded garden areas of temperate regions.",
      "bloomingSeason": "December to April",
      "location": "Native to Japan, Korea, and China; widely cultivated in temperate gardens worldwide",
      "colors": [
        "red",
        "pink",
        "white"
      ],
      "emoji": "🌺",
      "funFact": "Camellia flowers were historically prized in East Asia not only as ornamental plants but also as symbols of purity and longevity."
    }
  ]
}