{
  "date": "April 1",
  "holidays": [
    {
      "name": "April Fools' Day",
      "description": "The granddaddy of all prank days! A day when people worldwide play practical jokes and hoaxes on friends, family, and colleagues, often resulting in laughter, surprise, and sometimes groans.",
      "origin": "Believed to have started in 16th-century France when the calendar switched from the Julian to the Gregorian system, confusing people about the start of the new year and marking prank days for those unaware of the change.",
      "category": "Pop Culture/Tradition",
      "emoji": "🤡",
      "funFact": "Some major news outlets and companies have historically published elaborate fake stories on this day, including Google's famous 'PigeonRank' prank in 2002."
    },
    {
      "name": "Read a Book Day",
      "description": "A cozy, quiet celebration encouraging everyone to pick up a good book and get lost in its pages, promoting literacy and the joy of reading.",
      "origin": "While the exact origins are unclear, this day has become a peaceful counterbalance to the chaotic pranks of April Fools, inviting introspection and imagination instead.",
      "category": "Awareness/Education",
      "emoji": "📚",
      "funFact": "Some libraries and bookstores offer special events and discounts on this day to inspire readers of all ages."
    },
    {
      "name": "International Fun at Work Day",
      "description": "Celebrate the serious business of having fun at work! This day encourages employees and employers alike to inject humor, games, and lighthearted activities into the office to boost morale and productivity.",
      "origin": "Originated in the early 2000s among corporate culture reformers advocating for more playful, human-centered workplaces.",
      "category": "Workplace Culture",
      "emoji": "🎉",
      "funFact": "Companies that promote fun at work report higher employee satisfaction and even increased creativity!"
    },
    {
      "name": "National Burrito Day (US, sometimes April 1)",
      "description": "A delicious excuse to stuff yourself with all the beans, cheese, meat, and salsa you can handle wrapped tightly in a warm tortilla! While primarily celebrated later in April or early May, some regions unofficially mark April 1 with burrito feasts.",
      "origin": "Created by burrito lovers and food bloggers to celebrate this versatile and beloved Tex-Mex staple.",
      "category": "Food",
      "emoji": "🌯",
      "funFact": "The largest burrito ever made was over a mile long—talk about a wrap party!"
    }
  ]
}