{
  "date": "April 3",
  "holidays": [
    {
      "name": "Find a Rainbow Day",
      "description": "A whimsical day encouraging people to look for rainbows, whether after a spring shower or through a prism. It's a cheerful celebration of color and wonder!",
      "origin": "While its exact origin is unclear, the day has grown in popularity online as a way to spark joy and optimism.",
      "category": "Nature/Celebration",
      "emoji": "🌈",
      "funFact": "Rainbows are actually full circles, but usually we only see an arc due to the ground blocking the rest!"
    },
    {
      "name": "World Party Day",
      "description": "A global event where people are encouraged to throw a party and celebrate joy, unity, and positivity everywhere.",
      "origin": "Conceived by Shashi Sinha in 1997 to create a worldwide day of happiness through parties.",
      "category": "Social/Cultural",
      "emoji": "🎉",
      "funFact": "Since its inception, World Party Day has inspired thousands of parties across over 25 countries simultaneously!"
    },
    {
      "name": "Tweezers Day",
      "description": "A quirky day dedicated to the handy tool we use for plucking and grooming, celebrating its precision and odd history.",
      "origin": "Unclear, but tied to appreciation of this little tool’s usefulness in beauty and science.",
      "category": "Tool Appreciation",
      "emoji": "🔧",
      "funFact": "The first known tweezers date back to 3000 BC and were found in Mesopotamian archeological sites!"
    },
    {
      "name": "National Chocolate Mousse Day",
      "description": "A deliciously decadent day to enjoy the rich, airy French dessert that melts in your mouth and delights your taste buds.",
      "origin": "Celebrated in the United States to honor the classic chocolate mousse dessert.",
      "category": "Food",
      "emoji": "🍫",
      "funFact": "Despite its name meaning 'foam' in French, chocolate mousse was originally both a savory and sweet dish!"
    }
  ]
}