{
  "date": "April 5",
  "holidays": [
    {
      "name": "National Deep Dish Pizza Day",
      "description": "A day to celebrate the cheesy, saucy, and oh-so-thick pizza style that originated in Chicago. Perfect excuse to indulge in a slice or two of this deliciously heavy pie!",
      "origin": "Started by pizza enthusiasts and food bloggers who wanted to honor Chicago’s signature deep-dish style pizza.",
      "category": "Food Holiday",
      "emoji": "🍕",
      "funFact": "The deep dish pizza was invented in 1943 at Pizzeria Uno in Chicago, and the crust is so thick that you can actually eat it with a knife and fork!"
    },
    {
      "name": "Go For Broke Day",
      "description": "A tribute to the Japanese American soldiers in World War II who fought against incredible odds, showing courage and determination with the motto ‘Go For Broke.’",
      "origin": "Established to honor the 442nd Regimental Combat Team, the most decorated unit of its size and length of service in U.S. military history.",
      "category": "Awareness Day / Historical",
      "emoji": "🎖️",
      "funFact": "Despite facing discrimination at home, the 442nd became the most decorated American unit for its size and length of service during WWII."
    },
    {
      "name": "Walk to Work Day",
      "description": "Encouraging people to leave the car behind and enjoy a brisk walk to work, promoting health, environmental consciousness, and a fresh start to the day.",
      "origin": "Started as an urban wellness initiative to reduce traffic congestion and improve physical fitness.",
      "category": "Health & Environment",
      "emoji": "🚶‍♂️",
      "funFact": "Walking to work burns an average of 300 calories and can boost your mood and creativity for the rest of the day!"
    },
    {
      "name": "Be Heard Day",
      "description": "A lively day dedicated to expressing yourself, speaking your mind, and making your voice count in all areas of life.",
      "origin": "Created by communicators and advocates to inspire confident expression and active listening worldwide.",
      "category": "Pop Culture / Awareness",
      "emoji": "🗣️",
      "funFact": "Studies show that people who confidently communicate their ideas are 60% more likely to be promoted at work."
    }
  ]
}