{
  "date": "April 6",
  "holidays": [
    {
      "name": "Tweed Day",
      "description": "A day to celebrate the classic Scottish fabric worn proudly by all manner of folks—from dashing dandies to smart detectives! Don your favorite tweed jacket, cap, or skirt and embrace your inner old-school charm.",
      "origin": "Originating in Scotland, Tweed Day celebrates the heritage and craftsmanship of tweed fabric, often associated with outdoor sports and traditional Scottish attire.",
      "category": "Fashion/Cultural",
      "emoji": "🧥",
      "funFact": "Tweed was originally designed to be durable and water-resistant, making it perfect for hunting and farming in the damp Scottish countryside."
    },
    {
      "name": "New Beer's Eve",
      "description": "Raise a glass! New Beer's Eve is the celebration that happens on the eve of the anniversary of the repeal of Prohibition in the U.S., perfect for craft beer enthusiasts and history buffs alike.",
      "origin": "Commemorates the date in 1933 when the Cullen–Harrison Act went into effect, allowing the sale of beer with low alcohol content, effectively ending Prohibition.",
      "category": "Food & Drink/Historical",
      "emoji": "🍺",
      "funFact": "Many breweries host special events on New Beer's Eve to honor the liberating moment for beer lovers everywhere."
    },
    {
      "name": "Tartan Day",
      "description": "Celebrate Scottish heritage beyond Scotland! Tartan Day honors Scottish culture and its widespread influence, with parades, music, and plenty of kilts and bagpipes.",
      "origin": "Established in 1998 in North America, Tartan Day commemorates the signing of the Declaration of Arbroath in 1320, Scotland's declaration of independence.",
      "category": "Cultural Heritage",
      "emoji": "🏴",
      "funFact": "In addition to Scotland, Tartan Day is celebrated by Scottish descendants around the world, including the U.S., Canada, and Australia."
    },
    {
      "name": "Siblings Day (U.S.)",
      "description": "A fun and quirky observance to honor the unique relationship you have with your siblings—whether they're partners in crime, lifelong friends, or just people who share your DNA!",
      "origin": "Founded in 1995 by Claudia Evart to celebrate the importance of siblings and family bonds.",
      "category": "Family/Relationship",
      "emoji": "👫",
      "funFact": "Siblings Day is not yet a federal holiday but is widely celebrated on social media with hashtags and photos of sibling love."
    }
  ]
}