{
  "date": "April 7",
  "holidays": [
    {
      "name": "World Health Day",
      "description": "A day dedicated to global health awareness, marking the founding of the World Health Organization in 1948. It encourages everyone to focus on health issues and wellness worldwide.",
      "origin": "Established by the World Health Organization in 1948 to commemorate its founding.",
      "category": "Awareness Day",
      "emoji": "🩺",
      "funFact": "Each year, World Health Day focuses on a different health theme, ranging from mental health to climate change's impact on health."
    },
    {
      "name": "No Housework Day",
      "description": "A quirky observance urging everyone to take a break from all domestic chores. It’s a perfect excuse to kick back, relax, and let the dishes pile up!",
      "origin": "Started by a magazine editor in the UK in the 1980s as a way to encourage relaxation and self-care.",
      "category": "Lifestyle/Fun",
      "emoji": "🛋️",
      "funFact": "No Housework Day is celebrated every year on the Saturday after Easter, giving people a break after the busy holiday."
    },
    {
      "name": "National Coffee Cake Day",
      "description": "A sweet celebration dedicated to the deliciously crumbly, cinnamon-swirled coffee cake that pairs perfectly with your morning brew.",
      "origin": "Became popular in the US as a way to honor this beloved breakfast treat.",
      "category": "Food Holiday",
      "emoji": "🍰☕",
      "funFact": "Despite the name, coffee cake doesn’t usually contain coffee; it’s meant to be enjoyed with a cup of coffee!"
    },
    {
      "name": "Festival of Astrology",
      "description": "An unconventional day for astrology enthusiasts to cast horoscopes, share zodiac insights, and celebrate cosmic mysteries.",
      "origin": "Informally embraced by astrology fans around the world, gaining popularity on social media.",
      "category": "Pop Culture/Spiritual",
      "emoji": "♈✨",
      "funFact": "On this day, many astrologers release special forecasts and prediction videos, making it a starry social media hotspot."
    }
  ]
}