{
  "date": "April 10",
  "holidays": [
    {
      "name": "Siblings Day",
      "description": "A day to celebrate the special bond, love, and lifelong support between siblings.",
      "origin": "Created in 1995 by Claudia Evart to honor her siblings who died in a plane crash, it has since gained popularity internationally.",
      "category": "Family & Relationships",
      "emoji": "👫",
      "funFact": "Unlike Mother's or Father's Day, Siblings Day is not yet a federal holiday in the U.S., but millions still celebrate online and in person."
    },
    {
      "name": "National Cinnamon Crescent Day",
      "description": "Celebrate this delicious pastry by savoring warm, flaky, cinnamon-filled crescents—perfect for breakfast or a sweet snack.",
      "origin": "An unofficial food day dedicated to the cinnamon crescent, popular in bakeries around the world.",
      "category": "Food & Drink",
      "emoji": "🥐",
      "funFact": "Cinnamon crescents trace their roots back to European pastries and gained massive popularity in American bakeries in the 20th century."
    },
    {
      "name": "Parker Brothers Day",
      "description": "A day to honor the founders of Parker Brothers, the game company famous for creating Monopoly and many other family-favorite board games.",
      "origin": "Celebrates the birth of George S. Parker (born April 10, 1866), who founded the iconic board game company.",
      "category": "Pop Culture & Games",
      "emoji": "🎲",
      "funFact": "Monopoly was almost called 'The Landlord’s Game' and was designed to teach players about the dangers of monopolies!"
    },
    {
      "name": "Cheer-Up the Lonely Day",
      "description": "A heartwarming day encouraging people to reach out and brighten the day of someone feeling lonely or isolated.",
      "origin": "Started in the 20th century as a compassionate reminder to connect with others and spread kindness.",
      "category": "Social Awareness",
      "emoji": "😊",
      "funFact": "Small acts of kindness on this day can spark long-lasting friendships and brighten entire communities."
    }
  ]
}