{
  "date": "April 11",
  "holidays": [
    {
      "name": "International Tourette Syndrome Awareness Day",
      "description": "A day dedicated to raising awareness and understanding of Tourette Syndrome, a neurological disorder characterized by involuntary tics and vocalizations.",
      "origin": "Established by the Tourette Association of America to foster education and support for those affected.",
      "category": "Awareness Day",
      "emoji": "🤪",
      "funFact": "Despite common misconceptions, people with Tourette's often have control over their tics to some extent and the condition varies widely in severity."
    },
    {
      "name": "National Submarine Day (USA)",
      "description": "Celebrates the launch of the first successful military submarine, the USS Holland, marking a new era in naval warfare and underwater exploration.",
      "origin": "Commemorates the commissioning of USS Holland on April 11, 1900.",
      "category": "Historical / Military",
      "emoji": "🚢",
      "funFact": "The USS Holland could stay submerged for up to 12 hours and traveled at about 6 knots underwater – slow by today’s standards but revolutionary back then!"
    },
    {
      "name": "Pineapple Day",
      "description": "A quirky food holiday dedicated to celebrating the tropical fruit that's as sweet as it is spiky. Enjoy pineapple in all forms!",
      "origin": "Unofficial food day created by pineapple enthusiasts and fruit lovers to honor this delicious wonder.",
      "category": "Food Holiday",
      "emoji": "🍍",
      "funFact": "Pineapples were so rare and expensive in 18th-century Europe that they were rented out as table centerpieces to display wealth and status!"
    },
    {
      "name": "Playing Card Day",
      "description": "A day to appreciate the design, history, and endless games that playing cards bring to the table.",
      "origin": "Originates from the resurgence of interest in traditional card games and their cultural impact worldwide.",
      "category": "Recreational / Pop Culture",
      "emoji": "🃏",
      "funFact": "The four suits in a deck of cards are said to represent the four medieval social classes: hearts (clergy), spades (nobility), diamonds (merchants), and clubs (peasants)."
    }
  ]
}