{
  "date": "April 12",
  "holidays": [
    {
      "name": "Grilled Cheese Sandwich Day",
      "description": "A delicious day dedicated to celebrating the humble grilled cheese sandwich, melty and golden perfection between two slices of bread!",
      "origin": "This tasty holiday has been embraced by cheese lovers and sandwich fans, though its exact origin is unclear, it’s widely celebrated in the US.",
      "category": "Food Holiday",
      "emoji": "🧀🥪",
      "funFact": "April 12th is perfect for grilled cheese because it’s just before the warmer months when people crave light, fresh foods rather than comforting melts!"
    },
    {
      "name": "International Drop Everything and Read Day",
      "description": "A day encouraging everyone to immediately drop what they're doing and read a book, magazine, or anything else!",
      "origin": "Started by book lovers wanting to promote literacy and the joy of reading worldwide.",
      "category": "Awareness Day",
      "emoji": "📚📖",
      "funFact": "The first Drop Everything and Read Day was celebrated in 2001, and many schools use April 12 to boost reading enthusiasm with surprise book breaks."
    },
    {
      "name": "Walk on Stilts Day",
      "description": "Celebrate the quirky art of walking on stilts - try balancing on those tall poles and see the world from a higher perspective!",
      "origin": "Originally a fun folk tradition in Europe, it became a quirky observance in some cultures to challenge balance and coordination.",
      "category": "Quirky Celebration",
      "emoji": "🦿🎪",
      "funFact": "Walking on stilts dates back centuries and was used by marsh dwellers to travel or by performers in circuses – now it’s a playful challenge for all ages."
    },
    {
      "name": "Barbershop Quartet Day",
      "description": "A harmonious homage to the classic four-part singing style by barbershop quartets, known for their close harmonies and catchy tunes.",
      "origin": "This day aligns with past barbershop competitions and is celebrated by enthusiasts of a cappella and vintage music styles.",
      "category": "Music Celebration",
      "emoji": "🎤👔",
      "funFact": "Barbershop quartets became popular in the early 1900s, and their style is so distinctive that it’s recognized as America’s own musical invention."
    }
  ]
}