{
  "date": "April 13",
  "holidays": [
    {
      "name": "Scrabble Day",
      "description": "A celebration of the classic word game Scrabble, where players come together to create words, challenge their vocabulary, and show off their strategic skills.",
      "origin": "Scrabble was invented by Alfred Mosher Butts in 1938, and April 13 honors the game by encouraging everyone to play and appreciate this timeless word puzzle.",
      "category": "Game Day",
      "emoji": "🔤",
      "funFact": "The highest-scoring Scrabble word ever played was 'OXYPHENBUTAZONE,' worth an incredible 1778 points! This day inspires players to find their own high-scoring gems."
    },
    {
      "name": "Thomas Jefferson Day",
      "description": "Honors the third U.S. president Thomas Jefferson, known for his role in drafting the Declaration of Independence and his contributions to American history.",
      "origin": "April 13 is Jefferson's birthday, making it a day to remember his legacy in politics, architecture, and science.",
      "category": "Historical",
      "emoji": "📝",
      "funFact": "Jefferson was not only a president but also an inventor, architect, and avid gardener who designed his estate Monticello almost entirely by himself."
    },
    {
      "name": "Scrabble Day",
      "description": "A day dedicated to the fantastic word game that challenges your vocabulary and wit! Perfect for word nerds and competitive players alike.",
      "origin": "This day celebrates the birthday of Alfred Mosher Butts, the inventor of Scrabble, born on April 13, 1899.",
      "category": "Game/Entertainment",
      "emoji": "🎲",
      "funFact": "The original Scrabble game was called 'Criss-Cross Words' before Butts renamed it to Scrabble, meaning 'to scratch frantically.'"
    },
    {
      "name": "Chicken Cordon Bleu Day",
      "description": "A delicious celebration of the classic dish made of chicken breast wrapped around ham and cheese, then breaded and fried to golden perfection.",
      "origin": "This food holiday appreciates the comfort and sophistication of Chicken Cordon Bleu, a French-inspired dish loved worldwide.",
      "category": "Food",
      "emoji": "🍗🧀",
      "funFact": "Despite its French name, Chicken Cordon Bleu's exact origins are debated, but it became widely popular in the U.S. during the 1960s."
    }
  ]
}