{
  "date": "April 14",
  "holidays": [
    {
      "name": "International Moment of Laughter Day",
      "description": "A day dedicated to stopping whatever you’re doing to share a spontaneous moment of laughter with friends, family, or even strangers. Laughter is the best medicine after all!",
      "origin": "Started in the late 20th century by humor enthusiasts aiming to promote happiness and social bonding.",
      "category": "Wellness & Fun",
      "emoji": "😄",
      "funFact": "Scientists have found that laughter can boost your immune system and reduce stress hormones."
    },
    {
      "name": "Look up at the Sky Day",
      "description": "An observance encouraging everyone to take a break from screens and daily stress by simply looking up and appreciating the sky above, whether it's sunny, cloudy, starry, or stormy.",
      "origin": "Began as a social media movement promoting mindfulness and natural beauty appreciation.",
      "category": "Mindfulness & Nature",
      "emoji": "☁️",
      "funFact": "Looking at the sky can help relax your mind and improve your mood instantly."
    },
    {
      "name": "Pan American Day",
      "description": "Commemorates the first international conference held in 1889 to promote cooperation among countries in the Americas. It celebrates unity, cultural exchange, and friendship across the continents.",
      "origin": "Established by the Pan American Union, the forerunner of the Organization of American States (OAS).",
      "category": "Historical & Cultural",
      "emoji": "🌎",
      "funFact": "Pan American Day is celebrated only in some parts of Central and South America, and even the USA observes Peace Officers Memorial Day on the same date."
    },
    {
      "name": "Ex-Spouse Day",
      "description": "A quirky unofficial holiday reminding people to appreciate the lessons learned from ex-partners — and perhaps send a kind message to those former flames who helped shape their lives.",
      "origin": "Created by online communities poking fun at relationships and encouraging forgiveness and closure.",
      "category": "Relationships & Humor",
      "emoji": "💔",
      "funFact": "Some people use the day to send humorous or sincere messages to their exes; others just take it as a moment of personal reflection."
    }
  ]
}