{
  "date": "April 15",
  "holidays": [
    {
      "name": "National Rubber Eraser Day",
      "description": "A day to celebrate the humble rubber eraser — the unsung hero of all your pencil blunders! Whether you’re fixing a missed note or crafting art, erasers are the magic wands of do-overs.",
      "origin": "Officially recognized in the U.S., this day honors the invention and impact of the rubber eraser, which dates back to the late 18th century.",
      "category": "Fun/Stationery",
      "emoji": "✏️",
      "funFact": "Before rubber erasers, people used bread crumbs to erase pencil marks! Imagine the messiness."
    },
    {
      "name": "Titanic Remembrance Day",
      "description": "An emotional observance to honor the victims and heroes of the RMS Titanic tragedy of 1912, remembered worldwide every April 15 as the ship sank this day after striking an iceberg.",
      "origin": "Commemorates the historical event of the Titanic sinking on April 15, 1912.",
      "category": "Historical/Memorial",
      "emoji": "🛳️",
      "funFact": "The Titanic had only enough lifeboats for about half of the people on board, a fact that led to major changes in maritime safety laws."
    },
    {
      "name": "Glider Pilot’s Day",
      "description": "Celebrating the freedom and serenity of flying silently through the skies, Glider Pilot’s Day honors those who master piloting unpowered aircraft — feel the wind without an engine’s roar!",
      "origin": "Recognizes the achievement of Otto Lilienthal, the 'Glider King,' whose pioneering flights in the late 1800s inspired modern gliding.",
      "category": "Aviation/Sports",
      "emoji": "🪂",
      "funFact": "Gliders can stay airborne for hours by riding thermal updrafts, sometimes covering hundreds of miles!"
    },
    {
      "name": "International HAARP Day",
      "description": "A quirky nod to the High Frequency Active Auroral Research Program (HAARP), often surrounded by conspiracy theories, this day playfully pokes fun at mysterious science experiments involving the ionosphere.",
      "origin": "This unofficial day has grown from internet culture fascination with HAARP since its inception in the 1990s.",
      "category": "Science/Pop Culture",
      "emoji": "🔬",
      "funFact": "Despite wild theories, HAARP’s research primarily focuses on understanding atmospheric phenomena, not controlling weather or minds."
    },
    {
      "name": "National Titanic Remembrance Day",
      "description": "Not to be confused, this day solemnly honors the 1,517 lives lost when the Titanic sank, reminding us of the fragility of technology and human resilience.",
      "origin": "Commemorates the anniversary of the Titanic sinking in 1912.",
      "category": "Historical/Remembrance",
      "emoji": "⚓",
      "funFact": "April 15 is formally recognized in many countries as Titanic Remembrance Day to ensure the tragedy is never forgotten."
    }
  ]
}