{
  "date": "April 19",
  "holidays": [
    {
      "name": "National Garlic Day",
      "description": "A flavorful celebration honoring the pungent, versatile garlic bulb that spices up kitchens worldwide.",
      "origin": "While not an official federal holiday, garlic enthusiasts and cooks across the globe have adopted April 19 to pay tribute to this powerful ingredient.",
      "category": "Food Holiday",
      "emoji": "🧄",
      "funFact": "Garlic has been used for over 7,000 years for its medicinal properties and was believed to ward off evil and vampires!"
    },
    {
      "name": "Earth Day (early observance)",
      "description": "Though Earth Day’s main celebration is April 22, some communities kick off eco-friendly events on April 19, encouraging early environmental awareness and action.",
      "origin": "Inspired by the original 1970 Earth Day to promote environmental protection.",
      "category": "Awareness Day",
      "emoji": "🌍",
      "funFact": "April 19 observances often include tree planting and community cleanups as a warm-up for the big Earth Day."
    },
    {
      "name": "Bicycle Day",
      "description": "Commemorates the first intentional LSD trip taken by Dr. Albert Hofmann, who famously experienced its mind-expanding effects while riding his bicycle home.",
      "origin": "On April 19, 1943, Hofmann ingested LSD and cycled home, marking a milestone in psychedelic history.",
      "category": "Pop Culture/History",
      "emoji": "🚴‍♂️",
      "funFact": "Bicycle Day celebrations often include bike rides and psychedelic art exhibitions honoring drug culture and scientific discovery."
    },
    {
      "name": "National Hanging Out Day",
      "description": "A quirky unofficial holiday encouraging people to literally 'hang out'—whether by lounging around, chilling with friends, or simply relaxing without pressure.",
      "origin": "Created by social media enthusiasts to promote stress relief and social connection.",
      "category": "Fun/Wellness",
      "emoji": "😎",
      "funFact": "Some take National Hanging Out Day to literally hang from monkey bars or hammocks to embrace the holiday’s playful spirit!"
    }
  ]
}