{
  "date": "April 21",
  "holidays": [
    {
      "name": "National Kindergarten Day",
      "description": "A day to celebrate the joy and importance of kindergarten education, recognizing the place where many children take their first steps into formal learning and socialization.",
      "origin": "Created to honor the first public kindergarten established in the United States by Margarethe Schurz in 1856.",
      "category": "Education",
      "emoji": "🎨",
      "funFact": "Kindergarten means 'children's garden' in German, emphasizing the nurturing environment for early childhood development."
    },
    {
      "name": "Silly Day",
      "description": "An unofficial day dedicated to being silly, letting go of inhibitions, and having fun through goofy behavior, jokes, and playful antics.",
      "origin": "Emerges from the human desire to lighten the mood and embrace humor, with no formal founding date.",
      "category": "Fun/Entertainment",
      "emoji": "🤪",
      "funFact": "On Silly Day, some people wear mismatched clothes or speak in silly accents just to spread laughter."
    },
    {
      "name": "Hemingway Day",
      "description": "Honoring the birthday of Ernest Hemingway, this day celebrates the life and works of the iconic American novelist and journalist.",
      "origin": "Commemorates Hemingway’s birth on July 21, but some regions celebrate on different days in April relating to his events or legacy.",
      "category": "Literature",
      "emoji": "📚",
      "funFact": "Hemingway was known for his adventurous lifestyle and won the Nobel Prize in Literature in 1954."
    },
    {
      "name": "Environmental Awareness Day",
      "description": "A day to promote awareness about the environment, encouraging people to take action in protecting nature and promoting sustainability.",
      "origin": "Developed by environmental organizations to inspire proactive attitudes toward planet health.",
      "category": "Awareness",
      "emoji": "🌳",
      "funFact": "Many communities organize tree planting and clean-up activities on this day to make a tangible difference."
    },
    {
      "name": "National Tea Day (UK)",
      "description": "Celebrates the British tradition of tea drinking, honoring all things related to tea—from brewing to sipping with biscuits!",
      "origin": "Started by teaware companies and enthusiasts in the UK to preserve and celebrate tea culture.",
      "category": "Food & Drink",
      "emoji": "🍵",
      "funFact": "Tea is the most consumed beverage worldwide after water, and National Tea Day has events featuring everything from tea tastings to afternoon tea parties."
    }
  ]
}