{
  "date": "April 26",
  "holidays": [
    {
      "name": "National Pretzel Day",
      "description": "A day to celebrate the twisted, salty snack loved by many! Whether soft or crunchy, the pretzel has its fans everywhere.",
      "origin": "Originally promoted by various pretzel companies to celebrate their tasty snack and boost sales in the 20th century.",
      "category": "Food Holiday",
      "emoji": "🥨",
      "funFact": "The distinctive knot shape of the pretzel is said to represent arms folded in prayer, dating back to European monks in the Middle Ages!"
    },
    {
      "name": "International Chernobyl Disaster Remembrance Day",
      "description": "A solemn day to remember the 1986 Chernobyl nuclear disaster and honor the heroes who helped contain the catastrophe.",
      "origin": "Observed by the United Nations since 2016 to raise awareness about the disaster's long-term impact and nuclear safety.",
      "category": "Awareness Day",
      "emoji": "☢️",
      "funFact": "Despite its devastation, the Chernobyl Exclusion Zone has become an unintended wildlife sanctuary with many species thriving without humans."
    },
    {
      "name": "Circle Recognition Day",
      "description": "Celebrate circles in all their glory — from wheels and coins to pizzas and planetary orbits!",
      "origin": "Started by math enthusiasts who love to geek out over the perfect symmetry and endless nature of circles.",
      "category": "Fun/Pop Culture",
      "emoji": "⭕",
      "funFact": "The circle has infinite lines of symmetry but zero vertices — making it the perfect shape for endless fun!"
    },
    {
      "name": "National Kids and Pets Day",
      "description": "A day dedicated to appreciating the special bond between children and their animal companions, celebrating friendship and responsibility.",
      "origin": "Created by animal welfare advocates to promote safe and loving interactions between kids and pets.",
      "category": "Awareness/Fun",
      "emoji": "🐶👦",
      "funFact": "Studies show that kids who grow up with pets develop greater empathy, patience, and self-esteem!"
    }
  ]
}