{
  "date": "April 27",
  "holidays": [
    {
      "name": "National Tell a Story Day",
      "description": "A day dedicated to sharing tales—whether made-up or true! It's the perfect excuse to spin yarns, recount adventures, or make up bedtime stories for friends and family.",
      "origin": "This unofficial holiday encourages creativity and oral tradition, celebrated mainly in English-speaking countries.",
      "category": "Literary/Creative",
      "emoji": "📖",
      "funFact": "The act of storytelling dates back to ancient times and is one of the oldest forms of entertainment and education."
    },
    {
      "name": "International Guide Dog Day",
      "description": "Celebrates the amazing work of guide dogs who assist visually impaired people around the world, highlighting their training, dedication, and the bond they share with their handlers.",
      "origin": "Established by the Guide Dogs for the Blind organization to raise awareness and appreciation for these incredible animals.",
      "category": "Animal Welfare/Awareness",
      "emoji": "🐕‍🦺",
      "funFact": "Guide dogs can answer up to 50 voice commands and obstacles, making them life-changing companions."
    },
    {
      "name": "Shoe Leather Day",
      "description": "Commemorates the wear and tear on shoe leather caused by frequent walking and errands, especially tied to historical stories of political campaigns or social movements requiring lots of foot travel.",
      "origin": "Historically linked to political campaigns where candidates 'wore out their shoe leather' traveling to meet voters.",
      "category": "Historical/Cultural",
      "emoji": "👞",
      "funFact": "The phrase 'wearing out one's shoe leather' is an old idiom meaning to travel extensively on foot."
    },
    {
      "name": "Zipper Day",
      "description": "Marks the anniversary of the day when the modern zipper was first patented, celebrating this often-overlooked invention that keeps our clothes together.",
      "origin": "Honors Gideon Sundback, who improved and patented the zipper design on April 27, 1913.",
      "category": "Invention/Technology",
      "emoji": "🧥",
      "funFact": "Before the zipper, people used buttons, hooks, and laces—imagine struggling with pants without a zipper!"
    }
  ]
}