{
  "date": "April 29",
  "holidays": [
    {
      "name": "International Dance Day",
      "description": "A celebration of dance as an art form, promoting its diversity and universality across cultures.",
      "origin": "Established in 1982 by the International Dance Council (CID) to honor the birth of Jean-Georges Noverre, the creator of modern ballet.",
      "category": "Cultural/Arts",
      "emoji": "💃",
      "funFact": "Each year, a famous dancer or choreographer writes a message for International Dance Day to inspire dancers worldwide."
    },
    {
      "name": "Zipper Day",
      "description": "A playful tribute to the invention of the zipper, highlighting this everyday item's impact on fashion and convenience.",
      "origin": "Commemorates the birthday of Whitcomb L. Judson, who introduced the zipper’s prototype in the late 19th century.",
      "category": "Invention/History",
      "emoji": "🧥",
      "funFact": "The original 'clasp locker' zipper wasn’t very reliable and commercial success really took off only decades later!"
    },
    {
      "name": "National Shrimp Scampi Day",
      "description": "A delicious food holiday celebrating the buttery, garlicky Italian-American shrimp dish beloved by seafood lovers.",
      "origin": "Originated in Italian-American communities and recognized informally by food enthusiasts today.",
      "category": "Food",
      "emoji": "🍤",
      "funFact": "The word ‘scampi’ actually refers to an Italian lobster-like crustacean, but the American dish uses shrimp instead!"
    },
    {
      "name": "Kiss of Love Day",
      "description": "An unofficial day encouraging people to celebrate love publicly and combat moral policing, often involving public displays of affection.",
      "origin": "Started in India around 2014 as a social movement to protest against moral policing and conservative restrictions on public affection.",
      "category": "Social Activism/Pop Culture",
      "emoji": "💋",
      "funFact": "It often sparks lively debates and media attention in countries with strict public decency codes."
    }
  ]
}