{
  "date": "April 30",
  "holidays": [
    {
      "name": "National Honesty Day",
      "description": "A day dedicated to encouraging honesty and straightforward communication, celebrated by telling the truth—even when it's hard!",
      "origin": "Started in 1991 by M. Hirsh Goldberg, a former U.S. Senate reporter, to combat habitual dishonesty in society.",
      "category": "Awareness Day",
      "emoji": "🤥🚫",
      "funFact": "Despite its theme, National Honesty Day originated as a tongue-in-cheek response to April Fool's Day, which is all about tricks and fibs."
    },
    {
      "name": "International Jazz Day",
      "description": "A global celebration of jazz music's rich history and cultural impact, promoting peace and unity through the power of jazz.",
      "origin": "Established in 2011 by UNESCO to highlight jazz's role in dialogue and cooperation among people.",
      "category": "Music Celebration",
      "emoji": "🎷🎶",
      "funFact": "Jazz was once called 'the devil's music' before it became an international symbol of freedom and creativity."
    },
    {
      "name": "Hairball Awareness Day",
      "description": "A quirky day for cat owners to acknowledge the struggles of dealing with those pesky hairballs their feline friends cough up.",
      "origin": "An unofficial internet holiday created by cat lovers to share tips and humorous stories about hairballs.",
      "category": "Pet Awareness / Humor",
      "emoji": "🐱🤢",
      "funFact": "Cats can produce up to 15 hairballs a year, and some cats may even develop 'hairball kits' with special treats to help reduce them."
    },
    {
      "name": "National Bubble Tea Day",
      "description": "A delicious day celebrating bubble tea, the sweet, chewy drink originating from Taiwan, famous for its tapioca pearls.",
      "origin": "Celebrated unofficially by bubble tea fans and shops, with no official origin but gaining popularity worldwide as the drink spread.",
      "category": "Food Holiday",
      "emoji": "🧋",
      "funFact": "The tapioca pearls in bubble tea are sometimes called 'boba,' originating from a Taiwanese slang word meaning 'big breasts,' referring to their round shape."
    }
  ]
}