{
  "date": "January 1",
  "holidays": [
    {
      "name": "Z Day",
      "description": "A quirky celebration dedicated to all things starting with the letter Z—think zebras, zippers, and zen! It's a fun way to kick off the year focusing on the often-overlooked last letter of the alphabet.",
      "origin": "An unofficial holiday created by enthusiasts of alphabet-themed fun, aiming to highlight the uniqueness of 'Z' each year on New Year's Day.",
      "category": "Quirky Alphabet Fun",
      "emoji": "🦓",
      "funFact": "Did you know? The letter Z is the only letter in the English alphabet not used as the first letter of any chemical element."
    },
    {
      "name": "Global Family Day",
      "description": "A peaceful and heartwarming observance encouraging people around the world to come together as one human family and promote kindness and harmony.",
      "origin": "Conceived after the Gulf War in the early 1990s as a hope for a day of global peace and unity on the first day of the year.",
      "category": "Awareness/Peace",
      "emoji": "🌍",
      "funFact": "Despite being celebrated globally, Global Family Day is not universally known, but it serves as a beautiful reminder for worldwide fellowship and compassion."
    },
    {
      "name": "Polar Bear Plunge Day",
      "description": "Adventurous and brave souls dive into freezing cold water pools, lakes, or oceans to celebrate the New Year with a chilly shock and invigorating start.",
      "origin": "Started as a tradition among winter swimmers and later became institutionalized as charity events or dares on New Year's Day in various communities.",
      "category": "Unusual Tradition/Sport",
      "emoji": "🐻‍❄️💦",
      "funFact": "Some polar bear plunges raise millions of dollars for charity, proving freezing your toes off can warm hearts!"
    },
    {
      "name": "Day of Strawberries",
      "description": "A fun and fruity celebration welcoming the first strawberry harvest of the year, with strawberry-themed treats and festivities.",
      "origin": "Started in some agricultural communities as a way to honor and enjoy the arrival of fresh strawberries in early winter climates.",
      "category": "Food Holiday",
      "emoji": "🍓",
      "funFact": "Strawberries are the only fruit with seeds on the outside, and each berry has around 200 seeds!"
    }
  ]
}