{
  "date": "January 2",
  "holidays": [
    {
      "name": "Science Fiction Day",
      "description": "A day to celebrate imaginative worlds, futuristic technology, and the creative minds that explore the possibilities of tomorrow through science fiction.",
      "origin": "Celebrated on the birthday of famed sci-fi author Isaac Asimov (January 2, 1920).",
      "category": "Pop Culture",
      "emoji": "🚀",
      "funFact": "Isaac Asimov wrote or edited over 500 books during his lifetime, shaping much of modern science fiction."
    },
    {
      "name": "Motivation and Inspiration Day",
      "description": "Kickstart your year by finding motivation and inspiration to achieve your goals and dreams!",
      "origin": "An unofficial day recognized by motivational speakers and self-help communities to inspire positivity early in the new year.",
      "category": "Self-Improvement",
      "emoji": "💡",
      "funFact": "Many people set New Year's resolutions on January 1, but January 2 helps keep motivation alive after the initial excitement passes."
    },
    {
      "name": "Buffet Day",
      "description": "A fun holiday celebrating the joy of endless food options laid out in a buffet style — eat as much as you like!",
      "origin": "Unofficial food day honoring the concept of buffets, which became popular in the mid-20th century in the U.S.",
      "category": "Food",
      "emoji": "🍽️",
      "funFact": "The first known buffet originated in Sweden during the 16th century, called 'smörgåsbord,' a spread of cold dishes."
    },
    {
      "name": "Crepe Day",
      "description": "A delightful day to enjoy crepes — thin French pancakes that can be filled with everything from chocolate to cheese!",
      "origin": "Unofficial food holiday inspired by French culinary tradition celebrating crepes.",
      "category": "Food",
      "emoji": "🥞",
      "funFact": "In France, crepes are so beloved that February 2nd is also celebrated as 'La Chandeleur' or Crepe Day, but January 2 offers an early winter treat!"
    }
  ]
}