{
  "date": "January 3",
  "holidays": [
    {
      "name": "Festival of Sleep Day",
      "description": "A perfectly acceptable day dedicated to catching up on all the sleep you missed during the busy holiday season — embrace naps, lazy lounging, and maybe even sleeping in past noon!",
      "origin": "Started by author W. T. Rabe in the 1990s as a humorous way to recognize the universal love of sleep and the need to rest after the holidays.",
      "category": "Fun/Leisure",
      "emoji": "😴",
      "funFact": "The Festival of Sleep Day coincides perfectly with many people's return to work, reminding us that deep rest is a revolutionary form of self-care."
    },
    {
      "name": "Fruitcake Toss Day",
      "description": "A quirky day where people gather to toss their unwanted or infamous holiday fruitcakes as far as possible, turning a traditional doorstopper dessert into a hilarious sport!",
      "origin": "Began as a humorous tradition in Manitou Springs, Colorado, where residents turned the holiday fruitcake excess into an annual event in the 1980s.",
      "category": "Food/Quirky Tradition",
      "emoji": "🎂➡️",
      "funFact": "Some fruitcakes used in these events have flown over 70 feet, demonstrating fruitcake's unexpected density and aerodynamic finesse."
    },
    {
      "name": "Blood Donor Day (India)",
      "description": "A vital observance encouraging people in India to donate blood and save lives, highlighting the importance of voluntary blood donation.",
      "origin": "Established by health organizations in India to promote blood donation awareness and ensure adequate blood supply in hospitals.",
      "category": "Awareness/Health",
      "emoji": "🩸",
      "funFact": "India marks January 3 as Blood Donor Day to capitalize on the fresh resolve many have after New Year’s to make positive life-saving changes."
    },
    {
      "name": "International Mind-Body Wellness Day",
      "description": "A wellness-focused day celebrating holistic health practices that unite mind, body, and spirit — perfect for trying meditation, yoga, or mindful eating!",
      "origin": "Grew from modern holistic health movements emphasizing integrative approaches to well-being, gaining traction in the 2000s.",
      "category": "Health/Wellness",
      "emoji": "🧘‍♂️",
      "funFact": "Practicing mind-body wellness even for 10 minutes on this day can significantly decrease stress hormones according to recent studies."
    }
  ]
}