{
  "date": "January 5",
  "holidays": [
    {
      "name": "National Whipped Cream Day",
      "description": "A delightful day dedicated to celebrating the fluffy, sweet topping that brings joy to pies, hot chocolate, and desserts everywhere.",
      "origin": "Started as a fun promotional day by whipped cream companies, it has become a favorite among dessert lovers.",
      "category": "Food Holiday",
      "emoji": "🍰",
      "funFact": "Did you know that the first can of aerosol whipped cream was invented in 1948 by a dairy company? Now that's some serious innovation for dessert fans!"
    },
    {
      "name": "Bird Day",
      "description": "A day to appreciate and protect our feathered friends, encouraging bird watching and conservation efforts worldwide.",
      "origin": "First observed in 1894, Bird Day was created to promote the protection and appreciation of birds and their habitats.",
      "category": "Environmental Awareness",
      "emoji": "🐦",
      "funFact": "Bird Day predates Earth Day by over 75 years, making it one of the earliest days dedicated to environmental conservation!"
    },
    {
      "name": "National Bird Day",
      "description": "Another avian appreciation day but observed specifically to support bird adoption from shelters and educate on pet bird needs.",
      "origin": "Established in 2002 by the Avian Welfare Coalition to increase awareness of pet birds and avian rescue.",
      "category": "Animal Welfare",
      "emoji": "🦜",
      "funFact": "On National Bird Day, many bird shelters see an increase in adoptions due to heightened awareness and education efforts."
    },
    {
      "name": "Epiphany Eve/ Twelfth Night",
      "description": "The night before Epiphany, celebrated with various cultural traditions marking the end of the Christmas season, often involving parties and unique customs.",
      "origin": "Rooted in Christian tradition, Twelfth Night marks the eve before Epiphany, when the Three Wise Men visited baby Jesus.",
      "category": "Cultural/Religious",
      "emoji": "⭐",
      "funFact": "In some cultures, eating a 'Twelfth Night Cake' with a hidden bean or coin is traditional; whoever finds it becomes 'king' or 'queen' for the night!"
    }
  ]
}