{
  "date": "January 6",
  "holidays": [
    {
      "name": "Epiphany (Three Kings’ Day)",
      "description": "A Christian feast day celebrating the revelation of God incarnate as Jesus Christ, traditionally marking the visit of the Magi to baby Jesus.",
      "origin": "Originates from Christian tradition dating back to the 4th century, especially popular in Spain and Latin America.",
      "category": "Religious/Cultural",
      "emoji": "👑",
      "funFact": "In many cultures, Epiphany is celebrated by baking a 'King Cake' with a hidden figurine; whoever finds it must host the next party!"
    },
    {
      "name": "National Bean Day (USA)",
      "description": "A day to honor and enjoy beans in all their glorious forms—baked, refried, chili, or simply steamed!",
      "origin": "Established in the U.S. to celebrate beans as a nutritious, affordable, and versatile food staple.",
      "category": "Food",
      "emoji": "🍲",
      "funFact": "The world record for the largest serving of baked beans is over 3,000 pounds!"
    },
    {
      "name": "Cuddle Up Day",
      "description": "A cozy day encouraging everyone to snuggle up with a loved one or a pet, perhaps with a good book or a warm blanket.",
      "origin": "Unofficial holiday created to combat winter blues and promote comfort and connection during chilly January days.",
      "category": "Social/Emotional Well-being",
      "emoji": "🤗",
      "funFact": "Scientists say that cuddling releases oxytocin, known as the 'love hormone,' which lowers stress and boosts mood."
    },
    {
      "name": "International War on Clichés Day",
      "description": "A quirky observance encouraging people to stop using tired clichés and instead get creative with their language!",
      "origin": "Created by language enthusiasts and writers frustrated with overused phrases.",
      "category": "Linguistic/Culture",
      "emoji": "🗣️",
      "funFact": "Common clichés like 'think outside the box' actually originated in the 20th century and have become so popular they're easy to misuse!"
    }
  ]
}