{
  "date": "January 8",
  "holidays": [
    {
      "name": "Bubble Bath Day",
      "description": "Celebrate relaxation and the joy of bubbles by indulging in a long, luxurious bubble bath. It’s the perfect excuse to pamper yourself and unwind!",
      "origin": "While no exact origin date is known, Bubble Bath Day emerged as a fun self-care reminder in recent decades, encouraging people to take time out for themselves.",
      "category": "Self-Care/Wellness",
      "emoji": "🛁",
      "funFact": "The modern bubble bath formula was invented in the early 20th century, with liquid bath soaps eventually replacing traditional bar soaps."
    },
    {
      "name": "National English Toffee Day",
      "description": "Sweeten your day by celebrating the rich, buttery delight of English toffee! Crunchy, buttery, and covered in chocolate, it’s a nostalgic treat for many.",
      "origin": "The day highlights the popular candy believed to have originated in England in the early 19th century, with the holiday created by confectionery enthusiasts.",
      "category": "Food",
      "emoji": "🍬",
      "funFact": "Despite its name, English toffee is more popular in the U.S. than in England, where a different type of buttery candy called 'butterscotch' reigns supreme."
    },
    {
      "name": "War on Poverty Day",
      "description": "Reflect on efforts to combat poverty and promote social justice. The day commemorates policies aimed at improving economic conditions since the 1960s.",
      "origin": "Commemorates President Lyndon B. Johnson’s declaration of the 'War on Poverty' in 1964, signaling a major government initiative.",
      "category": "Awareness/Social Issues",
      "emoji": "✊",
      "funFact": "The 'War on Poverty' led to the creation of programs like Medicare, Medicaid, and Head Start, forever changing the American social landscape."
    },
    {
      "name": "Elvis Presley’s Birthday",
      "description": "Fans worldwide celebrate the 'King of Rock and Roll' on his birthday with music, dance, and Elvis-themed parties.",
      "origin": "Commemorates Elvis Aaron Presley, born January 8, 1935, who revolutionized music in the 1950s and beyond.",
      "category": "Pop Culture/Music",
      "emoji": "🎸",
      "funFact": "Elvis was posthumously inducted into multiple music halls of fame and remains one of the best-selling solo music artists of all time."
    }
  ]
}