{
  "date": "January 10",
  "holidays": [
    {
      "name": "Peculiar People Day",
      "description": "A day to celebrate all the delightfully unusual, quirky, and eccentric people who make the world more interesting!",
      "origin": "The day was unofficially started by fans of quirky personalities, encouraging people to embrace their uniqueness.",
      "category": "Quirky / Personality",
      "emoji": "🤪",
      "funFact": "Some peculiar people celebrate by dressing in mismatched clothes and sharing odd but fun stories."
    },
    {
      "name": "Houseplant Appreciation Day",
      "description": "A day dedicated to honoring and pampering your leafy green friends in your home.",
      "origin": "Began in the early 2000s as houseplants became popular for improving indoor air quality and aesthetics.",
      "category": "Nature / Lifestyle",
      "emoji": "🪴",
      "funFact": "People often talk to their houseplants on this day, believing it helps them grow better!"
    },
    {
      "name": "National Bittersweet Chocolate Day",
      "description": "A delicious tribute to bittersweet chocolate lovers, reminding us to savor the perfect balance of sweet and bitter.",
      "origin": "Created by chocolate enthusiasts to celebrate the rich flavor of bittersweet chocolate in baking and treats.",
      "category": "Food / Sweets",
      "emoji": "🍫",
      "funFact": "Bittersweet chocolate contains at least 35% cocoa solids but is often enjoyed at 60% or higher for intense flavor."
    },
    {
      "name": "Flower Sellers Day",
      "description": "Celebrates the hardworking flower vendors and florists who brighten lives with their beautiful bouquets.",
      "origin": "Honors the tradition of flower sellers dating back centuries in various cultures, especially in Europe.",
      "category": "Cultural / Occupation",
      "emoji": "💐",
      "funFact": "In some countries, flower sellers would sing songs or chant to attract customers, turning selling into a performance."
    }
  ]
}