{
  "date": "January 11",
  "holidays": [
    {
      "name": "Learn Your Name in Morse Code Day",
      "description": "A day to tap into the fun of Morse code by learning to spell your name using dots and dashes.",
      "origin": "Celebrated unofficially on January 11 to encourage curiosity and learning about this historic communication method.",
      "category": "Educational / Communication",
      "emoji": "📡",
      "funFact": "Samuel Morse originally developed Morse code in the 1830s to improve long-distance communication, and it was widely used in maritime and military signaling for over a century!"
    },
    {
      "name": "Step in a Puddle and Splash Your Friend Day",
      "description": "A playful excuse to jump into puddles and splatter some water on your unsuspecting pals—good-natured mischief at its best!",
      "origin": "An unofficial, whimsical holiday born from childhood nostalgia and spontaneous puddle-jumping fun during rainy days.",
      "category": "Fun / Play",
      "emoji": "💦",
      "funFact": "Splashing friends in puddles traces back to childhood play worldwide, but no one knows who officially coined the holiday!"
    },
    {
      "name": "Hot Tea Month (Mid-January Focus)",
      "description": "While January is Hot Tea Month generally, January 11 is often cited as the day to savor a perfect cup and experiment with different brews to beat the winter blues.",
      "origin": "An unofficial observance aimed at promoting tea drinking for comfort, health benefits, and cozy moments during winter.",
      "category": "Food & Drink",
      "emoji": "🍵",
      "funFact": "Tea is the second most consumed beverage in the world after water, and January’s chilly weather makes it the perfect reminder to enjoy it hot!"
    },
    {
      "name": "Winnie the Pooh Day",
      "description": "Celebrating the beloved honey-loving bear created by A.A. Milne, whose fictional birthday is January 18, but fans often start the week on January 11 with stories, movies, and honey treats.",
      "origin": "Fans and literary communities honor Winnie the Pooh in January as a tribute to his creation and cultural impact.",
      "category": "Pop Culture / Literature",
      "emoji": "🐻🍯",
      "funFact": "Winnie the Pooh was inspired by a real teddy bear owned by author A.A. Milne’s son, Christopher Robin, who also lent his name to a character in the stories."
    }
  ]
}