{
  "date": "January 12",
  "holidays": [
    {
      "name": "National Curried Chicken Day",
      "description": "A delicious day dedicated to celebrating the spicy, savory, and aromatic delights of curried chicken dishes across the globe.",
      "origin": "While curry has ancient roots in Indian cuisine, this unofficial food holiday emerged in the U.S. to honor the many variations of curried chicken.",
      "category": "Food",
      "emoji": "🍛",
      "funFact": "Did you know that curry powder was actually a British invention inspired by Indian cooking? The term 'curry' comes from the Tamil word 'kari', meaning sauce."
    },
    {
      "name": "Marzipan Day",
      "description": "A sweet celebration honoring the almond-flavored confection known for its firm and moldable texture that’s perfect for making candies and decorations.",
      "origin": "Marzipan originated in the Middle East and has been a favorite European treat since the Middle Ages, especially in Germany and Italy.",
      "category": "Food",
      "emoji": "🍬",
      "funFact": "Marzipan is often sculpted into tiny fruits and animals as edible artwork, especially popular in holiday celebrations!"
    },
    {
      "name": "International Kiss A Ginger Day",
      "description": "A quirky and affectionate day encouraging people to celebrate and embrace those with red hair by giving them a friendly kiss.",
      "origin": "This playful phenomenon started on social media and gained popularity as a way to celebrate redheads and break stereotypes.",
      "category": "Pop Culture",
      "emoji": "💋",
      "funFact": "Redheads have a unique genetic trait, carrying the MC1R gene variant, and make up only 1-2% of the global population."
    },
    {
      "name": "National Glitch Day",
      "description": "A fun nod to those odd computer errors, technological hiccups, and unexpected bugs in software that can be frustrating or hilarious.",
      "origin": "Tech enthusiasts created this day to highlight the quirks and unpredictability of digital glitches.",
      "category": "Technology",
      "emoji": "🖥️",
      "funFact": "The famous ‘Blue Screen of Death’ is one of the most iconic glitches, signaling a critical system error on Windows computers."
    }
  ]
}