{
  "date": "January 13",
  "holidays": [
    {
      "name": "National Sticker Day",
      "description": "A day to celebrate the quirky, colorful, and sometimes hilarious world of stickers! From smiley faces on school notebooks to funky laptop decals, stickers are a fun form of self-expression.",
      "origin": "National Sticker Day originated in the United States to honor the invention of the pressure-sensitive sticker by R. Stanton Avery in 1935.",
      "category": "Pop Culture",
      "emoji": "🏷️",
      "funFact": "The world's most expensive sticker was a rare postage stamp sticker sold for millions at auction!"
    },
    {
      "name": "Make Your Dream Come True Day",
      "description": "An encouraging day to take the leap and chase your wildest dreams, no matter how big or bizarre they might seem.",
      "origin": "This unofficial holiday gained popularity through motivational circles and social media, inspiring people to act on their ambitions every January 13.",
      "category": "Motivational",
      "emoji": "🌠",
      "funFact": "Studies show that people who write down their goals are 42% more likely to achieve them!"
    },
    {
      "name": "Rubber Duckie Day",
      "description": "Celebrate the iconic bathtub buddy—the rubber duckie! Known for its bright yellow color and cheerful squeak, this little toy has become a pop culture icon.",
      "origin": "Though no official founding date, rubber duckies became widely popular in the 1940s and 1950s and this day commemorates their joyous presence in bath time fun.",
      "category": "Pop Culture / Toy Holiday",
      "emoji": "🦆",
      "funFact": "Rubber ducks are sometimes used in scientific research to study ocean currents when they are accidentally released into the sea during shipping mishaps!"
    },
    {
      "name": "Kiss a Ginger Day",
      "description": "A playful and affectionate day encouraging people to show love and appreciation to redheads, who are often underrepresented in pop culture and folklore.",
      "origin": "This lighthearted unofficial day emerged from internet memes and social media communities celebrating red-haired individuals.",
      "category": "Pop Culture / Fun",
      "emoji": "❤️‍🔥",
      "funFact": "Red hair is caused by a mutation in the MC1R gene, which is recessive—making natural redheads only about 1-2% of the world population!"
    }
  ]
}