{
  "date": "January 15",
  "holidays": [
    {
      "name": "Hat Day",
      "description": "A day to don your quirkiest, funniest, or fanciest hat and show it off to the world! Whether it's a top hat, a beanie with a pompom, or something completely bizarre, today is your excuse to top off your outfit with flair.",
      "origin": "Hat Day gained popularity as a whimsical celebration encouraging people to have fun with their headwear, often organized by communities and hat enthusiasts worldwide.",
      "category": "Fashion/Fun",
      "emoji": "🎩",
      "funFact": "In the Victorian era, hats were so important that a well-chosen hat could instantly reveal a person's social status!"
    },
    {
      "name": "Strawberry Ice Cream Day",
      "description": "Celebrate the sweet, creamy delight of strawberry ice cream today! Whether you prefer scoops in a cone or swirls in a sundae, this day honors one of the most beloved ice cream flavors ever.",
      "origin": "Ice cream lovers created this unofficial holiday to honor their favorite fruity flavor, especially popular in the United States during winter as a cheerful treat.",
      "category": "Food",
      "emoji": "🍓🍦",
      "funFact": "The first strawberry ice cream recipe dates back to 1744 and was featured in French culinary texts!"
    },
    {
      "name": "Bean Day",
      "description": "A quirky celebration dedicated to beans of all kinds! From baked beans to green beans, this holiday highlights the humble legume and its importance in cuisines around the world.",
      "origin": "Bean Day was established by the National Bean Advocate to promote eating beans for their health and environmental benefits.",
      "category": "Food/Health",
      "emoji": "🫘",
      "funFact": "Beans are one of the oldest cultivated plants and can fix nitrogen in the soil, making them great for sustainable farming!"
    },
    {
      "name": "National Appreciate a Dragon Day",
      "description": "A whimsical day to celebrate dragons, those mythical, fire-breathing creatures that have captured human imagination for centuries. Dress up, read dragon tales, or watch dragon-themed movies!",
      "origin": "This unofficial modern holiday was created by fantasy fans to honor dragons in popular culture and folklore.",
      "category": "Pop Culture/Fantasy",
      "emoji": "🐉",
      "funFact": "Dragons appear in the myths of over 50 different cultures worldwide, each with their own unique twist!"
    }
  ]
}