{
  "date": "January 16",
  "holidays": [
    {
      "name": "Figure It Out Day",
      "description": "A day dedicated to puzzling through problems, riddles, and mysteries! It encourages people to use their detective skills and enjoy brain-teasing challenges.",
      "origin": "The exact origin is unclear, but it's believed to have started as a fun, informal observance encouraging curiosity and problem-solving at the start of the new year.",
      "category": "Fun and Games",
      "emoji": "🕵️‍♂️",
      "funFact": "Some people celebrate by solving a new puzzle or brain teaser every January 16 to kickstart their year with mental clarity!"
    },
    {
      "name": "Nothing Day",
      "description": "A day to do absolutely nothing — no celebrations, no special events, just a pause to relax and enjoy the absence of obligations.",
      "origin": "Proposed in 1973 by columnist Harold Pullman Coffin to create a day free from any observances and distractions.",
      "category": "Lifestyle & Relaxation",
      "emoji": "😌",
      "funFact": "Nothing Day is the only unofficial holiday that promotes doing... literally nothing, inspiring a guilt-free day of doing zilch!"
    },
    {
      "name": "National Fig Newton Day",
      "description": "Celebrate this iconic cookie filled with sweet fig paste, a beloved treat that’s been enjoyed for over a century.",
      "origin": "Commemorates the anniversary of the Fig Newton cookie's patent, invented in Newton, Massachusetts in the late 1800s by the Kennedy Biscuit Company.",
      "category": "Food",
      "emoji": "🍪",
      "funFact": "The Fig Newton was named after Newton, Massachusetts — but Americans mostly just think of it as the delicious fig-filled cookie!"
    },
    {
      "name": "Religious Freedom Day (USA)",
      "description": "Marks the day the Virginia Statute for Religious Freedom was enacted in 1786, guaranteeing freedom of religion and influencing the First Amendment.",
      "origin": "Established by the Commonwealth of Virginia and later recognized nationally to honor Thomas Jefferson’s contribution to religious liberty.",
      "category": "Historical & Social",
      "emoji": "🕊️",
      "funFact": "The Virginia Statute for Religious Freedom was a groundbreaking law that inspired religious rights protections worldwide!"
    }
  ]
}