{
  "date": "January 19",
  "holidays": [
    {
      "name": "National Popcorn Day",
      "description": "A day to celebrate the crunchy, buttery, and oh-so-delicious popcorn – the ultimate movie snack! Grab a bowl and snack away!",
      "origin": "The exact origin is unknown, but popcorn has been a popular snack since the early 1900s in the United States, and this day was created to honor it.",
      "category": "Food Holiday",
      "emoji": "🍿",
      "funFact": "Popcorn kernels can pop up to 3 feet in the air due to the pressure inside the kernel heating up!"
    },
    {
      "name": "Rubik’s Cube Day",
      "description": "Celebrate the invention of the iconic 3D puzzle that has baffled and entertained millions worldwide! It’s a day to twist, turn, and maybe finally solve that stubborn cube.",
      "origin": "Commemorates the birthday of Ernő Rubik, the Hungarian architect and inventor of the Rubik’s Cube, born January 19, 1944.",
      "category": "Pop Culture Celebration",
      "emoji": "🧩",
      "funFact": "Despite 43 quintillion possible configurations, any Rubik’s Cube can be solved in 20 moves or less—the ‘God’s Number.’"
    },
    {
      "name": "Citizen’s Day (South Africa)",
      "description": "A day dedicated to celebrating active citizenship and encouraging all South Africans to contribute positively to their communities and country.",
      "origin": "Established to promote civic responsibility and awareness among South African citizens.",
      "category": "Awareness Day",
      "emoji": "🌍",
      "funFact": "Citizen’s Day in South Africa includes community clean-ups, volunteering, and educational activities to strengthen social bonds."
    },
    {
      "name": "National Popover Day",
      "description": "Shine a spotlight on the tall, hollow, and delightfully airy popover—a quirky cousin to the Yorkshire pudding enjoyed with butter and jam or savory fillings.",
      "origin": "Popovers have been a part of American cuisine since colonial times, and this day celebrates this unique baked treat.",
      "category": "Food Holiday",
      "emoji": "🥐",
      "funFact": "Popovers 'pop over' the edges of the pan as they bake, creating their signature puffy shape!"
    }
  ]
}