{
  "date": "January 23",
  "holidays": [
    {
      "name": "National Handwriting Day",
      "description": "A day to celebrate the personal touch and art of handwriting in an increasingly digital world. People are encouraged to put pen to paper and appreciate their unique script.",
      "origin": "Established in 1977 by the Writing Instrument Manufacturers Association to promote the use of pens and pencils.",
      "category": "Awareness Day",
      "emoji": "✍️",
      "funFact": "The date was chosen because it’s the birthday of John Hancock, famous for his flamboyant signature on the U.S. Declaration of Independence."
    },
    {
      "name": "Measure Your Feet Day",
      "description": "An odd but useful day dedicated to encouraging people to actually measure their feet to ensure proper shoe sizing, preventing blisters and discomfort.",
      "origin": "Unofficial observance that surfaced online as a quirky reminder to check shoe sizes, especially after holiday shopping.",
      "category": "Quirky Holiday",
      "emoji": "👣",
      "funFact": "Studies show that many adults wear improper shoe sizes; this day helps people avoid common foot problems!"
    },
    {
      "name": "Pie Day (U.S.)",
      "description": "Not to be confused with Pi Day in March, this day celebrates the deliciousness of pies in all shapes, sizes, and flavors – sweet or savory!",
      "origin": "Unofficial food holiday that encourages baking and enjoying pie to beat the winter blues.",
      "category": "Food Holiday",
      "emoji": "🥧",
      "funFact": "Some pie bakers claim a good pie can fix just about anything — especially on a cold winter day."
    },
    {
      "name": "National Compliment Day",
      "description": "A day intended to spread kindness and make people smile by giving sincere compliments to friends, strangers, and even yourself.",
      "origin": "Started on social media in the early 2000s to promote positivity and improve mental well-being through simple acts of kindness.",
      "category": "Awareness Day",
      "emoji": "😊",
      "funFact": "A genuine compliment can boost someone’s mood for hours – try complimenting a stranger today!"
    }
  ]
}