{
  "date": "January 25",
  "holidays": [
    {
      "name": "Opposite Day",
      "description": "A day to do everything backwards or oppositely — say the opposite of what you mean, wear your clothes inside out, or just flip your usual routine upside down!",
      "origin": "The exact origin is unclear, but it emerged as a playful concept in American culture, popularized by schools and children in the mid-20th century.",
      "category": "Fun/Playful",
      "emoji": "🔄",
      "funFact": "Despite being unofficial and a bit confusing, many schools celebrate Opposite Day annually as a way to spark creativity and silliness."
    },
    {
      "name": "National Irish Coffee Day",
      "description": "A day to celebrate the iconic cocktail made with hot coffee, Irish whiskey, sugar, and topped with cream. A perfect cozy drink to warm up January!",
      "origin": "Irish Coffee was first made in the 1940s by Joe Sheridan at Foynes Airport in Ireland to warm up cold travelers.",
      "category": "Food & Drink",
      "emoji": "☕️",
      "funFact": "Irish Coffee was declared an 'Official Irish Cocktail' by the Irish government, and the original recipe is still closely guarded."
    },
    {
      "name": "Burns Night (Scottish celebration)",
      "description": "Celebrating the life and poetry of Scotland's national poet Robert Burns, usually with haggis, whisky, and recitals of his famous works.",
      "origin": "Commemorates Robert Burns’ birthday (born January 25, 1759), widely celebrated in Scotland and worldwide by Scottish communities.",
      "category": "Cultural/Literary",
      "emoji": "🥃",
      "funFact": "Burns suppers traditionally include a ceremonial \"Address to the Haggis\" and the drinking of Scotch whisky amid recitations."
    },
    {
      "name": "National Fun at Work Day",
      "description": "Encourages workers to enjoy a little levity during their workday — games, jokes, and any fun activity that breaks up the monotony!",
      "origin": "Created to promote a positive work environment and stress reduction.",
      "category": "Workplace/Wellness",
      "emoji": "🎉",
      "funFact": "Some companies hold elaborate celebrations, including costume contests or silly awards, to mark the day."
    }
  ]
}