{
  "date": "January 26",
  "holidays": [
    {
      "name": "Spouse's Day",
      "description": "A day to appreciate, love, and thank your spouse for putting up with you, and to celebrate your unique partnership.",
      "origin": "Started to encourage married couples to take a moment to acknowledge their significant other and the commitment they share.",
      "category": "Relationship Appreciation",
      "emoji": "❤️",
      "funFact": "Spouse's Day is unofficial, but many couples use it as an excuse to spoil each other with silly gifts and surprise dates."
    },
    {
      "name": "Opposite Day",
      "description": "A quirky day when everything you say or do is taken in reverse meaning: yes means no, up means down, and left means right!",
      "origin": "A playful invention by children that has grown into a weird cultural phenomenon across schools and social circles.",
      "category": "Fun/Playful Tradition",
      "emoji": "🔄",
      "funFact": "Philosophers have jokingly pondered if Opposite Day creates paradoxes—like if you say 'Opposite Day is today' on Opposite Day, is it really?!"
    },
    {
      "name": "Potato Day",
      "description": "A day to honor and celebrate the humble potato, one of the world’s most versatile and beloved foods.",
      "origin": "Observed by many regions that rely heavily on potatoes as a staple crop, it’s become a fun culinary holiday worldwide.",
      "category": "Food Holiday",
      "emoji": "🥔",
      "funFact": "The world's largest potato weighed over 11 pounds—about as much as a small bowling ball!"
    },
    {
      "name": "Australia Day",
      "description": "National day of Australia celebrating the arrival of the First Fleet at Sydney Cove in 1788. Marked by festivities, citizenship ceremonies, and sometimes debate.",
      "origin": "Commemorates the establishment of the first British colony in Australia and is both a celebration and a day of reflection on its history.",
      "category": "National Holiday",
      "emoji": "🇦🇺",
      "funFact": "Australia Day is celebrated with 'barbie' (barbecue) gatherings where locals grill everything from sausages to kangaroo meat!"
    }
  ]
}