{
  "date": "January 27",
  "holidays": [
    {
      "name": "Chocolate Cake Day",
      "description": "A sweet excuse to indulge in one of the most beloved desserts: chocolate cake! On this day, people celebrate by baking and eating chocolate cake in all its delicious forms.",
      "origin": "Chocolate Cake Day is an unofficial holiday that likely originated from the popular love for chocolate and cake, celebrating this irresistible combo.",
      "category": "Food Holiday",
      "emoji": "🍰",
      "funFact": "The world's largest chocolate cake weighed over 12,770 pounds and was made in 2004!"
    },
    {
      "name": "International Holocaust Remembrance Day",
      "description": "A solemn day dedicated to remembering the victims of the Holocaust and promoting education to prevent future genocides.",
      "origin": "Established by the United Nations in 2005 to honor the victims of the Holocaust and to encourage tolerance and human rights education.",
      "category": "Awareness Day",
      "emoji": "🕯️",
      "funFact": "January 27 was chosen because it marks the liberation of Auschwitz concentration camp in 1945."
    },
    {
      "name": "National Geographic Day",
      "description": "Celebrates the founding of National Geographic magazine and its contributions to science, exploration, and education.",
      "origin": "National Geographic magazine was first published on January 27, 1888, inspiring curiosity about the world since then.",
      "category": "Pop Culture / Education",
      "emoji": "🌍",
      "funFact": "National Geographic’s iconic yellow border was designed to make maps and photos instantly recognizable."
    },
    {
      "name": "Comet Naming Day",
      "description": "A quirky, unofficial day to appreciate comets and the quirky tradition of how they’re named after their discoverers.",
      "origin": "Comet Naming Day is an informal celebration among astronomy fans to recognize new comet discoveries and the astronomers behind them.",
      "category": "Science / Astronomy",
      "emoji": "☄️",
      "funFact": "Comets often have long names like 'C/2023 A3 (Tsuchinshan–ATLAS)', named after the telescopes or observatories that found them."
    }
  ]
}