{
  "date": "January 28",
  "holidays": [
    {
      "name": "Data Privacy Day",
      "description": "A day to raise awareness about the importance of protecting personal data and maintaining online privacy in our digital age.",
      "origin": "Established in 2007 by the Council of Europe and supported by the US and Canada to promote privacy and data protection best practices.",
      "category": "Awareness Day",
      "emoji": "🔒",
      "funFact": "Despite the serious theme, some companies celebrate by making humorous 'privacy policy' videos to engage users!"
    },
    {
      "name": "Fun at Work Day",
      "description": "Encourages people to bring more fun and laughter into their workplace to boost morale and productivity.",
      "origin": "An unofficial holiday created by career coaches and human resource enthusiasts who believe work should be enjoyable.",
      "category": "Workplace Celebration",
      "emoji": "🎉",
      "funFact": "Some offices celebrate by wearing silly hats or hosting impromptu dance contests to shake off the midwinter blues."
    },
    {
      "name": "National Kazoo Day",
      "description": "A quirky celebration of the humble kazoo, the buzzing, buzzing musical instrument that anyone can play.",
      "origin": "Started by kazoo enthusiasts and musical oddities fans to showcase fun, informal music.",
      "category": "Music/Instrument Day",
      "emoji": "🎶",
      "funFact": "During National Kazoo Day, some communities try to create the largest kazoo ensemble for a buzzing world record!"
    },
    {
      "name": "International Puzzle Day",
      "description": "A celebration of all kinds of puzzles — crosswords, jigsaws, Sudoku, logic puzzles — designed to keep our brains sharp and entertained.",
      "origin": "Began in the early 2000s, championed by puzzle magazines and enthusiasts worldwide.",
      "category": "Hobby/Brain Games",
      "emoji": "🧩",
      "funFact": "On this day, some puzzle clubs hold competitions to see who can complete the trickiest puzzle fastest."
    }
  ]
}