{
  "date": "January 29",
  "holidays": [
    {
      "name": "National Puzzle Day",
      "description": "A day to embrace the love of puzzles — whether jigsaw, crossword, sudoku, or brain teasers! It’s all about challenging your mind and having fun with problem-solving.",
      "origin": "Created in 2002 by Jodi Jill, a puzzle enthusiast who wanted to celebrate the joy and benefits of puzzles.",
      "category": "Awareness & Entertainment",
      "emoji": "🧩",
      "funFact": "Studies show that regularly doing puzzles can actually help delay cognitive decline as we age!"
    },
    {
      "name": "Cornchip Day",
      "description": "A quirky food holiday celebrating the humble corn chip — those crunchy, salty snacks that make any dip more delicious.",
      "origin": "Not officially declared by any major organization; likely started by snack lovers and food bloggers.",
      "category": "Food",
      "emoji": "🌽",
      "funFact": "The first corn chips were popularized in the 1930s by the Fritos brand, making them a tasty American snack staple."
    },
    {
      "name": "Blame Someone Else Day",
      "description": "A funny, unofficial holiday where you get to shift the blame for something — just for fun! It’s all about lighthearted scapegoating and having a laugh.",
      "origin": "Thought to have started in the 1980s as a tongue-in-cheek response to everyday frustrations, encouraging humor rather than actual blame.",
      "category": "Humor & Fun",
      "emoji": "🤷‍♂️",
      "funFact": "On this day, people jokingly blame everything from spilled coffee to missed appointments on imaginary culprits — even their pets!"
    },
    {
      "name": "Data Privacy Day (International)",
      "description": "A day to raise awareness about the importance of protecting personal information and digital privacy in the age of the internet.",
      "origin": "Originated in Europe in 2007 as Data Protection Day, marking the Jan 28, 1981 signing of Convention 108, but observed internationally on Jan 28-29.",
      "category": "Awareness & Tech",
      "emoji": "🛡️",
      "funFact": "Organizations use this day to launch new privacy tools and educate users about keeping their data safe online."
    }
  ]
}