{
  "date": "January 31",
  "holidays": [
    {
      "name": "Inspire Your Heart with Art Day",
      "description": "A day to appreciate all forms of art and let creativity warm your soul.",
      "origin": "Started by the nonprofit organization Customs House in Australia to encourage people to reflect on the impact of art in our lives.",
      "category": "Art & Culture",
      "emoji": "🎨",
      "funFact": "This day was created in 2004 and pushes people to visit galleries or create their own art for emotional inspiration."
    },
    {
      "name": "Hot Chocolate Day",
      "description": "Celebrate the cozy, chocolaty goodness of hot chocolate to beat the January chill.",
      "origin": "An informal food holiday celebrated mainly in the U.S. during the cold winter months to enjoy this soothing drink.",
      "category": "Food & Drink",
      "emoji": "☕️",
      "funFact": "The Aztecs were among the first to drink a chilly version of hot chocolate, often spiced up with chili peppers!"
    },
    {
      "name": "Backwards Day",
      "description": "A quirky observance where people do things backward — wear clothes inside out, say goodbye instead of hello, or walk backward!",
      "origin": "Created in 1998 by a man named Clarence Shulock to bring silliness and fun to everyday life.",
      "category": "Fun & Games",
      "emoji": "🔄",
      "funFact": "Some schools participate by having students write backward or speak in reverse sentences on this day."
    },
    {
      "name": "Blame Someone Else Day",
      "description": "A tongue-in-cheek holiday encouraging people to pass the blame and have a laugh instead of stressing out about mistakes.",
      "origin": "Invented in 1982 by Dale and Laura Dowling after the January blues as a humorous way to shift responsibility temporarily.",
      "category": "Humor & Satire",
      "emoji": "🤷",
      "funFact": "This day is unofficial but beloved by pranksters and office workers everywhere looking for a lighthearted excuse."
    }
  ]
}