{
  "date": "July 1",
  "holidays": [
    {
      "name": "International Joke Day",
      "description": "A day dedicated to sharing laughter and telling your best jokes to friends, family, and coworkers. It's an opportunity to brighten someone's day with humor and wit.",
      "origin": "While the exact origin is unclear, International Joke Day has been celebrated informally online and among humor enthusiasts to encourage joy and lightheartedness worldwide.",
      "category": "Humor & Fun",
      "emoji": "😂",
      "funFact": "The best jokes on International Joke Day often come from unexpected places—like dad jokes! Perfect day to break out your punniest lines."
    },
    {
      "name": "World UFO Day",
      "description": "Celebrates the existence and sightings of Unidentified Flying Objects. Fans of extraterrestrial life gather to share stories, watch sci-fi movies, and keep an eye on the skies.",
      "origin": "Created by enthusiasts to raise awareness about UFOs and promote research into alien life, this day encourages open-mindedness about the universe's mysteries.",
      "category": "Pop Culture & Science",
      "emoji": "🛸",
      "funFact": "July 1 was chosen because some believe an alleged UFO incident happened on this day in 1947 at Roswell, New Mexico."
    },
    {
      "name": "Creative Ice Cream Flavors Day",
      "description": "A delicious celebration that encourages ice cream lovers and makers to invent and enjoy the weirdest, wildest, and most creative ice cream flavors imaginable.",
      "origin": "This unofficial food holiday arose from the ice cream industry's love of innovation and consumers' desire for unique tastes and experiences.",
      "category": "Food & Culinary",
      "emoji": "🍦",
      "funFact": "Some creative ice cream flavors include bacon, wasabi, and even garlic — dare to try one today?"
    },
    {
      "name": "Canada Day",
      "description": "Canada’s national day commemorating the confederation of the country on July 1, 1867. Festivities include fireworks, parades, and maple-flavored treats!",
      "origin": "Marks the joining of three colonies into one nation called Canada, celebrating unity and cultural heritage.",
      "category": "National Holiday",
      "emoji": "🍁",
      "funFact": "Canada Day celebrations are so big that they often include canoe races, traditional music, and even the ‘largest pancake breakfast’ events."
    }
  ]
}