{
  "date": "July 3",
  "holidays": [
    {
      "name": "International Plastic Bag Free Day",
      "description": "A day dedicated to encouraging people worldwide to reduce plastic bag use and protect the environment by opting for reusable bags.",
      "origin": "Started by environmental activists to raise awareness about plastic pollution and its impact on oceans and wildlife.",
      "category": "Environmental Awareness",
      "emoji": "♻️",
      "funFact": "If everyone used just one less plastic bag a week, it would save billions of bags annually worldwide!"
    },
    {
      "name": "Stay Out of the Sun Day",
      "description": "An unusual observance encouraging people to take a break from the scorching summer sun and find some shade or indoor activities.",
      "origin": "Coined by health advocates to remind people to avoid sun overexposure and reduce the risk of sunburns and skin cancer.",
      "category": "Health & Wellness",
      "emoji": "🕶️",
      "funFact": "July is typically one of the hottest months, making this an odd yet timely holiday to chill and protect your skin!"
    },
    {
      "name": "Compliment Your Mirror Day",
      "description": "A quirky self-love celebration where you give your reflection some kind words and positive affirmations.",
      "origin": "An internet-born daily reminder to boost self-esteem and body positivity by appreciating oneself.",
      "category": "Self-Care & Mental Health",
      "emoji": "🪞",
      "funFact": "Talking kindly to your reflection can improve mood and increase self-confidence over time!"
    },
    {
      "name": "Stay Away from Seattle Day",
      "description": "A tongue-in-cheek unofficial holiday where people joke about avoiding the rainy and cloudy weather of Seattle.",
      "origin": "Pop culture and travel jokes about Seattle's famously gloomy climate inspired this lighthearted day.",
      "category": "Pop Culture & Humor",
      "emoji": "☔",
      "funFact": "Seattle actually rains less annually than cities like New York and Miami, but the gray days make it feel like it rains nonstop!"
    }
  ]
}