{
  "date": "July 6",
  "holidays": [
    {
      "name": "International Kissing Day",
      "description": "A day encouraging people to pucker up and spread love through kisses—any kind of kiss counts! From cheek pecks to romantic smooches, it's all about sharing affection.",
      "origin": "Started in the UK in the 1990s, this day celebrates the universal language of love: kissing.",
      "category": "Love & Relationships",
      "emoji": "💋",
      "funFact": "Legends say the longest recorded kiss lasted an incredible 58 hours, 35 minutes, and 58 seconds!"
    },
    {
      "name": "World Zoonosis Day",
      "description": "Commemorates the work of Louis Pasteur and the first successful rabies vaccination on this day in 1885. It raises awareness about zoonoses — diseases that can be transferred from animals to humans.",
      "origin": "Established by the World Health Organization to highlight the importance of veterinarians and medical researchers in combating animal-borne diseases.",
      "category": "Health & Awareness",
      "emoji": "🐾",
      "funFact": "Over 60% of infectious diseases in humans are zoonotic, making this day crucial for education!"
    },
    {
      "name": "International Freezer Pop Day",
      "description": "A super chill day to enjoy those colorful, icy treats that bring summer joy and brain-freeze alike! Also known as ice pops, freezer pops come in endless flavors and are a nostalgic favorite worldwide.",
      "origin": "An unofficial, fun summer celebration to beat the heat with frozen treats.",
      "category": "Food & Fun",
      "emoji": "🍧",
      "funFact": "Did you know the first ice pop was invented by an 11-year-old in 1905? He accidentally left a soda outside overnight with a stick in it!"
    },
    {
      "name": "World Chocolate Day (some countries)",
      "description": "A day dedicated to indulging in the sweet, rich delight of chocolate. While most celebrate it on July 7, some countries and communities start the celebration on July 6!",
      "origin": "Marks the introduction of chocolate to Europe in 1550 after the Spanish conquest of the Aztec Empire.",
      "category": "Food",
      "emoji": "🍫",
      "funFact": "Chocolate was once used as currency by the Aztecs and was considered the 'food of the gods.'"
    }
  ]
}