{
  "date": "July 8",
  "holidays": [
    {
      "name": "Global Forgiveness Day",
      "description": "A day dedicated to letting go of grudges, offering forgiveness, and promoting emotional healing worldwide.",
      "origin": "Inspired by psychological research showing the health benefits of forgiveness, this day encourages acts of kindness and reconciliation.",
      "category": "Awareness",
      "emoji": "💖",
      "funFact": "Studies have shown that practicing forgiveness can reduce stress and improve cardiovascular health, making this day good for both your heart and soul!"
    },
    {
      "name": "Video Game Day",
      "description": "Celebrate your favorite virtual worlds! This day honors the art, culture, and community of video gaming.",
      "origin": "Unfolded from gaming communities wanting a dedicated day to share their passion and highlight the impact of video games globally.",
      "category": "Pop Culture",
      "emoji": "🎮",
      "funFact": "The longest video game marathon lasted 138 hours, proving some gamers really do live in their consoles!"
    },
    {
      "name": "Tell the Truth Day",
      "description": "An unusual observance encouraging honesty in all conversations—no white lies allowed!",
      "origin": "Started as a social experiment to promote authenticity and transparency in human interactions.",
      "category": "Social Experiment",
      "emoji": "🗣️",
      "funFact": "It’s harder than it sounds! Many participants confess that a full day of unfiltered truth-telling made relationships both stronger and more awkward."
    },
    {
      "name": "National Chicken Wing Day (Canada)",
      "description": "A cluckin’ good celebration of everyone's favorite finger food: chicken wings!",
      "origin": "Started by wing enthusiasts in Canada to honor the most delicious part of the bird.",
      "category": "Food",
      "emoji": "🍗",
      "funFact": "Chicken wings were once considered scraps until bars popularized them; now they’re a global sensation with thousands of flavor combos!"
    }
  ]
}