{
  "date": "July 9",
  "holidays": [
    {
      "name": "National Sugar Cookie Day",
      "description": "A sweet day dedicated to celebrating the simple yet delicious sugar cookie. This day is perfect for baking, decorating, and sharing sugar cookies with friends and family.",
      "origin": "The exact origin is unclear, but it is believed to have started as a fun way to honor the classic sugar cookie, a staple in American baking traditions.",
      "category": "Food Holiday",
      "emoji": "🍪",
      "funFact": "Sugar cookies have been around since at least the 1700s and were originally created as a holiday treat because the simple ingredients were easy to store over winter."
    },
    {
      "name": "Gulliver's Day",
      "description": "A quirky day celebrating the adventures of Lemuel Gulliver, the fictional protagonist of Jonathan Swift's satirical classic, 'Gulliver's Travels.' Fans of literature and satire mark the day with readings or themed parties.",
      "origin": "Named after Gulliver's Travels, published in 1726, this day recognizes the enduring impact of Swift's social commentary through fantasy and adventure.",
      "category": "Literary Celebration",
      "emoji": "📚",
      "funFact": "Jonathan Swift’s Gulliver’s Travels was one of the earliest examples of science fiction and political satire, mocking the British government and society."
    },
    {
      "name": "National Paloma Day",
      "description": "This day celebrates the Paloma, a delicious and refreshing Mexican cocktail made with tequila and grapefruit soda. It’s a perfect excuse to toast summer with friends!",
      "origin": "Though not an official holiday, bartenders and cocktail enthusiasts promote this day to spotlight one of Mexico's most popular drinks.",
      "category": "Food & Drink Holiday",
      "emoji": "🍹",
      "funFact": "The Paloma is said to be Mexico's favorite mixed drink, even more popular than the Margarita in many regions."
    },
    {
      "name": "Don't Step on a Bee Day",
      "description": "A peculiar reminder to watch your step and appreciate the importance of bees in the ecosystem. It’s a quirky way to promote awareness about pollinators and their role in the environment.",
      "origin": "Started by environmental groups to raise awareness about the declining bee populations and the need to protect them.",
      "category": "Environmental Awareness",
      "emoji": "🐝",
      "funFact": "Bees are responsible for pollinating about one-third of the food we eat—without them, many fruits and vegetables would become scarce!"
    }
  ]
}