{
  "date": "July 11",
  "holidays": [
    {
      "name": "World Population Day",
      "description": "A day dedicated to raising awareness about global population issues and the impact on resources, environment, and development.",
      "origin": "Established by the United Nations in 1989, inspired by the day when the world's population reached 5 billion in 1987.",
      "category": "Awareness",
      "emoji": "🌍",
      "funFact": "The global population continues to grow rapidly, but on World Population Day people reflect on the challenges and opportunities of this growth."
    },
    {
      "name": "National 7-Eleven Day (USA)",
      "description": "Celebrate the convenience store giant by grabbing a free Slurpee or other tasty treat at 7-Eleven locations nationwide!",
      "origin": "Started by 7-Eleven in the 1990s to promote the store and reward customers each year on 7/11.",
      "category": "Food & Pop Culture",
      "emoji": "🥤",
      "funFact": "On July 11, 7-Eleven often gives away millions of free Slurpees, making it one of the largest free giveaway events! Bonus points if you try to drink it with those tiny red spoon straws."
    },
    {
      "name": "All American Pet Photo Day",
      "description": "A fun day to snap and share adorable and funny pictures of your pets to celebrate all the furry, fluffy, scaly, or feathery members of the family.",
      "origin": "Created in 2003 by Chrisic from PetPics.net to bring pet lovers together worldwide.",
      "category": "Pop Culture/Animals",
      "emoji": "🐕📸",
      "funFact": "Thousands of pet photos flood social media on this day, often leading to viral cuteness overload!"
    },
    {
      "name": "Uncommon Instrument Day",
      "description": "Celebrate musical instruments you don’t see every day — from glass armonicas to theremins to musical saws!",
      "origin": "A quirky day started by fans of unusual instruments, encouraging people to explore and appreciate musical oddities.",
      "category": "Music/Quirky",
      "emoji": "🎶🎵",
      "funFact": "The theremin, an uncommon instrument, is played without physical contact — you wave your hands in the air to control pitch and volume!"
    }
  ]
}