{
  "date": "July 13",
  "holidays": [
    {
      "name": "Embrace Your Geekness Day",
      "description": "A day to proudly celebrate all things nerdy and geeky — from comic books and video games to science fiction and technology.",
      "origin": "Created by geek culture enthusiasts to encourage self-expression and pride in niche interests.",
      "category": "Pop Culture / Hobby",
      "emoji": "🤓",
      "funFact": "The word 'geek' once was an insult meaning a carnival performer who did bizarre acts — now it's a badge of honor!"
    },
    {
      "name": "National French Fry Day",
      "description": "A tempting food holiday dedicated to celebrating the beloved crispy, golden French fry in all its forms.",
      "origin": "Borne out of America's love for fast food and all things potato, this day honors the French fry's unmatched popularity.",
      "category": "Food",
      "emoji": "🍟",
      "funFact": "Despite the name, many believe French fries actually originated in Belgium, where fried potatoes were a staple since the late 1600s."
    },
    {
      "name": "Fortune Cookie Day",
      "description": "Celebrate the quirky cookie that delivers a message (and sometimes a puzzle) after your meal!",
      "origin": "Attributed to Californian Chinese restaurateurs in the early 20th century, though the exact origins are debated.",
      "category": "Food / Culture",
      "emoji": "🥠",
      "funFact": "Fortune cookies were popularized in San Francisco and Los Angeles long before becoming a staple in Chinese restaurants nationwide."
    },
    {
      "name": "International Kissing Day",
      "description": "A charming and sweet holiday that encourages you to celebrate affection and the simple joy of a kiss in all its forms.",
      "origin": "Started by face-to-face greeting advocates who believe a kiss reduces stress and strengthens bonds.",
      "category": "Romance / Social",
      "emoji": "💋",
      "funFact": "Kissing releases a cocktail of chemicals including oxytocin, which helps strengthen emotional bonds!"
    }
  ]
}