{
  "date": "July 14",
  "holidays": [
    {
      "name": "Bastille Day",
      "description": "France’s national day commemorating the storming of the Bastille prison in 1789, symbolizing liberty and the French Revolution.",
      "origin": "Marks the French Revolution’s pivotal event on July 14, 1789, when revolutionaries stormed the Bastille fortress-prison in Paris.",
      "category": "Historical / National Holiday",
      "emoji": "🇫🇷",
      "funFact": "The largest military parade in Europe marches down the Champs-Élysées every Bastille Day."
    },
    {
      "name": "National Mac and Cheese Day",
      "description": "A delicious day to celebrate the creamy, cheesy comfort food favorite: macaroni and cheese.",
      "origin": "An unofficial food holiday created to honor the classic American comfort dish beloved by millions.",
      "category": "Food Holiday",
      "emoji": "🧀",
      "funFact": "Mac and cheese became popular in the U.S. after Thomas Jefferson brought back a pasta and cheese recipe from Italy."
    },
    {
      "name": "World Chimpanzee Day",
      "description": "An awareness day dedicated to the protection and appreciation of chimpanzees and their habitat.",
      "origin": "Established by conservation groups to promote the protection of chimpanzees worldwide on their birth month.",
      "category": "Awareness / Conservation",
      "emoji": "🐒",
      "funFact": "Chimpanzees share about 98% of their DNA with humans, making them our closest animal relatives."
    },
    {
      "name": "National Tape Measure Day",
      "description": "A quirky celebration honoring the invention of the tape measure, an essential tool for measurements in daily life.",
      "origin": "Commemorates the birthday of Alvin J. Fellows, who patented the spring tape measure in 1868.",
      "category": "Invention / Tool Holiday",
      "emoji": "📏",
      "funFact": "The first modern tape measure was invented by Alvin J. Fellows in 1868, revolutionizing measuring for inventors and builders alike."
    }
  ]
}