{
  "date": "July 15",
  "holidays": [
    {
      "name": "Give Something Away Day",
      "description": "A whimsical day encouraging people to give something — anything! — away to brighten someone else's day and spread kindness without expecting anything in return.",
      "origin": "Popularized by various online communities promoting acts of kindness and generosity, this day urges spontaneous giving to foster goodwill.",
      "category": "Kindness & Charity",
      "emoji": "🎁",
      "funFact": "Some people have reported giving away very unusual items on this day, like a single sock or a spoon, just to keep the spirit quirky and fun!"
    },
    {
      "name": "Gummi Worm Day",
      "description": "Dedicated to celebrating the long, squiggly gummy worms beloved by candy enthusiasts everywhere. A sweet excuse to snack on these colorful chewy treats!",
      "origin": "Created by candy lovers and marketers to highlight the iconic gummy worm candy originally introduced in the 1980s.",
      "category": "Food & Candy",
      "emoji": "🍬",
      "funFact": "Gummi worms were originally made in Germany using beeswax and starch before American companies popularized the gelatin-based versions."
    },
    {
      "name": "Strawberry Rhubarb Pie Day",
      "description": "Honoring the deliciously tangy and sweet strawberry rhubarb pie, a summer classic dessert that marked cooler countryside picnics and family gatherings for generations.",
      "origin": "Inspired by the seasonal availability of strawberries and rhubarb and pie-baking traditions, this day invites baker enthusiasts to celebrate this unique flavor combo.",
      "category": "Food & Dessert",
      "emoji": "🥧",
      "funFact": "Strawberry rhubarb pie reportedly dates back to the 1800s in the US, where rhubarb was prized for its tartness and medicinal properties."
    },
    {
      "name": "World Youth Skills Day",
      "description": "A global awareness day proclaimed by the United Nations to spotlight the importance of equipping young people with skills for employment, decent work, and entrepreneurship.",
      "origin": "Established in 2014 by the UN to raise awareness about the challenges facing youth in the labor market and the need for skill development programs.",
      "category": "Awareness & Education",
      "emoji": "🌍",
      "funFact": "Each year, World Youth Skills Day hosts events worldwide, from skill competitions to career fairs, celebrating the talents of young people everywhere."
    }
  ]
}