{
  "date": "July 17",
  "holidays": [
    {
      "name": "World Emoji Day",
      "description": "A day dedicated to celebrating the fun, expressive, and colorful world of emojis that spice up our digital conversations.",
      "origin": "July 17 was chosen because the calendar emoji 📅 typically shows this date on Apple's iOS dating back to 2013, marking the first announcement of the iCal application.",
      "category": "Pop Culture",
      "emoji": "📅",
      "funFact": "World Emoji Day was first celebrated in 2014 and has since become an annual event where new emojis are often previewed or launched."
    },
    {
      "name": "National Tattoo Day (US)",
      "description": "A day to honor the art of tattoos, the artists who create them, and all those who wear their stories on their skin.",
      "origin": "Began as an informal celebration among tattoo communities in the United States and gained traction as a fun day to appreciate body art.",
      "category": "Culture/Art",
      "emoji": "🖋️",
      "funFact": "Tattooing is one of the oldest forms of body modification, with archaeological evidence dating back over 5,000 years!"
    },
    {
      "name": "Yellow Pig Day",
      "description": "A quirky, math-themed holiday celebrating the number 17, which is a prime number, with the yellow pig as its mascot.",
      "origin": "Started at the University of Illinois at Urbana-Champaign by math enthusiasts and described in the humorous 'Yellow Pig' concept created by mathematician Ed Barbeau.",
      "category": "Geek Culture",
      "emoji": "🐷",
      "funFact": "It’s celebrated on July 17 (7/17) because 17 is the smallest whole number that’s the sum, product, and count of its prime factors!"
    },
    {
      "name": "Gummi Worm Day",
      "description": "A sweet and chewy celebration of everyone's favorite gummy candy worm, perfect for indulging your candy cravings.",
      "origin": "An unofficial food holiday created by candy lovers and marketers, spotlighted in the summer when candy sales often rise.",
      "category": "Food",
      "emoji": "🍬",
      "funFact": "Gummi worms were the first gummy candies introduced in the US in the early 1980s and helped popularize the gummy candy craze!"
    }
  ]
}