{
  "date": "July 21",
  "holidays": [
    {
      "name": "National Junk Food Day",
      "description": "A day dedicated to indulging in your favorite guilty pleasure snacks like chips, candy, and fast food without any guilt!",
      "origin": "An unofficial food holiday created by snack lovers to celebrate the tastiest, most calorie-rich treats.",
      "category": "Food Holiday",
      "emoji": "🍟",
      "funFact": "Eating junk food can stimulate the brain's reward centers similar to addictive substances, which explains why it’s so hard to stop at just one chip!"
    },
    {
      "name": "National Ice Cream Day (Observed #2)",
      "description": "While the official National Ice Cream Day is celebrated on the third Sunday of July, many enjoy an extra ice cream day on July 21 to extend the sweet, chilly joy.",
      "origin": "An extension of the official holiday started by the U.S. in 1984 to honor ice cream and its makers.",
      "category": "Food Holiday",
      "emoji": "🍦",
      "funFact": "America produces over 1.4 billion gallons of ice cream annually—enough to fill more than two Olympic-sized swimming pools!"
    },
    {
      "name": "Hammock Day",
      "description": "Time to relax, chill out, and sway gently in a hammock—whether in your backyard or at the beach—to appreciate the fine art of doing nothing.",
      "origin": "An unofficial holiday encouraging people to take a break and enjoy leisure time in a hammock, credited to hammock enthusiasts worldwide.",
      "category": "Lifestyle",
      "emoji": "🛌",
      "funFact": "Hammocks were first used by indigenous peoples in Central and South America over 1,000 years ago to keep off the ground and away from pests."
    },
    {
      "name": "National Junk Food Day",
      "description": "Celebrate the unabashed joy of quick, convenient, and often unhealthy snacks that make life a little tastier and more exciting.",
      "origin": "Started by food enthusiasts and marketers to boost fun and sales of snack foods mid-summer.",
      "category": "Food Holiday",
      "emoji": "🍔",
      "funFact": "Despite their bad rap, junk foods often contain surprising amounts of vitamins and minerals due to fortification practices."
    }
  ]
}