{
  "date": "July 22",
  "holidays": [
    {
      "name": "Pi Approximation Day",
      "description": "A whimsical celebration of the mathematical constant π (pi) approximated as 22/7! Math enthusiasts and number nerds rejoice on this day with pie-eating contests, math puzzles, and pi-themed parties.",
      "origin": "The date 22/7 (July 22) is used because 22 divided by 7 is a common fractional approximation of pi.",
      "category": "Math/Science Celebration",
      "emoji": "🥧",
      "funFact": "Pi Approximation Day celebrates a rational approximation, whereas the actual value of pi is an irrational number with infinite non-repeating decimals."
    },
    {
      "name": "Ratcatcher's Day",
      "description": "Commemorates the legendary Ratcatcher of Hamelin, who is said to have rid the town of rats—and then mysteriously disappeared with the children! A quirky day to honor pest control and folklore.",
      "origin": "Based on the folkloric tale from Hamelin, Germany, where the Pied Piper lured away rats (then children) from the town in the Middle Ages.",
      "category": "Folklore/History",
      "emoji": "🐀",
      "funFact": "Some versions of the Ratcatcher's story suggest it is a metaphor for the Black Death and its impact on European towns."
    },
    {
      "name": "Pi Approximation Day (Alternate)",
      "description": "Even more math fun celebrating pi—not the exact date, but the fraction 22/7 that approximates it. Math geeks use this day to nerd out on calculations, constants, and sometimes eat lots of pie!",
      "origin": "The fraction 22 over 7, known since antiquity as a handy way to approximate pi, led to this numeric celebration.",
      "category": "Math/Science Celebration",
      "emoji": "🧮",
      "funFact": "Archimedes first provided 22/7 as an approximation for pi over 2000 years ago!"
    },
    {
      "name": "Moon Day",
      "description": "Remembering the first manned Moon landing by Apollo 11 astronauts in 1969, this day honors space exploration and humanity’s giant leap.",
      "origin": "July 20-22 marks the first successful Moon landing orbit and return to Earth by Apollo 11 astronauts in 1969, with some celebrations extending to July 22.",
      "category": "Space Exploration/Awareness",
      "emoji": "🌕",
      "funFact": "Neil Armstrong and Buzz Aldrin spent about 21 hours on the lunar surface, but Moon Day celebrations sometimes include the whole duration of the mission ending July 22."
    }
  ]
}