{
  "date": "July 23",
  "holidays": [
    {
      "name": "Embrace Your Geekness Day",
      "description": "A day to proudly celebrate your inner geek and all things nerdy, from comics and video games to science and fantasy novels.",
      "origin": "Started by internet communities wanting to promote geek culture and self-acceptance in the mid-2000s.",
      "category": "Pop Culture",
      "emoji": "🤓",
      "funFact": "The phrase 'geek chic' became popular around this day, celebrating how geek culture has influenced fashion and style."
    },
    {
      "name": "National Vanilla Ice Cream Day",
      "description": "A deliciously simple day dedicated to enjoying the classic and beloved vanilla ice cream flavor in all its creamy glory.",
      "origin": "Unofficial American food holiday created by ice cream enthusiasts and social media users.",
      "category": "Food",
      "emoji": "🍦",
      "funFact": "Despite being the ‘plainest’ flavor, vanilla is actually one of the most labor-intensive and costly flavors to produce due to vanilla bean cultivation."
    },
    {
      "name": "Beautiful Jest Day",
      "description": "An oddball day celebrated mainly online where people share clever jokes, puns, and witty humor that are both beautiful and silly.",
      "origin": "Birthed by a small humor website in the early 2010s aiming to spread smiles with lighthearted jesting.",
      "category": "Humor",
      "emoji": "🤡",
      "funFact": "This day encourages sharing ‘beautiful jests,’ which are jokes that are simultaneously clever, kind, and uplifting—not mean spirited!"
    },
    {
      "name": "National Hot Dog Day (Variable July Date)",
      "description": "Often celebrated in late July, this is the unofficial day to savor hot dogs in all their glory, from classic to bizarre toppings.",
      "origin": "Popularized by hot dog vendors and food festivals to boost summer sales.",
      "category": "Food",
      "emoji": "🌭",
      "funFact": "Though the date shifts, many places choose July 23 as a perfect hot dog celebration day in summer heat."
    }
  ]
}