{
  "date": "July 24",
  "holidays": [
    {
      "name": "National Cousins Day",
      "description": "A day dedicated to celebrating the bonds between cousins, those uniquely close relatives who often feel like siblings or best friends.",
      "origin": "Origin unknown, but embraced widely on social media as a way to appreciate family ties beyond immediate siblings and parents.",
      "category": "Family/Relationship",
      "emoji": "👫",
      "funFact": "Cousins once held special importance in royal successions and historical alliances, making this day a nod to those powerful family connections!"
    },
    {
      "name": "Simputeon Day",
      "description": "A quirky, unofficial holiday celebrated by fans of simulations and emulators, often marked by enjoying video game emulators or simulated environments.",
      "origin": "Named in geek circles, 'Simputeon' is a playful mashup of 'simulation' and 'emulation' highlighting digital nostalgia.",
      "category": "Pop Culture/Tech",
      "emoji": "🕹️",
      "funFact": "On Simputeon Day, some fans host marathons of classic games running on emulators, reliving pixelated memories from decades ago."
    },
    {
      "name": "National Tequila Day",
      "description": "A spirited celebration honoring tequila, the iconic Mexican distilled beverage made from the blue agave plant.",
      "origin": "Became popularized in the U.S. during the 2000s as tequila gained popularity far beyond Mexico.",
      "category": "Food & Drink",
      "emoji": "🍹",
      "funFact": "Tequila must be made from at least 51% blue agave, but the best ones are 100% blue agave and have distinct regional flavors."
    },
    {
      "name": "Amelia Earhart Day",
      "description": "A day to commemorate pioneering aviator Amelia Earhart, the first woman to fly solo across the Atlantic Ocean.",
      "origin": "Observed on her birthday, July 24, to honor her adventurous spirit and contributions to aviation.",
      "category": "History/Aviation",
      "emoji": "✈️",
      "funFact": "Despite her disappearance in 1937, Amelia Earhart remains a symbol of courage and tenacity, inspiring countless pilots and explorers."
    }
  ]
}