{
  "date": "July 25",
  "holidays": [
    {
      "name": "National Threading the Needle Day",
      "description": "Celebrate the tiny art of threading a needle — an oddly satisfying and surprisingly tricky task! Perfect for crafters and anyone who enjoys a good close-up challenge.",
      "origin": "Likely started by sewing enthusiasts and crafters to honor skill and patience involved in needle threading.",
      "category": "Crafts & Skills",
      "emoji": "🧵",
      "funFact": "Threading a needle is so satisfying that some people use it as a calming activity to improve concentration and reduce stress."
    },
    {
      "name": "Gastronomy Exploration Day",
      "description": "A quirky unofficial holiday encouraging adventurous eaters to try something new and weird food-wise on July 25th.",
      "origin": "Originated in foodie circles to promote culinary curiosity and cultural food exploration.",
      "category": "Food & Culture",
      "emoji": "🍽️",
      "funFact": "Every year on this day, people share pictures of their weirdest food finds on social media, from fried insects to bizarre desserts."
    },
    {
      "name": "Morse Code Day",
      "description": "Celebrate the invention of Morse code by Samuel Morse, the early communication breakthrough using dots and dashes.",
      "origin": "Commemorates the birthday of Samuel Morse (April 27, but observance chosen differently by enthusiasts) or important dates related to Morse code.",
      "category": "Communication & Technology",
      "emoji": "📡",
      "funFact": "Morse code was used extensively during World War II and is still used by amateur radio operators worldwide today."
    },
    {
      "name": "Tell an Old Joke Day",
      "description": "A fun day to resurrect those classic, sometimes cringe-worthy old jokes from the past and share some laughs, groans, and eye rolls.",
      "origin": "Informal internet-born celebration to spread humor and nostalgia.",
      "category": "Humor & Entertainment",
      "emoji": "😂",
      "funFact": "Many 'old jokes' date back decades or centuries and often reflect the social humor of their era!"
    }
  ]
}