{
  "date": "July 30",
  "holidays": [
    {
      "name": "International Day of Friendship",
      "description": "A day dedicated to celebrating the importance of friends and friendships around the world.",
      "origin": "Established by the United Nations in 2011 to promote peace and bridge cultures through friendship.",
      "category": "Awareness / Social",
      "emoji": "🤝",
      "funFact": "It's said that a genuine friend can help reduce stress and even improve your lifespan—friends really are the family you choose!"
    },
    {
      "name": "Father-in-Law Day",
      "description": "A quirky holiday to honor the often underappreciated father-in-law and acknowledge his role in the family.",
      "origin": "Created in 1981 by Sonora Smart Dodd, who also created Father's Day, though this one remained much more niche.",
      "category": "Family / Social",
      "emoji": "👴",
      "funFact": "Unlike Father's Day, Father-in-Law Day hasn't caught on widely, so wishing your father-in-law a happy day is guaranteed to surprise him!"
    },
    {
      "name": "Talk Like a Pirate Day",
      "description": "A fun observance where people speak in pirate lingo, wear pirate costumes, and celebrate pirate culture with jest and humor.",
      "origin": "Started as a joke in 1995 by friends John Baur and Mark Summers, inspired by a pirate-themed episode of a TV show.",
      "category": "Pop Culture / Fun",
      "emoji": "🏴‍☠️",
      "funFact": "International Talk Like a Pirate Day has led to real piracy-themed promotions and even special offers at some bars and restaurants worldwide."
    },
    {
      "name": "Cheese Slice Day",
      "description": "A deliciously quirky day celebrating the mighty cheese slice, an essential in many sandwiches and snacks.",
      "origin": "Created by food enthusiasts to highlight the convenience and taste of pre-sliced cheese processing.",
      "category": "Food / Fun",
      "emoji": "🧀",
      "funFact": "The invention of the cheese slicer in the early 20th century in Norway was a game-changer, but the pre-sliced cheese we celebrate today became popular only in the 1950s!"
    }
  ]
}