{
  "date": "July 31",
  "holidays": [
    {
      "name": "Uncommon Instrument Appreciation Day",
      "description": "A day dedicated to celebrating unusual, rare, or lost musical instruments from around the world.",
      "origin": "Created by music enthusiasts and ethnomusicologists to raise awareness about unique sounds and musical traditions that rarely get mainstream attention.",
      "category": "Music & Culture",
      "emoji": "🎶",
      "funFact": "Some instruments featured on this day include the serpent (a medieval wind instrument) and the waterphone, famous for its eerie sound in horror movies."
    },
    {
      "name": "Mutt’s Day",
      "description": "A playful day to honor and appreciate mixed-breed dogs, often considered the underdogs of the canine world.",
      "origin": "Began as a grassroots movement among dog lovers to celebrate mutts and encourage adoption rather than purchasing purebreds.",
      "category": "Animal & Pets",
      "emoji": "🐶",
      "funFact": "Studies show that mutts often have fewer genetic health problems than some purebred dogs."
    },
    {
      "name": "System Administrator Appreciation Day (Observed)",
      "description": "While officially the last Friday in July, some tech circles cheekily celebrate on July 31 as well to honor the hardworking system admins who keep the digital world running.",
      "origin": "Started in the late 1990s within the IT community to highlight the crucial, often unseen work of system administrators.",
      "category": "Technology & Workplace",
      "emoji": "👨‍💻",
      "funFact": "The day is sometimes called 'SysAdmin Day' and inspired many quirky gifts like coffee mugs printed with server jokes."
    },
    {
      "name": "Avocado Day",
      "description": "A day to celebrate the creamy, versatile fruit loved by millennials and foodies worldwide.",
      "origin": "Not officially declared by any global body but popularized via social media and food blogs of the late 2010s.",
      "category": "Food & Drink",
      "emoji": "🥑",
      "funFact": "Around July, avocados are often at their peak season in many parts of the Northern Hemisphere."
    }
  ]
}